{"id":1,"date":"2019-05-20T12:17:49","date_gmt":"2019-05-20T12:17:49","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1"},"modified":"2020-01-13T12:06:25","modified_gmt":"2020-01-13T12:06:25","slug":"hello-world","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-industry-news\/hello-world\/","title":{"rendered":"Energy Trends in Kenya"},"content":{"rendered":"\n<p>Since 2005, the Kenyan energy sector has received a major boost. Mainly through large investments in wind and geothermal energy projects. However, the demand for energy is increasing at a very fast rate due to population increase and industrialization.<\/p>\n\n\n\n<p>On the global front, demand for energy is two-fold. With users from developed nations needing more electrical appliances, and industrialization taking shape in the developing countries. The world’s energy demand is on an upward trend at a projected 44% increase by 2030. Interestingly, global power production is even higher and is expected to grow by 76% in 2030.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Population growth<\/h4>\n\n\n\n<p>Population growth is at the centre of this phenomenal energy demand. According to a UN report released in 2012, Africa and Asia are experiencing unprecedented population growth. <\/p>\n\n\n\n<p>By 2050, the UN notes that urban population in both continents will have grown tremendously.  With African cities recording 1.2 billion people, while Asian cities will accommodate 3.3 billion. According to the UN Department of Economic and Social Affairs, the two continents account for 86% of the world’s urban population growth. As the report further predicts, great challenges in the energy and environmental aspects will arise as a result of this growth.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Global energy demand<\/h4>\n\n\n\n<p>Similar to the global energy situation, the demand for energy in Africa will expectedly increase in the next few decades. Rural-urban migration is still rife as the economies in Africa become more industrialized.<\/p>\n\n\n\n<p>Analysts have always termed Africa as a sleeping energy giant. This is due to the many energy resources lying unused in this continent. From fossil fuel reserves alone, Africa can comfortably cater for her energy needs. Other huge energy sources in Africa include geothermal and solar resource.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">A focus on Kenya<\/h4>\n\n\n\n<p>Kenya is a model of the situation in Africa; out of its 9000MW geothermal energy potential, only 130MW is now harnessed. Since the energy demand in Kenya is on the upward trend. Continued exploitation of geothermal resources is one of the best ways of reducing pressure on hydropower and other conventional energy sources.<\/p>\n\n\n\n<p>All indications show that the energy solution in Kenya lies in the geothermal resource. The Government of Kenya has set aside $1.4 billion for new geothermal power plants. A case in point was the launching of a 280MW geothermal power plant in Naivasha by former President Mwai Kibaki on 23rd July 2012. A lot is in store for the future, with projections of 5GW geothermal power production by 2030. There is even better news for Kenya after the discovery of oil reserves in Turkana County.<\/p>\n\n\n\n<p>As Kenya strives to get an industrialized economy status by 2030, sustainable energy production is the priority. There is danger in overdependence on hydrothermal energy, which presently caters for close to 60% of energy in Kenya. Due to concerns about irregular rainfall, unpredictable oil prices and negative effects of fossil fuels. The best solution for Kenya’s energy lies in green energy, mainly geothermal.<\/p>\n<div class=\"energ-after-content\" id=\"energ-2956799150\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Since 2005, the Kenyan energy sector has received a major boost. Mainly through large investments in wind and geothermal energy projects. However, the demand for energy is increasing at a very fast rate due to population increase and industrialization. On the global front, demand for energy is two-fold. With users from developed nations needing more [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":651,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[24],"tags":[],"class_list":["post-1","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-energy-industry-news"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1\/revisions"}],"predecessor-version":[{"id":1514,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1\/revisions\/1514"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/651"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}