{"id":1038,"date":"2019-03-13T08:14:04","date_gmt":"2019-03-13T08:14:04","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1038"},"modified":"2020-01-13T12:26:24","modified_gmt":"2020-01-13T12:26:24","slug":"high-electricity-bills-system-error-or","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/high-electricity-bills-system-error-or\/","title":{"rendered":"8 Most Important Electricity Bill Components"},"content":{"rendered":"\n<h3 class=\"wp-block-heading\">High Electricity Bills &#8211; System Error or ……………………..?<\/h3>\n\n\n\n<p>The cost of electricity in Kenya has over the past year been rising, albeit in an incremental manner that may have gone unnoticed. Such high cost is now becoming apparent, threatening to worsen the cost of living. So far, power cost has over the last one year grown by 20 per cent according to one of the leading dailies – The Standard Newspaper published on 28th November 2017, while the three commonly used fuels of kerosene, diesel and super petrol have hit a three-year high. The cost of fuel might further go up, considering there has been notable rise in the pricing of crude oil in the international markets over the last few months.<\/p>\n\n\n\n<p>However, in January this year KPLC through the Ministry of Energy hinted at high electricity costs due to backdated bills. A move that was later challenged in court and the ministry shifted the blame game and apportioned it to “a new system.” So today we take a look at components of both pre-paid and postpaid charges of an electricity bill and how these components affect the total fee payable to our utility provider. According to the information published on the ERC website, these are the electricity bill components;<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>FIXED CHARGE<\/strong><\/h4>\n\n\n\n<p>This is normally a cost that goes towards making the service available, including installation and maintenance of poles, power lines and equipment, and 24-hour customer care.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>FUEL COST CHARGE (FCC)<\/strong><\/h4>\n\n\n\n<p>This is normally the added cost or rebates to the consumers as a result of fluctuations in world prices as well as fluctuations in the quantity of oil consumed by electricity generation. The fuel cost charge lags one month behind the actual price of the fuel. This money is normally collected by KPLC and all of it is passed on directly to electricity generation companies, who in turn pay fuel suppliers. It is important to note that this cost varies monthly depending on the quantity of thermal generation and the cost of fuel.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>FOREX ADJUSTMENT (FOREX)<\/strong><\/h4>\n\n\n\n<p>The foreign exchange component is related to the fluctuation of hard currencies against the Kenya Shilling for expenditure related to the power sector e.g. projects loan repayments.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>ERC LEVY<\/strong><\/h4>\n\n\n\n<p>This is normally a levy passed on to the Energy Regulatory Commission (ERC), the regulatory arm of the energy sector as operational cost. It is currently set at 3 cents per kilowatt hour.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>REP LEVY<\/strong><\/h4>\n\n\n\n<p>This is 5% levy on the cost of the units of power consumed by a customer. It is passed on to the Rural Electrification Authority (REA) for implementation of the rural electrification projects.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>VAT (16%)<\/strong><\/h4>\n\n\n\n<p style=\"text-align:left\">This statutory levy amounting to 16% of the total bill and is passed on to the Kenya Revenue Authority (KRA).<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>WARMA levy<\/strong><\/h4>\n\n\n\n<p style=\"text-align:left\">Is currently set at 0.05 cents per kilowatt hour and is passed to the Water Resource Management Authority (WARMA) for hydro-power generation of 1Megawatt and above. In the pre-paid token receipt WARMA levy is combined with the ERC levy.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>CONSUMPTION CHARGE<\/strong><\/h4>\n\n\n\n<p>This is your electricity consumption within the billing period. One unit is equivalent to one kilowatt hour. KPLC uses part of this money to procure bulk power from electricity generating companies, which it retails to its customers.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>So Has It Been System Error?<\/strong><\/h4>\n\n\n\n<p>A while back the ministry of energy apportioned the blame of errors on electricity bill to the then system upgrade. But how could a new system that was expected to replace an old one have errors?<br>Its common knowledge that system upgrades should lead to efficient, error free and better service delivery. Before a new system is introduced in any organization or business, the new system is left to run parallel with the old system for a period of time. This is normally done to help get rid of bugs and ensuring that the new system is efficient and error free. This period normally referred as a pilot period helps gauge the efficiency of a new system based on its performance on selected users.<\/p>\n\n\n\n<p>So did our utility provider have a pilot test for the new system? My opinion is that KPLC is and has always been approximating electricity bills.<br>How do we get out of the mess?<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Understand Your Bill<\/strong><\/h4>\n\n\n\n<p>One way out is for customers to be keen on the bills presented to them by the utility provider, one needs to understand how to read their bills and identify any errors. Always request for the hard copy bills and verify, check your tariff!! There are online tools such as <a href=\"https:\/\/stima.regulusweb.com\/\">stima.regulusweb.com<\/a> that can help you verify your bill. The tool allows consumers in Kenya to calculate current and historic electricity costs.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Install Energy Monitors<\/strong><\/h4>\n\n\n\n<p>Another way for domestic consumers, consumers on Small Commercial tariff and other higher tariff from CI1 onwards, is to install energy monitoring systems. Majority of consumers do not know their average monthly consumption, facility owners rely on KPLC bills to determine their consumption. This allows utility provider to slam any bill which Kenyans innocently pay. Keep track of your energy usage.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Manage Your Energy Consuming Appliances<\/strong><\/h4>\n\n\n\n<p>For domestic consumers there is need to employ basic energy saving tips. Saving energy isn&#8217;t just about helping you to save electricity or be more energy efficient — it&#8217;s also a great way to save money especially at this hard economic time. <strong>Switch it off and save<\/strong>. Unplug all the appliances that you aren&#8217;t using regularly &#8211; even chargers continue to use electricity when they aren&#8217;t charging. Also, make sure you&#8217;re not leaving appliances on standby: it may be easier but it&#8217;s also a guaranteed way to waste energy compared to turning things off at the socket.<br>Kevin Ooro – Energy engineer (Eenovators Limited)<\/p>\n\n\n\n<p><strong>Reference:<\/strong><br>https:\/\/www.erc.go.ke\/<br>http:\/\/kplc.co.ke\/knowyourbill\/<\/p>\n\n\n\n<figure class=\"wp-block-embed\"><div class=\"wp-block-embed__wrapper\">\nhttps:\/\/www.standardmedia.co.ke\/business\/article\n<\/div><\/figure>\n<div class=\"energ-after-content\" id=\"energ-219073160\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>High Electricity Bills &#8211; System Error or ……………………..? The cost of electricity in Kenya has over the past year been rising, albeit in an incremental manner that may have gone unnoticed. Such high cost is now becoming apparent, threatening to worsen the cost of living. So far, power cost has over the last one year [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1039,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[120,28,33,119,118],"class_list":["post-1038","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","tag-electricity","tag-energy","tag-energy-audits","tag-kplc","tag-power-bills"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1038","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1038"}],"version-history":[{"count":4,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1038\/revisions"}],"predecessor-version":[{"id":1396,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1038\/revisions\/1396"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1039"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1038"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1038"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1038"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}