{"id":1053,"date":"2019-04-04T09:25:43","date_gmt":"2019-04-04T09:25:43","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1053"},"modified":"2020-01-13T12:23:11","modified_gmt":"2020-01-13T12:23:11","slug":"solar-pv-regulations-2012-the-disconnect-on-system-design","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-industry-news\/solar-pv-regulations-2012-the-disconnect-on-system-design\/","title":{"rendered":"Solar PV Regulations 2012 Explained"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">The Disconnect on System Design<\/h2>\n\n\n\n<p>By Carolyne Gathuru. <\/p>\n\n\n\n<p>The energy sector in Kenya is quite robust with the gazettement of several regulations towards governing energy production, use, management, and conservation in the country. It has been said that Kenya is the country to watch with regards to innovative energy interventions in the continent and towards streamlining the energy sector for compliance; and the presence of strong regulatory and legislative frameworks, contribute to the furtherance of this specific energy vision, towards achievement of the country’s overall development targets. <\/p>\n\n\n\n<p>The Energy Act 2006 forms the basis from which these positive predictions are made, setting out the national policies and direction towards energy development. But as with all things legal, the delicate balance between ‘Enactment’ and ‘Enforcement’ of legislation remains with quite some distance to go. Beautiful laws are laid, seeing them play out in practical terms is where the rubber meets the road. <\/p>\n\n\n\n<p>However, even as the battle towards hands-on implementation continues, it is imperative to have regulation documented and enumerated in a way that leaves no doubt, has total clarity and spares no room for misinterpretation or dual nuances. <\/p>\n\n\n\n<p>With specific reference to The Energy (Solar Photovoltaic Systems) Regulations 2012, clause 3 requires that “A vendor or contractor shall be responsible for the design and specifications of complete solar PV systems, except in situations where customers purchase individual system components from different vendors in which case the customers shall indicate in the signed system design declaration form that they did not require the said design or specifications from the vendor or contractors”. <\/p>\n\n\n\n<p>A quick online study indicates that successful design work is very involving and requires both technical and environmental knowledge, including worst case scenarios and risk projections. The system design team or engineer, needs to be clued into the geographical variances that occur locally and globally, to then take into account the suitability of the physical equipment versus the implementation station. <\/p>\n\n\n\n<p>Emergent recommendations for system design competence, now include production modelling as a must have technical skill to holistically look at technical workability, equipment, layout and structural design. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\">In the light of these needs and with regards to the specific Energy Regulation on system design, many questions abound on the phrasing and indication of the clause including:-<\/h4>\n\n\n\n<ol class=\"wp-block-list\"><li>Multiple responsibilities exist for the system design. This can be done by the vendor or contractor or some third party who is neither of the two. Does this not open the door to lapses in responsibility and accountability should either party in this triangle not deliver as per expectations? In true Kenyan format the liable party would indicate “Hiyo system design haikuwa yetu” “We did not design that system”<\/li><li>Who ultimately is responsible for the “design and specifications of complete solar PV systems” as spelled out in the law? Who can be dragged to face the long arm of the law should the said design not meet best practice specifications?<\/li><li>The word ‘complete’ and the word ‘except’ are in contradiction of each other as used or expressed in this statute. Does this mean that if the system design is from the vendor or contractor then it need be complete and if not, as in the case of the mentioned purchase of individual components then the design from wherever it may be sourced from need not be complete?<\/li><li>The system design declaration form seems not available as a downloadable from the issuing authority. Where would the user or vendor, or contractor be they the installer, or any other party involved in the Solar PV implementation process find this document?<\/li><\/ol>\n\n\n\n<p>Many gray areas, loopholes, and opportunities for discord are witnessed in this excerpt from the Energy Regulations 2012. An urgent review is needed with the inputs from key stakeholders in the solar energy sector with conclusive experiences from real time application.<\/p>\n\n\n\n<p>The great thing about the law though, is that it is created to regulate industry and is subject to viable amendments and updates as and when the need may arise to better govern the sector. Regulatory changes may be driven by environmental circumstance, change in world policy, or industry demands to ensure more sustainable outcomes.<\/p>\n\n\n\n<p>The challenge therefore goes out to the regulator to not only look into this piece, but conduct a stakeholder audit of the entire batch constituting the Energy Regulations 2012, to enable relevant obsolescence of outdated sections, reinforcement of areas that require tighter focus and inclusion of previous omissions.<\/p>\n\n\n\n<p>The Ball is indeed in the Energy Regulations Court…. We await the next steps.<\/p>\n\n\n<p> <\/p>\n<p> <\/p>\n<p> <\/p><div class=\"energ-after-content\" id=\"energ-253439539\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>The Disconnect on System Design By Carolyne Gathuru. The energy sector in Kenya is quite robust with the gazettement of several regulations towards governing energy production, use, management, and conservation in the country. It has been said that Kenya is the country to watch with regards to innovative energy interventions in the continent and towards [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1056,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,24],"tags":[28,121,74,122,123],"class_list":["post-1053","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-energy-industry-news","tag-energy","tag-renewable-energy","tag-solar-energy","tag-solar-pv","tag-solar-pv-regulations-2012"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1053","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1053"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1053\/revisions"}],"predecessor-version":[{"id":1353,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1053\/revisions\/1353"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1056"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1053"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1053"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1053"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}