{"id":1073,"date":"2019-05-16T13:40:07","date_gmt":"2019-05-16T13:40:07","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1073"},"modified":"2020-01-13T12:08:43","modified_gmt":"2020-01-13T12:08:43","slug":"energy-and-food-security","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/energy-and-food-security\/","title":{"rendered":"ENERGY AND FOOD SECURITY"},"content":{"rendered":"<p>Ever thought of a relationship between energy and food security? Well the two are interlinked and have considerable impacts on the human livelihood and development.<\/p>\n<p><strong>But what is Energy Security?<\/strong><\/p>\n<p>The United Nations puts it as &#8220;access to clean, reliable and affordable energy services for cooking and heating, lighting, communications and productive uses&#8221; and as &#8220;uninterrupted physical availability at a price which is affordable, while respecting environment concerns&#8221;.<\/p>\n<p>And <strong>food security<\/strong> as defined by the Food and Agricultural Organization (FAO) is &#8220;availability and access to sufficient, safe and nutritious food to meet the dietary needs and food preferences for an active and healthy life&#8221;.<\/p>\n<p><strong>Introduction<\/strong><br \/>\nThere exists a gap between energy demand and the actual access to it especially in developing countries. Reduction of poverty in the community is dependent on full access electricity or access to commercial energy and energy efficient sources (UNDP, 2005) and this is still a challenge in many developing countries. Increasing access to energy services in the developing world is important in increase food security through irrigation, improving crop processing, preservation and storage. It could also strengthen the development of other income generating activities that will create livelihoods among populations to enable them buy food and sustain their families<\/p>\n<p>Energy affects food security both directly and indirectly. And food security also has a key role in alleviating energy poverty by being a source of energy. This cuts across food production, processing, storage, retail distribution and also in cooking and preparation. The cost of fuel\/energy has shown to increase the cost of food. FAO has found this has an evident link in food prices and energy prices (FAO, 2011a) e.g. if the cost of electricity\/ fuel\/other forms of energy go up, there is a high chance in increased cost of food production. Water as well plays a key role in the Food-Energy nexus for our Livelihoods as depicted in the image below.<br \/>\n<img decoding=\"async\" class=\"alignnone size-full wp-image-1076 lazyload\" data-src=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2018\/05\/1-1.png\" alt=\"\" width=\"632\" height=\"439\" data-srcset=\"https:\/\/energyzedworld.com\/wp-content\/uploads\/2018\/05\/1-1.png 632w, https:\/\/energyzedworld.com\/wp-content\/uploads\/2018\/05\/1-1-300x208.png 300w\" data-sizes=\"(max-width: 632px) 100vw, 632px\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 632px; --smush-placeholder-aspect-ratio: 632\/439;\" \/><\/p>\n<p><strong>Importance of energy in food security<\/strong><br \/>\nFood intake by most people worldwide comes from basic grains such as rice, corn, millets, wheat, beans, peas, green grams, lentils etc. which in all cases need to be cooked to be consumed, which requires heat energy, but their very production, harvest, and processing require energy inputs as well as for cultivation, irrigation, transport, and, while others require preservation.<\/p>\n<p>Energy security is important to food security and by Improving access to energy across the developing world is key to improving the lives of the poor communities. There is an estimated 2.7 billion people relying on traditional biomass for cooking and the overwhelming majority of the 1.4 billion without access to grid electricity. This people mainly live in Africa and South Asia (Karekezi S. et. Al). Without access to electricity and sustainable energy sources, communities have little chance to achieve food security and will have no opportunities to secure productive livelihoods as well as alleviate poverty.<\/p>\n<p>Energy plays a vital role in enhancing food security through technologies that can be used for irrigation and water pumping. Energy is required for mechanical power (water pumping or distribution) and this can be from grid-connected electricity, local motors using fuels, or renewable energy- derived water-lifting devices etc. Additionally, facilitating irrigation and use of cleaner and affordable energy options can help ensure food security among the poor in spite of increasingly frequent drought conditions in many countries. This may have significant potential for not only ensuring food supply throughout the year but also generating additional income for households (Karekezi et al., 2005).<\/p>\n<p>On the other hand, Renewable energy solutions including solar, wind, biofuels, hydro and geothermal can be used in agri-food systems as a substitute for fossil fuels to generate heat or electricity for use on farms or in aquaculture operations. If excess energy is produced, it can be exported off the property to earn additional revenue for the owners. Such activities can bring benefits to the community and make them independent<\/p>\n<p><strong>Conclusion<\/strong><br \/>\nFood security is not only dependent on availability of water but also on access to energy and of most importance is access to affordable energy sources and use of renewable energy across the community for sustainability and enhancing livelihoods.<\/p>\n<p><strong>References<\/strong><\/p>\n<ol>\n<li>UN Secretary General’s Advisory Group on Energy and Climate Change (AGECC), Summary Report and Recommendations, 28 April 2010, p. 13<\/li>\n<li>FAO. 1996. Rome Declaration on World Food Security and World Food Summit Plan of Action. World Food Summit 13–17 November 1996. Rome.<\/li>\n<li>Karekezi S., McDade S., Boardman B., Kimani J., Lustig N.: Energy, Poverty, and Development, <a href=\"http:\/\/www.iiasa.ac.at\/web\/home\/research\/Flagship-Projects\/Global-Energy-Assessment\/GEA_Chapter2_development_hires.pdf)\">http:\/\/www.iiasa.ac.at\/web\/home\/research\/Flagship-Projects\/Global-Energy-Assessment\/GEA_Chapter2_development_hires.pdf)<\/a><\/li>\n<li>UNDP, 2005 : Energizing the MDGs: A Guide to Energy’s Role in Reducing Poverty . United Nations Development Programme (UNDP) , New York, NY .<\/li>\n<li>Karekezi , S. , J. Kimani , A. Wambille , P. Balla , F. Magessa , W. Kithyoma , and X. Ochieng , 2005: The Potential Contribution of Non Electrical Renewable Energy Technologies (RETS) to Poverty Reduction in East Africa . Energy, Environment and Development Network for Africa , Nairobi .<\/li>\n<\/ol>\n<p>By Ms. Eleen Korir<\/p>\n<div class=\"energ-after-content\" id=\"energ-1118608757\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Ever thought of a relationship between energy and food security? Well the two are interlinked and have considerable impacts on the human livelihood and development. But what is Energy Security? The United Nations puts it as &#8220;access to clean, reliable and affordable energy services for cooking and heating, lighting, communications and productive uses&#8221; and as [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1078,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[141,142,138,139,140],"class_list":["post-1073","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","tag-energy-and-food-security","tag-energy-security","tag-food","tag-food-and-energy","tag-food-security"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1073","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1073"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1073\/revisions"}],"predecessor-version":[{"id":1077,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1073\/revisions\/1077"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1078"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1073"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1073"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1073"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}