{"id":1084,"date":"2019-05-17T10:36:40","date_gmt":"2019-05-17T10:36:40","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1084"},"modified":"2020-01-13T12:08:11","modified_gmt":"2020-01-13T12:08:11","slug":"wind-energy-in-kenya-not-blowing-us-away","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-industry-news\/wind-energy-in-kenya-not-blowing-us-away\/","title":{"rendered":"Wind Energy in Kenya – Not blowing us away?"},"content":{"rendered":"<p>It goes without saying that the Turkana wind power project will do a lot of good for the Kenyan power situation. With the power to add 310 megawatts to the national grid, this project will account for 13% of Kenya’s power supply.<\/p>\n<p>Plagued by a variety of setbacks, it is not surprising that this project failed to meet its June 2017 deadline. However, despite issues such as pulling out of funding by the now bankrupt Italian contractor Isolux Ingenieria, this wind farm project is nearly complete.<\/p>\n<p>Power is already being produced on the wind farm awaiting transmission to the national grid. The only setback to transmission is the incomplete Loiyangalani-Suswa power line that is worth a total of 150 million dollars.<\/p>\n<p>Fortunately for Kenyans everywhere, two Chinese companies, Power China Guizhou and NARI Group Corporation have taken over the completion of the 428-kilometer 400 kV power line. They are expected to complete it by August, failure to which Kenyans will be at risk of paying extra penalties.<\/p>\n<p>The lack of power evacuation from the wind farm will cost both the wind farm managers and ordinary Kenyans a tidy sum of money. However, the completion of this project will be a major boost to Kenya’s energy sector.<\/p>\n<p>In a country that majorly depends on hydroelectricity, wind power is highly welcomed. Not only is it more reliable than its rain-dependent counterpart but it is also considerably cheaper. According to the <a href=\"http:\/\/ledsgp.org\/?loclang=en_gb\">Low Emission Development Strategies Global Partnership (LED GP)<\/a>, the Turkana Wind Power Project will also considerably reduce the annual amount of greenhouse gas emissions and create over two thousand job opportunities.<\/p>\n<p>Currently, the only wind farm that is connected to the national grid is the Ngong’ power station which produces 25 MW of power. Other noticeable wind power projects include the Marsabit and Habasweni mini-grids.<\/p>\n<p>While the United Nations Environment Programme (UNEP) estimates that Kenya has the potential to produce up to 3000 MW of wind energy, it is quite unfortunate that it has a limited number of wind farms. With most parts of the country experiencing wind average wind speeds of over 6m\/s, Kenya is ripe for wind farming.<\/p>\n<p><strong>Challenges to harnessing wind power in Kenya<\/strong><\/p>\n<p>Although Kenya holds great potential for wind power production, this sector faces some serious challenges. These include:<\/p>\n<ol>\n<li>Political interference &#8211; there are several wind energy projects have been stalled due to protests that are fueled by political reasons. In fact, there are allegations of politicians inciting such protests.<\/li>\n<li>Opposition from local communities who have the unfounded fear losing their land without timely compensation<\/li>\n<li>Lack of funding &#8211; sometimes investors go bankrupt before a project is complete. This forces the government to stop construction until new investors can be found, a process that is far from easy.<\/li>\n<\/ol>\n<p><strong>Government legislation<\/strong><\/p>\n<p>In order to promote wind energy expansion, the government of Kenya has put in place several pieces of legislation. Current legislation aims to:<\/p>\n<ol>\n<li>Ensure the undertaking of Research Development and Dissemination<\/li>\n<li>Invest in transmission lines to enable efficient injection of electricity to the national grid<\/li>\n<li>Ensure regular updating of the wind atlas<\/li>\n<li>Promote frequent collection of wind energy data<\/li>\n<\/ol>\n<p>Although Kenya has not fully exploited its wind energy potential, it has made significant strides towards it. In fact, Kenya is one of the few African countries that have made the most progress in wind energy expansion. This can be attributed to it being home to a variety of wind power projects including Africa’s largest wind farm, the Turkana Wind Power Project.<\/p>\n<p>Such projects go a long way to contributing towards attaining Kenya’s Vision 2030 of increasing the national electricity capacity. As countries across the world focus on clean and sustainable renewable energy, Kenya should be keen not to be left behind.<\/p>\n<p>By Eng. Nancy Akinyi.<\/p>\n<p><em>Nancy Akinyi is a graduate engineer, a writer and a budding entrepreneur whose interests lie in water and energy management. Find her on twitter @nakinyi.<\/em><\/p>\n<div class=\"energ-after-content\" id=\"energ-2629005027\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>It goes without saying that the Turkana wind power project will do a lot of good for the Kenyan power situation. With the power to add 310 megawatts to the national grid, this project will account for 13% of Kenya’s power supply. Plagued by a variety of setbacks, it is not surprising that this project [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1085,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,24],"tags":[148,145,146,143,144,147],"class_list":["post-1084","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-energy-industry-news","tag-kenya-wind-power","tag-lake-turkana-wind-energy","tag-turkana-wind-power-project","tag-wind","tag-wind-energy","tag-wind-power-project"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1084","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1084"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1084\/revisions"}],"predecessor-version":[{"id":1086,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1084\/revisions\/1086"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1085"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1084"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1084"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1084"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}