{"id":1104,"date":"2019-04-07T14:42:32","date_gmt":"2019-04-07T14:42:32","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1104"},"modified":"2020-01-13T12:21:48","modified_gmt":"2020-01-13T12:21:48","slug":"compressed-air-supply-installation-the-unseen-cost-of-installation-mistakes","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/tools\/compressed-air-supply-installation-the-unseen-cost-of-installation-mistakes\/","title":{"rendered":"Compressed Air Supply Installation"},"content":{"rendered":"\n<h4 class=\"wp-block-heading\">The Unseen Cost of Installation Mistakes<\/h4>\n\n\n<p>So, you have successfully selected a compressor and it has been delivered to your site. Now comes the easy part, connecting it to your application. Right? Not necessarily…<\/p>\n<p>How your compressor is installed has a direct bearing on whether it will properly serve the most critical aspects of your compressed air application, which are the air quality, pressure and flow.<\/p>\n<p>Extreme temperatures, moisture and dust and other airborne contaminants will affect the performance and durability of your compressor. Generally, compressors are installed indoors to mitigate these negative environmental effects.<\/p>\n<p>On a recent site visit we found a compressor installed in very hot room with all the compressor panels removed in order to &#8216;cool&#8217; the compressor. This was not working because the compressor inlet was taking in the compressor’s own hot exhaust air!<\/p>\n<p>For small compressors louvered walls may provide sufficient cooling. However, for larger compressors, hot exhaust air may need to be ducted out. High particle contamination at the compressor intake also poses a major concern.<\/p>\n<p>On another visit to a cement manufacturing plant, what was revealed was that the compressor elements (screws) frequently failed due to intake of cement dust. Here secondary filtration for the air intake may be a solution.<\/p>\n<p>Which brings us to the subject of air quality. Compressed air application, will guide you to the appropriate air quality. For example at a workshop dry compressed air (with lubrication at the usage point) is required, to ensure the pneumatic tools are not damaged by excessive moisture.<\/p>\n<p>To dry air, an air dryer or after-cooler is recommended, depending on the type of compressor. To remove particles which may cause damage or contamination from the compressed air, filters may be installed before and after the dryer. In addition, a suitably sized air receiver is recommended. It acts as a buffer between the compressor and the air demand areas, and also helps remove moisture from the compressed air once it leaves the compressor.<br \/>Some of the most troubling areas in many installations revolve around the proper sizing of compressed air piping, piping network design and installation.<\/p>\n<p>On yet another visit to a plant, we found that the client was using a 1\/2&#8243; pipe as the main header, piping air from a 7Kw (Flow rate 20 liters per second) compressor over 150 meters. The pipe was sorely undersized leading to a very large pressure drop.<\/p>\n<p>Essentially the customer was spending money to compress air, then losing this pressure through pressure drop in the pipe. One of the main drivers in installing smaller pipes is simply that they are cheaper.<\/p>\n<p>However any savings made initially by buying cheaper materials are lost many times over in the form of energy losses. In many installations we have also found numerous unnecessary bends and leaks further worsening the pressure losses.<\/p>\n<p>Leaks tend to range between 20 to 50% of compressed air produced in different industries. What’s happening is that you are basically pumping money into the air!!!<\/p>\n<p>This begs the question: Do you involve the original equipment manufacturer or compressor specialists in the design and installation of your compressed air system?<\/p>\n<p>Many glaring errors that plague industrial compressed air systems can easily be identified and resolved during the design and installation phase. Critically, most general mechanical, electrical and plumbing contractors are not compressed air experts. For trouble-free installation and operation of your compressed air system always consult a specialist. It will save you unnecessary loss.<\/p>\n<p><strong>Eng. Mathew Waita Mwenga<\/strong><br \/>Managing Director,<br \/>Ren Engineering Solutions<br \/>T +254 715 833 628<br \/>E info@ren-engineering-solutions.com<br \/><a href=\"http:\/\/www.ren-engineering-solutions.com\/\">http:\/\/www.ren-engineering-solutions.com\/<\/a><\/p><div class=\"energ-after-content\" id=\"energ-4183547520\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>The Unseen Cost of Installation Mistakes So, you have successfully selected a compressor and it has been delivered to your site. Now comes the easy part, connecting it to your application. Right? Not necessarily… How your compressor is installed has a direct bearing on whether it will properly serve the most critical aspects of your [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1105,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,204,199],"tags":[133,155,156,157],"class_list":["post-1104","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-how-to","category-tools","tag-compressed-air","tag-compressed-air-supply-installation","tag-how-to-install-your-compressor","tag-ren-engineering-solutions"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1104","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1104"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1104\/revisions"}],"predecessor-version":[{"id":1345,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1104\/revisions\/1345"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1105"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1104"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1104"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1104"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}