{"id":1116,"date":"2018-05-20T09:44:42","date_gmt":"2018-05-20T09:44:42","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1116"},"modified":"2020-01-13T12:39:47","modified_gmt":"2020-01-13T12:39:47","slug":"three-reasons-why-you-must-be-part-of-the-world-energy-day-celebrations-2018","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/events\/three-reasons-why-you-must-be-part-of-the-world-energy-day-celebrations-2018\/","title":{"rendered":"Three Reasons Why You MUST be Part of the World Energy Day Celebrations 2018!"},"content":{"rendered":"\n<p>By Carolyne Gathuru <\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Energy Runs the World – True or False?<\/strong><\/h4>\n\n\n\n<p>If you answered <strong>True<\/strong> – you are correct. Without Energy in whatever form or shape then the world wouldn’t work; not by day, nor by night!<br>If you answered <strong>False<\/strong> – you are still correct. Energy doesn’t run the world – it propels it, moves it, controls it, and governs the way the world works!<\/p>\n\n\n\n<p>So now that it is clear that without energy the world is defunct, it is of critical importance that the three reasons why it is important to participate in the World Energy Day Celebrations 2018 are unpacked.<br>The World Energy Day (WED) is observed annually on October 22nd to raise awareness of global energy-related issues and celebrated internationally to raise awareness of the need to rally around the creation and implementation of policies that increase energy efficiency and conserve natural resources. This year in Kenya, WED Celebrations will run from Monday 22nd October to Sunday 27th October 2018.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">So here are the 3 important reasons unveiled………….<\/h4>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" width=\"1109\" height=\"937\" data-src=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2018\/08\/New-Microsoft-Publisher-Document.jpg\" alt=\"\" class=\"wp-image-1117 lazyload\" data-srcset=\"https:\/\/energyzedworld.com\/wp-content\/uploads\/2018\/08\/New-Microsoft-Publisher-Document.jpg 1109w, https:\/\/energyzedworld.com\/wp-content\/uploads\/2018\/08\/New-Microsoft-Publisher-Document-300x253.jpg 300w, https:\/\/energyzedworld.com\/wp-content\/uploads\/2018\/08\/New-Microsoft-Publisher-Document-768x649.jpg 768w, https:\/\/energyzedworld.com\/wp-content\/uploads\/2018\/08\/New-Microsoft-Publisher-Document-1024x865.jpg 1024w\" data-sizes=\"(max-width: 1109px) 100vw, 1109px\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 1109px; --smush-placeholder-aspect-ratio: 1109\/937;\" \/><\/figure>\n\n\n\n<h4 class=\"wp-block-heading\">1. <strong>Stand Up To Be Counted – And Win The WED Trophy!<\/strong><\/h4>\n\n\n\n<p>Every single organization and the team members therein, need to stand up and be counted towards making a difference in this world though energy conservation. The greatest legacy one can live and leave, is to leave the world a better place than one found it, for the coming generations. WED provides the opportunity to practically demonstrate social responsibility. To participate as an organization involves creating a plan with ideas of how to conserve energy both at work and at home. These ideas may then be implemented during World Energy Day Celebrations period. There is no limit to what could be done and some ideas may include:<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li>Sending out energy conservation messages to different stakeholders<\/li><li>Posting energy conservation messages on different digital platforms<\/li><li>Wishing customers and staff a Happy World Energy Day week<\/li><li>Putting up Happy World Energy Day messages in the office<\/li><li>Educating customers and staff on energy saving and environmental protection matters<\/li><li>Undertaking charitable CSR activities in the community<\/li><li>Brainstorming on how to conserve energy in the organization<\/li><\/ul>\n\n\n\n<p>Get creative about how to raise awareness of energy conservation. The more creative the better! WED activities will be recognized and published by <a href=\"http:\/\/www.aepea.co.ke\/aepea\/\">AEPEA<\/a> and <a href=\"http:\/\/eenovators.com\/\">Eenovators<\/a> that are coordinating the local celebrations. Register your organization <a href=\"http:\/\/wed.eenovators.com\/\">here<\/a> and the organization with the most engaging and impactful activities reported will walk away with the WED Trophy 2018!<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong> 2. Stand Up To Be Counted – <a href=\"http:\/\/wed.eenovators.com\/index.php\/wed-conference\/\">Register<\/a> For The WED Conference 2018!<\/strong><\/h4>\n\n\n\n<p>The 2018 WED celebrations will culminate in a 2 day Energy Conference on 26th -27th October 2018 themed <strong>“The Future of Energy in Africa – The Sustainability Agenda”.<\/strong> Leaders in the energy sector around Africa, both in the public and private sector, as well as energy enthusiasts across different industries, will gather to discuss the energy agenda. Key note speakers from Africa currently leading energy innovation, entrepreneurship, capacity building, regulation, and green energy initiatives will share their experiences. This conference promises to revolutionize the way energy matters are handled in the region and will cover Energy policy, Energy financing, Bridging the Energy Gender divide, Energy Innovation, Sustaining Energy Projects, Energy Monitoring and Taking Charge of Energy Change. Register to attend the conference <a href=\"http:\/\/wed.eenovators.com\/index.php\/wed-conference\/\">here<\/a> and do not be left behind as ground breaking resolutions for energy change are crafted at WED Conference 2018!<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>3. Stand Up To Be Counted – Engage With The #Energychallenge2018!<\/strong><\/h4>\n\n\n\n<p>Contrary to popular belief – the youth are plugged in toward energy innovation and are actively participating in energy conservation matters. The Student Energy Innovation Challenge is on, and participants are in high gear towards the development of innovative energy conservation concepts to provide sustainable solutions. The challenge brings together young people from the region, currently in various institutions including universities and technical institutions, as they submit their innovative energy solutions. Viable ideas that make it to the shortlist will be exhibited during the WED Conference 2018. Their energy projects will be showcased either as models, computer simulations or actual designs and will be scrutinized by an eminent panel of judges with business acumen, innovation prowess and energy expertise. The top three projects will walk away with prizes that include internships, incubation, and commercialization of ideas, shopping vouchers, holiday experiences and cash prizes. Support young people <a href=\"http:\/\/wed.eenovators.com\/index.php\/sponsorship\/\">here<\/a> as they immerse themselves in energy sustainability by cheering them on, providing in kind support, opportunities for training, mentoring and business coaching, as well as financial resources towards the WED Student Challenge Success!<\/p>\n\n\n\n<p>Participating in the WED Celebrations 2018 will set apart those who give lip service to giving back to society from those who will stand up to take the bold step to demonstrate true value. The world is waiting for us to localizing Sustainable Development Goal (SDG7) towards collaboration to ensure access to affordable, reliable, sustainable, and modern energy for all. Delivering on this objective is not rocket science. All it takes is for you and me to stand up and be counted as a WED Champion today!<\/p>\n\n\n\n<p>Send your registration request to <a href=\"mailto:info@eenovators.com\">info@eenovators.com<\/a><\/p>\n<div class=\"energ-after-content\" id=\"energ-1367862580\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Carolyne Gathuru Energy Runs the World – True or False? If you answered True – you are correct. Without Energy in whatever form or shape then the world wouldn’t work; not by day, nor by night!If you answered False – you are still correct. Energy doesn’t run the world – it propels it, moves [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1118,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[201],"tags":[150,159,161,103,160],"class_list":["post-1116","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-events","tag-wed","tag-wed-2018","tag-wed-celebrations","tag-world-energy-day","tag-world-energy-day-2018"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1116","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1116"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1116\/revisions"}],"predecessor-version":[{"id":1457,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1116\/revisions\/1457"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1118"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1116"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1116"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1116"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}