{"id":1147,"date":"2019-01-25T13:45:34","date_gmt":"2019-01-25T13:45:34","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1147"},"modified":"2020-01-13T12:35:51","modified_gmt":"2020-01-13T12:35:51","slug":"5-essentials-non-technical-skills-for-energy-professionals-to-learn-in-2019","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/5-essentials-non-technical-skills-for-energy-professionals-to-learn-in-2019\/","title":{"rendered":"5 key Non-technical Skills for Energy Professionals"},"content":{"rendered":"\n<p><strong>By Linet Njeri<\/strong><\/p>\n\n\n\n<p>Learning is the single best investment we can make in our lifetime. The world’s busiest and most wealthy individuals including Warren Buffet, Bill Gates and Barrack Obama have identified continuous learning as an important part of life and dedicate 5 hours a week to learning. It is therefore important for anyone at any age to ensure that they are constantly learning a new skill. <\/p>\n\n\n\n<p>Energy professionals must not be left behind in the pursuit of learning, and must put deliberate effort into acquiring new skills so as to advance their careers.<\/p>\n\n\n\n<p>While technical skills are essential for professionals across different spectrums, it is the non-technical skills often referred to as ‘soft skills’ that allow individuals to stand out and prime themselves for promotions or growth in business. <\/p>\n\n\n\n<p>In this age of technology, learning non-technical skills has been made easier due to the presence of online resources that are accessible for free or at a minimal cost. There are many skills that energy professionals can therefore acquire but the following skills will be most needed in 2019.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Project Management <\/strong><\/h4>\n\n\n\n<p>Energy professionals, be they in formal employment or working as consultants, are constantly working within projects or managing projects. There is therefore need to have the knowledge on how to manage projects effectively in a way that optimizes the resources used while producing quality results. <\/p>\n\n\n\n<p>This skill will be essential in 2019 as the energy industry in Kenya moves towards creation and implementation of projects, both in government and organizations, which will tap into renewable energy use as well as reduce energy usage and costs. <\/p>\n\n\n\n<p>Project management can be learnt online through <a href=\"https:\/\/store.entrepreneur.com\/sales\/the-capm-certification-training-bundle?utm_source=entrepreneur.com&amp;utm_medium=referral&amp;utm_campaign=the-capm-certification-training-bundle&amp;utm_term=scsf-308916&amp;utm_content=a0x1P000004SuBA&amp;scsonar=1&amp;_ga=2.124445518.592975318.1548163655-1381708560.1548163655\">The Project Management (CAPM®) Certification Training Bundle<\/a> for just $19. This course introduces one to project management concepts and the different tools that can be useful in project management.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Public Speaking<\/strong><\/h4>\n\n\n\n<p>Any professional that is in leadership or aspires to be, must be able to speak confidently in public, in a way that has an impact on the audience. Whether speaking in meetings, making presentations or addressing teams, energy professionals must be able to speak powerfully to grow in their careers. <\/p>\n\n\n\n<p>Although one can learn how to speak in public by reading books or watching videos, the most effective way to learn public speaking is through practise. One must therefore be able to find a safe space to practise their public speaking without fear of judgement. <\/p>\n\n\n\n<p>One such safe space is a public speaking club known as <a href=\"https:\/\/www.toastmasters.org\/\">Toastmasters International<\/a>. Toastmasters is available in many countries around the world including Kenya and a quick search through their website would link you to a club near you. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Social Media Skills<\/strong><\/h4>\n\n\n\n<p>It is estimated that there will be 2.7 billion social media users in the world in 2019. Social media has opened up communication in a way that has never been seen before allowing users to communicate beyond geographical and social boundaries. <\/p>\n\n\n\n<p>Apart from communication, social media is also a useful tool for growing people individually. It allows professionals to open themselves up for opportunities that are beyond their personal networks. Energy professionals should also tap into the potential of social media to catapult their careers. <\/p>\n\n\n\n<p>Some of the networks that are highly useful for professionals include LinkedIn, Facebook and Twitter. LinkedIn provides an avenue to put out one’s CV and profile to a wide audience and tap into opportunities across the globe. Facebook and Twitter allow one to connect with other professionals and to hold useful discussions that can position someone as an expert in their field. <\/p>\n\n\n\n<p>It is therefore essential for energy professionals to join social media networks and learn how to effectively optimize them for career advancement. Here is a <a href=\"https:\/\/www.forbes.com\/video\/4447449812001\/#9a6b56a3ced1\">video<\/a> with tips on how to optimize social media for career growth.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Writing<\/strong><\/h4>\n\n\n\n<p>For centuries, writing has been one of the most important skills as it allows the communication of ideas from one person to the other. It has however, in the past been relegated to professional writers or those in the communication field. <\/p>\n\n\n\n<p>But with the internet opening up the knowledge economy, more technical professionals are getting into writing to educate others in their field and share the knowledge they have acquired over time. <\/p>\n\n\n\n<p>Writing is a skill that enables one to stand out and be seen as an expert in their area. Nonetheless, learning how to write is not as easy as it seems, but like many other skills, it is best learnt by doing. <\/p>\n\n\n\n<p>According to Danny Forest, a programmer that has catapulted his career through writing, the trick for learning how to write is to write publicly. He says that one learns to write better when people can actually see their work as it forces them to dig deeper by getting feedback and have accountability. <\/p>\n\n\n\n<p>There are several avenues for writing publicly including writing LinkedIn articles, creating a blog and publishing regularly, writing on medium.com or contributing to local newspapers and magazines. Through these avenues, energy professionals can share their knowledge and position themselves as experts in their industry. Here are some <a href=\"https:\/\/www.dannyforest.com\/writing-tips\/\">writing tips<\/a> from Danny Forest.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Programming<\/strong><\/h4>\n\n\n\n<p>Programming has gained popularity over recent years, opening it up to even people who are not in the IT profession. Programming allows one to create things from scratch and is used for both software and hardware. But why would an energy professional need programming skills? <\/p>\n\n\n\n<p>The energy space is dynamically morphing with more energy users looking for ways to minimize the energy costs in a simple way. Technology on the other hand, provides a way to monitor energy usage from devices such as phones and computers. <\/p>\n\n\n\n<p>In Kenya, there is a huge need for applications that enable easier energy monitoring that are customized to the local circumstances. To create such applications requires the knowledge of both programming and the technical knowledge of energy parameters. <\/p>\n\n\n\n<p>There truly has never been a better time for anyone to learn programming as now. There are numerous online resources accessible for free. <a href=\"https:\/\/learntocodewith.me\/posts\/code-for-free\/\">See this article <\/a>for more details on how to access such resources.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              <\/p>\n\n\n\n<p>Albert Einstein once said that if you stop learning, you start dying. Learning allows one to get out of their comfort zone and experience greater growth. This year, energy professionals have an opportunity to expand their skillsets by learning these 5 important non-technical skills to advance their careers.<\/p>\n\n\n\n<p><strong>Writer’s Bio<\/strong><br>Linet is a strategy and communication expert and works at Eenovators as the Strategy Coordinator. You can connect with her on LinkedIn<a href=\"https:\/\/www.linkedin.com\/in\/linet-njeri-5278318b\/\"> here<\/a>.<\/p>\n<div class=\"energ-after-content\" id=\"energ-464523839\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Linet Njeri Learning is the single best investment we can make in our lifetime. The world’s busiest and most wealthy individuals including Warren Buffet, Bill Gates and Barrack Obama have identified continuous learning as an important part of life and dedicate 5 hours a week to learning. It is therefore important for anyone at [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1149,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[166,164,165],"class_list":["post-1147","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","tag-essential-skills-to-learn-in-2019","tag-non-technical-skills-for-energy-professionals","tag-skills-for-energy-professionals"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1147","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1147"}],"version-history":[{"count":4,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1147\/revisions"}],"predecessor-version":[{"id":1439,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1147\/revisions\/1439"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1149"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1147"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1147"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1147"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}