{"id":1182,"date":"2019-03-05T05:35:19","date_gmt":"2019-03-05T05:35:19","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1182"},"modified":"2020-01-14T11:54:09","modified_gmt":"2020-01-14T11:54:09","slug":"cx-excellence-for-energy-professionals","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-industry-news\/cx-excellence-for-energy-professionals\/","title":{"rendered":"CX Excellence for Energy Professionals"},"content":{"rendered":"\n<p>By Carolyne Gathuru  <\/p>\n\n\n\n<p>Customer experience excellence is generally considered the preserve of those in the service industry and thought to be constricted to those that have high interaction with customers in spaces of service delivery. <\/p>\n\n\n\n<p>What is not known, and needs to be amplified on loud speaker, is that customer experience touches on all interactions with customers irrespective of the industry or nature of customers. With this in mind it is therefore of importance for energy professionals to shift away from their ‘technical side’ and get in touch with their ‘people side’. <\/p>\n\n\n\n<p>Energy practitioners need to provide customer experience excellence that will not only build great relationships with those in the energy space, but also with customers and other stakeholders without whom the vision for implementing energy change worldwide, delivery of the sustainable development goal 7 on ensuring access to affordable, reliable and modern energy for all, and the efforts to place energy as the central focus for global transformation will not be realized.<\/p>\n\n\n\n<p>What therefore do energy professionals need to do to improve their customer service skills and deliver customer experience excellence, towards enhancing the overall energy outlook at a national, regional and global level? <\/p>\n\n\n\n<p>Generally speaking there is a higher population of energy professionals that are gentlemen than there are ladies, and it is said that women are better at ‘soft skills’ than their counterparts. This myth needs to be debunked from the onset, and a confirmation made the customer experience excellence for energy professionals applies across board and needs to be embraced by all.<\/p>\n\n\n\n<p>Energy professional are ‘techies’ and techies are said to think differently and have a different perspective of things than others. With this in mind, where energy professionals are concerned, it requires a tricky balance between being a technical person able to audit, diagnose, and propose energy solutions, and understanding the client’s needs towards communicating effectively. <\/p>\n\n\n\n<p>Is it therefore possible to be an energy techie and a people person at the same time? Is this an exception rather than the norm? Are ‘people’ people best left in their lane to deal with people, and ‘energy’ people who are generally technical best left to do their energy work? Can energy professionals work in isolation with no interactions with the customers and stakeholders for whom they are deploying their energy solutions?<\/p>\n\n\n\n<p>This is hardly likely and energy professionals therefore need to: <\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Embrace Clear Energy Communication:<\/strong><\/h4>\n\n\n\n<p><br> Given that ‘energy speak’ is largely technical, it is important for energy professionals to walk in their customers shoes and take the time to explain in lay terms to both users and other stakeholders, what the nature and workings of the energy solutions they are implementing are, and the benefits that stand to be gained. An overview of the energy audits, projects, consulting assignments, training, and other related energy solutions is best prepared with a lay audience in mind, and discussed in a way that provides clarity without creating the barrier of tech to non tech language. Whether making presentations on the state of the organization’s energy use and proposed energy conservation measures to staff teams, or discussing energy cost savings with management, the energy professional needs to demystify energy language, eliminate energy jargon, and ensure that the energy communication delivered is clear and to the point. This will serve to endear the energy conversation to the intended audience – the customer.<br><\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Get Feedback on Energy Initiatives:<\/strong><\/h4>\n\n\n\n<p>Energy professionals need to be proactive in getting customer feedback. There is need to strike a balance between dispensing energy duties and providing for customer needs. Energy work is generally Business to Business and hardly ever Business to Direct Customer on a retail level, and the interactions are mostly with organizations’ internal customers. All contact persons need to be viewed as customers and the energy professional’s attitude needs to shift to one of service provision. Feedback needs to be sourced, not only on the viability and efficiency of the energy solutions proposed and provided, but also on the nature of interactions including communication, customer awareness, response time, and ability to resolve matters arising.<\/p>\n\n\n\n<p>Energy practitioners need to literally put themselves in their customers’ shoes and plug in their energy solutions into the bigger picture that the organization they are working with or partnering with is working towards. Energy practitioners that are in-house and employed in various organisations need to handle other departments as internal customers and harmonize the objectives of their roles with the organization’s bigger vision. Once the bigger picture is in place and feedback is proactively sought, then the customer experience for both the internal and external customer will be amiable and add to overall productivity. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong> Provide Energy Education<\/strong><\/h4>\n\n\n\n<p>Another initiative that energy practitioners would need to embrace, that would enhance customer experience and add value, would be to provide customers and other stakeholders, key energy education. This will provide an avenue to enlighten and inform various stakeholders, increase their energy knowledge, and improve their energy interactions. A simple way to do this would be to document frequently asked energy questions &#8211; be they specific to the energy project, service or training being implemented or general for knowledge purposes &#8211; with clear and simple responses that would serve to enhance awareness.  <\/p>\n\n\n\n<p>Energy professionals need to be very proactive in sourcing for queries that customers and stakeholders have and seek to clarify these to have better understanding and ultimately better relationships. This results in a twofold benefit in that it will ease the work of the energy professional when there is a bigger base of energy aware stakeholders, as well as to empower the target audience be they internal or external with important energy knowledge, because as the CEO of Syms rightly quotes “An Educated Customer is the Best Customer”<\/p>\n\n\n\n<p>The World Economic Forum report on the three skill sets required to survive in the professional workplace by 2030 include higher cognitive skills( critical thinking, statistical, writing ), social and emotional skills( communication, negotiation, empathy)  and Technological(basic to advanced IT skills, data analysis, engineering and research). All these skills are important towards delivering customer experience excellence and energy professionals need to join the queue towards customer experience excellence training. There is need to skill up in a bid to join the collective effort towards enabling the desired energy change happen globally. Can a balance can be created between the need to focus on energy work and to have excellent customer service skills towards win-win outcomes for energy practitioners? Most definitely yes! The onus is on energy practitioners to deliver greatness.<\/p>\n\n\n\n<p><\/p>\n<div class=\"energ-after-content\" id=\"energ-3095399894\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Carolyne Gathuru Customer experience excellence is generally considered the preserve of those in the service industry and thought to be constricted to those that have high interaction with customers in spaces of service delivery. What is not known, and needs to be amplified on loud speaker, is that customer experience touches on all interactions [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1183,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[201,24],"tags":[173,174,172,171],"class_list":["post-1182","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-events","category-energy-industry-news","tag-customer-experience","tag-customer-service-in-energy","tag-energy-practitioners","tag-energy-professionals"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1182","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1182"}],"version-history":[{"count":4,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1182\/revisions"}],"predecessor-version":[{"id":1403,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1182\/revisions\/1403"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1183"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1182"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1182"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1182"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}