{"id":1188,"date":"2019-03-18T13:54:28","date_gmt":"2019-03-18T13:54:28","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1188"},"modified":"2020-01-13T12:25:16","modified_gmt":"2020-01-13T12:25:16","slug":"achieving-savings-through-cloud-based-measurement-verification","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/achieving-savings-through-cloud-based-measurement-verification\/","title":{"rendered":"How To Achieve Savings Through Cloud"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">Based Measurement &amp; Verification<\/h2>\n\n\n\n<p>By Paul Muhia  <\/p>\n\n\n\n<p>So, you have done your first energy audit, an impressive energy audit report has been shared with you highlighting the sweet money savings that you will be making, with some projects promising short payback period of less than a year…<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Do you take it or leave it? <\/strong><\/h4>\n\n\n\n<p>Well, with optimism you decide to give it a try because not only do you want to reduce your energy spending, but EPRA the Energy &amp; Petroleum Regulatory Authority might be on your neck if you do not implement at least 50 % of the agreed Energy Management Investment Plan. <\/p>\n\n\n\n<p>In no time you have invited tender proposals for one of the recommendations &#8211; LED lighting retrofitting and your procurement department is flooded with many quotes each justifying why you should pick them. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Hold On.. How Do You Get Started Towards Make These Promised Savings?<\/strong><\/h4>\n\n\n\n<p>From an established<strong> ESCO<\/strong> Energy Service Company perspective, the project needs to be approached from proven processes and workflows, that have been tested and have worked internationally. This is where standards such as<strong> IPMVP <\/strong>International Performance Measurement and Verification Protocol which defines standard terms, suggests best practice for quantifying the results of energy efficiency investments, increased investment in energy and water efficiency, demand management and renewable energy projects exists. <\/p>\n\n\n\n<p>IPMVP was introduced as a guideline methodology by which the energy savings achieved from energy efficiency projects could be measured and verified in a consistent and reliable manner.<\/p>\n\n\n\n<p>There are various methods\/options used to measure the savings as best described below: <\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>IPMVP OPTION A<\/strong><\/h4>\n\n\n\n<p><br>Retrofit Isolation (Key Parameter Measurement) – Savings are quantified by field measurement of only the key performance parameter(s) which define the energy use of the systems affected by the ECM retrofit. Parameters not selected for measurement are estimated through the use of historical data and engineer recommendations.  Adjustments can be routine or non-routine.<\/p>\n\n\n\n<p>Example application: Lighting retrofits where the key performance parameter is the power draw, and hours of use is estimated through facility schedules and occupant’s behaviors.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>IPMVP OPTION B<\/strong><\/h4>\n\n\n\n<p><br> Retrofit Isolation (All Parameter Measurement) – Savings are quantified by field measurement of the actual energy use of the systems affected by the ECM retrofit. The frequency of measurement ranges from short-term to continuous, depending on what variations are expected throughout the reporting period.  Adjustments can be routine or non-routine.<\/p>\n\n\n\n<p>Example application: Variable-speed drive and controls added to a motor to monitor pump flow. A kW smart meter installed on the motor to measure electric power every minute.  Meter stays in place over the length of the entire reporting period to signal any variations in power use.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>IPMVP OPTION C<\/strong><\/h4>\n\n\n\n<p><br>Whole Facility – Savings are quantified by measuring energy use at the whole facility or sub-facility over a given reporting period. Measurements are recorded continuously throughout the length of the reporting period.  Adjustments can be routine or non-routine.<\/p>\n\n\n\n<p>Example application: Energy management program affecting many different systems in the facility. Energy use is measured with the utility meters over a twelve-month baseline period and throughout the reporting period.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>IPMVP OPTION D<\/strong><\/h4>\n\n\n\n<p><br>Calibrated Simulation – Savings are determined through a simulation of the energy use of the whole facility or sub-facility. The simulation aims to demonstrate and model actual projected energy performance.<\/p>\n\n\n\n<p>Example application: An energy management program will affect many different systems in the whole facility, but there have been no meters installed in the baseline period.<\/p>\n\n\n\n<p>The traditional way of applying these standards is to get an external measurement and verification expert to come and take measurements based on the method that best fits the project. For example, in the case of LED lighting retrofit project <strong>Option A<\/strong> would require the independent expert take measurement of the power being drawn, and make an estimate of the operation hours. Calculations of energy consumption and savings achieved based on previous baseline are then calculated on spreadsheet files. This is prone to erroneous information about the actual energy consumption and savings achieved. What if for no particular reason the number of lights in operation were taken incorrectly, the time of operations will not correctly reflect the reality. The final implementation report might be misleading and there is no transparency in how these savings were achieved.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>The Solution<\/strong><\/h4>\n\n\n\n<p>Innovation being a driving force has inspired an automated portal using state of the art technology to help track energy saving from implementing energy efficiency projects. This Measurement &amp; Verification platform guarantees transparency and real-time information on energy savings. There is no longer the  need to wait before seeing the impact of energy investments.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Does this sound like a solution that can fit your current or upcoming energy investment projects?<\/strong><\/h4>\n\n\n\n<p>If yes  &#8211; Eenovators will be quite excited to have a demo meeting to walk through how to  achieve, monitor and verify energy savings.<br> Call today on<strong> +254 791839959<\/strong> or send  email to <strong><a href=\"info@eenovators.com\">info@eenovators.com<\/a><\/strong>  to help measure and verify energy savings from anywhere in the world using state an innovative, customized technological solution.<\/p>\n<div class=\"energ-after-content\" id=\"energ-1280179036\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Based Measurement &amp; Verification By Paul Muhia So, you have done your first energy audit, an impressive energy audit report has been shared with you highlighting the sweet money savings that you will be making, with some projects promising short payback period of less than a year… Do you take it or leave it? Well, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1189,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,204],"tags":[175,45,179,177,176],"class_list":["post-1188","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-how-to","tag-achieving-energy-savings","tag-energy-efficiency","tag-energy-management-program","tag-energy-savings","tag-what-next-after-an-energy-auditt"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1188","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1188"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1188\/revisions"}],"predecessor-version":[{"id":1383,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1188\/revisions\/1383"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1189"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1188"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1188"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1188"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}