{"id":1192,"date":"2019-03-28T08:59:59","date_gmt":"2019-03-28T08:59:59","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1192"},"modified":"2020-01-14T11:53:25","modified_gmt":"2020-01-14T11:53:25","slug":"molecules-of-life","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-industry-news\/molecules-of-life\/","title":{"rendered":"5 Tips On Why Water Conservation Is Important"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">Molecules of life<\/h2>\n\n\n\n<p><\/p>\n\n\n\n<p>By Karen Thuranira <\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Why is water conservation critical?<\/strong><\/h4>\n\n\n\n<p><br>Most of us have been raised in a typical African home probably in the rural areas. This is where we first learnt ‘The Value of Water.’  <\/p>\n\n\n\n<p>If you have walked several miles everyday to draw water from a river or a community well situated kilometers away, then I know water is <strong>sacred<\/strong> to you.<\/p>\n\n\n\n<p>Whatever different water experiences we’ve had, we can all agree on one thing; Water is life!<\/p>\n\n\n\n<p>A <a href=\"https:\/\/www.unicef.org\/kenya\/wes.html\">study<\/a> by The United Nations classifies Kenya as a chronically water scarce country on the basis of having one of the lowest natural water replenishment rates, at 647 metres cubed per capita per annum, which is far below the 1,000 metres cubed per capita per annum.  <\/p>\n\n\n\n<p><strong>A fact:<\/strong> 71% of the earth is covered in water. This makes some people wonder; Why should we conserve water?<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Below are a few important facts about water that may help us understand why we need to conserve:<\/h4>\n\n\n\n<ol class=\"wp-block-list\"><li>97% percent of all water on the earth is salt water, which is not suitable for drinking.<\/li><li>Only 3% of water on Earth is fresh water, and only 0.5% is available for drinking.<\/li><li>The remaining 2.5% is locked in ice caps, glaciers, the atmosphere, soil, or under the earth&#8217;s surface, or is too polluted for consumption.<\/li><\/ol>\n\n\n\n<p>Estimates of water supply in Kenya indicate that only about 56 per cent of the population has access to safe water.<\/p>\n\n\n\n<p>With a rapidly growing population and such a small percentage of all the water on earth fit for consumption, it only makes sense not only for Kenyans but the rest of the world as well, that we must preserve and conserve this precious resource. <\/p>\n\n\n\n<p> Water conservation means using our limited water supply wisely and caring for it properly. Since we all depend on water to sustain life, it is our collective responsibility to learn about water conservation and how we can help keep our sources pure and safe for generations to come. <\/p>\n\n\n\n<p> The available water supply is finite. Which means we do not have an endless amount of water. Water conservation is therefore <strong>Not <\/strong>a job that is reserved for scientists, hydrologists, foresters, wildlife managers, farmers, or any specific group of people. Instead, it is up to each and every one of us to conserve water.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong> Why should we conserve water?<\/strong><\/h3>\n\n\n\n<h4 class=\"wp-block-heading\">1.  <strong>Water reduces the effects of drought<\/strong> <\/h4>\n\n\n\n<p>While the need for fresh water sources is increasing due to population and industry growth, the supply we have stays constant. Even though water eventually returns to Earth through the water cycle, it&#8217;s doesn’t always return to the same spot, or in the same quantity and quality. By reducing the amount of water, we use, we can better protect against future droughts.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">2. <strong>Protects against rising costs and political conflict <\/strong><\/h4>\n\n\n\n<p>Failing to conserve water can eventually lead to lack of adequate water supply, which can have drastic consequences. These include rising costs, reduced food supplies, health hazards, and political conflict.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">3. <strong>Helps preserve the environment<\/strong><\/h4>\n\n\n\n<p>Water usage equals the energy required to process and deliver it to homes, businesses, farms, or communities. Conserving water therefore helps to reduce pollution and conserve energy.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">4. <strong>Is water critical for recreational purposes? <\/strong><\/h4>\n\n\n\n<p><em>Absolutely yes. <\/em>Remember when you needed that swim so badly?  Those swimming pools and spas cannot run without water.<br> We also use water to beautify our surroundings by watering lawns, trees, flowers, and vegetable gardens, as well as washing cars and filling public fountains. Failing to conserve water now can mean losing out on such uses later on. What a loss!<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">5.<strong>Water is used to build a safe and beautiful community<\/strong><\/h4>\n\n\n\n<p>Firefighters, hospitals, gas stations, street cleaners, health clubs, gyms, and restaurants all require large amounts of water to provide services to the community. Reducing our usage of water now means that these services can continue to be provided.<\/p>\n\n\n\n<p>Water conservation requires forethought and effort, but every little bit  helps. The little effort you put goes a long way. We can all make  little changes in our lifestyles to reduce on water usage. Remember;  Change starts with you.<\/p>\n\n\n\n<p> The trick is making water conservation a way of life and not just something we think about once in a while. <\/p>\n\n\n\n<p>A<em>re you passionate about water? Or do you enjoy talking about energy? Are you knowledgeable on everything gas or maybe it’s the environment, climate change or global warming? Whatever your passion may be, we would love to know. Join the Eenovators blogging family and contribute to making the world a better place through writing. Call 0791839959 or write to <a href=\"info@eenovators.com\">info@eenovators.com<\/a><\/em><\/p>\n\n\n\n<p><\/p>\n<div class=\"energ-after-content\" id=\"energ-3915955349\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Molecules of life By Karen Thuranira Why is water conservation critical? Most of us have been raised in a typical African home probably in the rural areas. This is where we first learnt ‘The Value of Water.’ If you have walked several miles everyday to draw water from a river or a community well situated [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1193,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[24],"tags":[],"class_list":["post-1192","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-energy-industry-news"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1192","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1192"}],"version-history":[{"count":6,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1192\/revisions"}],"predecessor-version":[{"id":1369,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1192\/revisions\/1369"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1193"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1192"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1192"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1192"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}