{"id":1199,"date":"2018-04-24T10:12:19","date_gmt":"2018-04-24T10:12:19","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1199"},"modified":"2020-01-13T12:40:48","modified_gmt":"2020-01-13T12:40:48","slug":"energy-saving-tips-in-the-kitchen","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/energy-saving-tips-in-the-kitchen\/","title":{"rendered":"Energy Saving Tips In The Kitchen"},"content":{"rendered":"\n<p>By Monica Wanjiru<\/p>\n\n\n\n<p>It’s Easter holidays.  This is a time when Christians celebrate Jesus dying on the cross for the sins of mankind. It’s usually a pretty long holiday, whereby some people travel upcountry to be with their families and friends while others celebrate within their homes. <\/p>\n\n\n\n<p>I can’t wait to travel to shags to have that delicious mukimo that my grandma always prepares…the thought of this alone makes me salivate. Apart from celebrating the death and resurrection of Jesus, our kitchens are the busiest place filled with aromas of different kinds of savory dishes. <\/p>\n\n\n\n<p>If we aren’t careful, the kitchens alone can lead to great energy losses during this Easter period alone. With the prevailing hard economic conditions where each one of us is striving towards saving a coin, here are a few tips on how you can greatly save energy in your kitchen during Easter:<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong>Don’t leave appliances on standby<\/strong> <\/h4>\n\n\n\n<p><strong> <\/strong>Appliances such as microwaves among others should be turned off at the plug when not in use. Leaving them in standby mode consumes electricity which means your power bills will definitely go up. A microwave alone, uses 2 to 7 watts of power while in standby mode. This energy is used to display the clock and to wait for a user command. In a single year a microwave using 4 watts in 24\/7 standby mode will use 35 kWh<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong> Use the microwave<\/strong> <\/h4>\n\n\n\n<p>Cook food in the microwave whenever you can. When it comes to heating up small portions of food, microwaving is more energy efficient than the hob, and a lot more efficient than the oven. Just remember to turn it off at the plug when you’re finished. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong>Buy energy efficient appliances<\/strong> <\/h4>\n\n\n\n<p>Different kitchen appliances consume energy at different rates.  When buying a new appliance, take a look at its energy rating and look out for the Energy Saving Trust Recommended sticker. You have to consider the size as well. Buying appropriate size appliances will save you money too.  <\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong>Don’t overfill the kettle<\/strong> <\/h4>\n\n\n\n<p>This one is a huge energy waster — the energy wasted boiling an over-filled kettle in one week could power a TV for a whole day! It is thought that most people use double the amount of water they really need. Boiling more water than you need uses more electricity, only for the extra water too cool down and have to be boiled again later. Try using a cup to measure out exactly what you need, adding a little extra to allow for evaporation<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Clean the oven door<\/strong> <\/h4>\n\n\n\n<p>Every time you open the oven door; you are letting out precious hot air and wasting energy. If the oven door is clean and you can actually see through it, then you don’t need to keep opening it to check on your food. It’s a dirty job, but it’s worth doing<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Doing the dishes<\/strong><\/h4>\n\n\n\n<p>According to <a href=\"http:\/\/www.gizmag.com\/dishwashers-save-water-hand-washing\/11410\/\">some studies<\/a>, a modern dishwasher uses less water than washing your dishes by hand. If you do use a dishwasher, open up the door after the wash cycle and let the hot dishes air-dry. This will save a considerable amount of electricity.<\/p>\n\n\n\n<p><strong>Fix dripping taps <\/strong> <\/p>\n\n\n\n<p>It may not seem like a big deal, but a badly dripping tap can waste as much as one litre of water per hour — that’s enough to fill a bath in a week! And remember if it’s hot water you’re wasting energy as well. So, stop ignoring it and get it fixed<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Smart washing and drying<\/strong> <\/h4>\n\n\n\n<p>Your washing machine and tumble dryer are two of the most power-hungry appliances in the house. Make sure the washing machine is full before you switch it on, or use the half load setting if it has one. As for the dryer — do you really need to use it? <\/p>\n\n\n\n<p>Putting your clothes out on the line instead is a really simple way to save electricity, and your clothes will last longer too! You may be surprised to know that about 85-90% of the energy used by a washing goes into heating the water, so don’t put it on a hot wash unless you really need to. If your clothes aren’t particularly dirty then washing them at 30 degrees is just as effective as washing at a higher temperature. By switching from a hot wash to a warm wash, over a year you could cut your energy consumption in half<\/p>\n\n\n\n<p><strong>Be good to your fridge<\/strong> <\/p>\n\n\n\n<p>Putting hot food straight into the fridge is a big no-no! The fridge has to work extra hard and draw more energy to cool it down. Let hot food cool on the side first before it goes in. The same goes for the freezer. Avoid leaving the fridge or freezer door open for long periods, and defrost it when necessary. Finally, make sure there is at least a 10cm gap behind your fridge — this lets heat flow away more easily and saves electricity<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Be smart with your cooking <\/strong> <\/h4>\n\n\n\n<p>Making a few changes to the way you cook can save a lot of energy (and money!) For example, if you always cover pots and pans, they will boil much quicker — or even better, boil the water in the kettle first then pour it into the pan, as this uses less energy. Are you putting more water in the pan than you really need when you boil food? If so, it not only takes more time and energy to boil, but you’re wasting water as well<\/p>\n\n\n\n<p>Another good tip is to turn off the heat a couple of minutes before your food is cooked. This is especially true if you have an electric cooker — electric hobs take quite some time to cool down. You can turn off your electric oven about ten minutes before your food has finished cooking and it will still stay hot.<\/p>\n\n\n\n<p>If you’ve boiled water, can it be used for more than one purpose? For instance, if you are cooking pasta in a pan, put a colander on top and you have a make-shift steamer to cook your veg in!<\/p>\n\n\n\n<p>References <\/p>\n\n\n\n<p>https:\/\/newatlas.com\/dishwashers-save-water-hand-washing\/11410\/           http:\/\/gogreena.co.uk\/                                           <\/p>\n\n\n\n<p><\/p>\n<div class=\"energ-after-content\" id=\"energ-269427770\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Monica Wanjiru It’s Easter holidays. This is a time when Christians celebrate Jesus dying on the cross for the sins of mankind. It’s usually a pretty long holiday, whereby some people travel upcountry to be with their families and friends while others celebrate within their homes. I can’t wait to travel to shags to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1200,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[185,186,187,188],"class_list":["post-1199","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","tag-energy-saving","tag-energy-saving-tips","tag-energy-saving-tips-for-holiday-seasons","tag-kitchen-tips"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1199","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1199"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1199\/revisions"}],"predecessor-version":[{"id":1333,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1199\/revisions\/1333"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1200"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1199"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1199"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1199"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}