{"id":1202,"date":"2019-04-29T10:12:22","date_gmt":"2019-04-29T10:12:22","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1202"},"modified":"2020-01-13T12:17:19","modified_gmt":"2020-01-13T12:17:19","slug":"advise-to-my-40-year-old-self-after-1-year-in-energy-management","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/advise-to-my-40-year-old-self-after-1-year-in-energy-management\/","title":{"rendered":"5 and simple Advises to my 40-year-old self:"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">After 1 year in energy management<\/h2>\n\n\n\n<p>By Warren Ondanje<\/p>\n\n\n\n<p>I joined Eenovators back in March 2018 as an intern, after an adrenaline-pumped interview I thought I’d asked a little too many questions. Coming from a Chemical Engineering background, half the interview questions had me turning pale &#8211; you know chemical engineers and electrical stuff. Fortunately I was picked for the internship, and that’s when the journey started becoming a lot more interesting that anything I’ve ever called work.<\/p>\n\n\n\n<p> Long story short, I’ve grown to lead a team of 3-4 engineers in carrying out well over 20 energy audits in the last 1 year. I’ve shared my knowledge, but learned way more from my colleagues. I’ve coordinated the World Energy Day celebrations in 2018, attracting about 200 professionals to stir deliberations in the region’s energy potential. <\/p>\n\n\n\n<p>I’m a happier person today, having found purpose at the intersection between energy, people and technology. So instead of the traditional gradient of advise where I’d have to turn 40 then write to my 25 year old self, I’ll switch it up a little. Here’s what I’d tell my 40 year old self<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> 1. <strong>Keep an open mind <\/strong> <\/h4>\n\n\n\n<p>\n\nThis comes top especially in the energy management field in Kenya. The market is relatively young (hint hint entrepreneurs) which means the current energy services companies (ESCOs) engage in a wide spread of activities. I’ve been lucky enough to be part of teams carrying out audits of compressed air systems, heating and air conditioning (HVAC) units, boiler surveys, voltage stabilization opportunities, real time monitoring among others. Already these are standalone profesisions that are being practiced by only a few providers in the region.    \n\n<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">  <strong>Learning point<\/strong> <\/h4>\n\n\n\n<p>\n\nBe ready to have your mind stretched with absorbing new content. Use the opportunity to start prequalifying areas you’d like to specialize in. My antennae go up at every conversation touching on energy efficiency and utility monitoring, and so I’ll be sticking in this field for some time.\n\n<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">2.  <strong>People first, then technology, not the other way around<\/strong>   <\/h4>\n\n\n\n<p> My job description read something in the line of ‘conduct energy audits for different facilities’. Once you step in the field though, that deliverable can quickly be clouded with things like: <em>‘Follow up with the client and avail their facility data’ ‘You need to adjust the scope of the audit to make enough sense…’ ‘Big numbers in your report will attract no attention’  <\/em><\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong>Learning point<\/strong> <\/h4>\n\n\n\n<p>\n\nEven after all the fancy gizmos you use to make your data beautiful, it’s people who will have the final say. Remember your audience are selfish about the value they want. You need to talk to clients from the get-go to understand their needs and present useful information that addresses this. \n\n<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> 3. <strong>Know when to shift gears in your language  <\/strong> <\/h4>\n\n\n\n<p>\n\nOne time we were pitching a client on an energy managements program. It got to my part, and I quickly dived into all the technical hoopla that excited me and my colleagues. I didn’t realise that not everyone was patient or technical, or both. Let’s just say I never finished the presentation. \n\n<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">  <strong>Learning point<\/strong> <\/h4>\n\n\n\n<p>\n\nNow that I’ve read Seth Godin’s “This is Marketing”, I have a better understanding of why you should treat different people differently. It’s important, especially when dealing with executives, to invest in brevity. Put across the most important aspects of your pitch\/presentation and leave out enough room for Q&amp;A.\n\n<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> 4. <strong>Educate yourself intentionally and continually       <\/strong> <\/h4>\n\n\n\n<p> Routine is a sword that cuts both ways; it can establish a great rhythm for delivering value constantly. Or it can have you in busy mode where you forget the essence of what you’re doing. Ticking boxes, answering emails, returning phone calls, submitting documents can easily have you in a static mindset.   <\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong>Learning point<\/strong> <\/h4>\n\n\n\n<p> Take a step back to look at your general bearing every once in a while. I have weekly reviews to look at my current progress. I use an app called Asana to put down weekly goals because it’s easy to track progress over time. Use the internet to teach yourself. Back your work with extra knowledge. Pick a course, subscribe to a newsletter, read a book, join a professional body, commit to a volunteer organization. Whatever rocks your boat, as long as you have something engaging you on a different plane of thought.  <\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> 5. <strong>Have fun with your home team <\/strong> <\/h4>\n\n\n\n<p>Aah! The core team. The desk mates. The water dispenser community. These are people we enjoy that 5 minutes downtime chatting with, or getting a quick update on the tree planting event coming up this weekend.                                                                                                            We often forget to appreciate the people we are with in office everyday.  <\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> Here are a few things I’ve learned: <\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>A genuine handshake in the morning is a bilateral trade of positive energy. Make sure you smile and give a minor, but honest complement. <\/li><li>Give that hug, especially if you know someone is struggling. That assurance counts a lot sometimes. <\/li><li>Appreciate your colleagues – say thank you, good job, keep going, you can do it. Make sure you mean it. Say it especially when small things happen. <\/li><\/ul>\n\n\n\n<p>Even as the year continues to brew on, these few lessons aren’t going anywhere anytime soon. What would you tell your 40\/50\/60 year old self today?<\/p>\n<div class=\"energ-after-content\" id=\"energ-1329281448\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>After 1 year in energy management By Warren Ondanje I joined Eenovators back in March 2018 as an intern, after an adrenaline-pumped interview I thought I’d asked a little too many questions. Coming from a Chemical Engineering background, half the interview questions had me turning pale &#8211; you know chemical engineers and electrical stuff. Fortunately [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1203,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-1202","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1202","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1202"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1202\/revisions"}],"predecessor-version":[{"id":1324,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1202\/revisions\/1324"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1203"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1202"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1202"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1202"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}