{"id":1206,"date":"2019-05-16T11:30:54","date_gmt":"2019-05-16T11:30:54","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1206"},"modified":"2020-01-13T12:09:40","modified_gmt":"2020-01-13T12:09:40","slug":"what-the-energy-act-2019-means-for-the-energy-efficiency-space-in-kenya","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/what-the-energy-act-2019-means-for-the-energy-efficiency-space-in-kenya\/","title":{"rendered":"What the Energy Act 2019 means for the energy efficiency space in Kenya"},"content":{"rendered":"\n<p>By Chris Mbori<\/p>\n\n\n\n<p>President\nUhuru Kenyatta recently (March 12, 2019) signed the Energy Bill 2017 ushering a\nnew era in the energy space in Kenya. Being in the energy efficiency market, I have\nlooked through the new Energy Act 2019 and found three interesting highlights\nto share.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">1. <strong>The Energy Saving Certificate Scheme<\/strong><\/h4>\n\n\n\n<p>This is quite an interesting concept and ideally, I do not know how it will pan out from the start. It is almost like the carbon trading scheme but less structured since the details have not been provided in the act.<\/p>\n\n\n\n<p>Different designated energy consumers will be required to consume up to a certain prescribed norm and standard. <\/p>\n\n\n\n<p>A consumer who consumes less than the prescribed norm of energy will be rewarded with an energy savings certificate by the authority. <\/p>\n\n\n\n<p>On the other hand, if a consumer consumes more energy than the prescribed norm, they will be required to purchase energy savings certificates so as to off set their “over the limit” consumption. <\/p>\n\n\n\n<p>The procedure for issuing these energy savings certificates will have to be developed by the <a href=\"https:\/\/www.erc.go.ke\/\">Energy and Petroleum Regulatory Authority<\/a> (EPRA). I would assume that the authority would have to come up with a credible platform that awards genuine energy efficient institutions their energy savings certificates. <\/p>\n\n\n\n<p>A lot of work will have to be done to develop the threshold values or energy intensities that are considered the prescribed norm. Either way, it would be great if energy efficient facilities can get a way to sell off their energy savings certificates to less energy efficient facilities.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> 2. <strong>Counties Are Empowered to Implement Energy Efficiency<\/strong>.  <\/h4>\n\n\n\n<p>The new Kenya government county structure has been incorporated in this new energy act. The government has both the national government and county government, and traditionally, it has been the national government driving the energy efficiency and conservation programs. <\/p>\n\n\n\n<p>County governments have been given more responsibilities to ensure energy efficiency and conservation is implemented at the county level. <\/p>\n\n\n\n<p>Kenya currently has 47 counties and enforcing energy efficiency from the national level has been a daunting task for the Energy and Petroleum Regulatory Authority (EPRA). <\/p>\n\n\n\n<p>With the new energy law, we can say that energy efficiency and conservation has now been devolved to the county units. <\/p>\n\n\n\n<p>The County government shall be required to establish an energy efficiency fund for the promotion of energy efficiency and conservation in their respective counties. The counties shall also appoint inspecting officers to ensure compliance with the energy efficiency performance standard. <\/p>\n\n\n\n<p>Currently it has been the mandate of the energy regulatory commission (ERC now EPRA) to send inspecting officers to ensure compliance with energy efficiency standards. Devolving this function to the counties will improve on enforcement.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> 3. <strong>Energy Audits are Here to Stay<\/strong> <\/h4>\n\n\n\n<p>It is quite clear that energy audits will still continue being among the core activities that identify energy efficiency measures that need to be implemented. <\/p>\n\n\n\n<p>EPRA shall designate factories and buildings for the purposes of energy efficiency and conservation. These designated facilities shall be required to conduct energy audits, have a designated energy manager and implement energy efficiency measures that keep their consumption level under a set limit prescribed by the regulations.<\/p>\n\n\n\n<p>The energy auditors, energy managers and energy audit firms will have to be listed by EPRA in continuation with the current scenario. <\/p>\n\n\n\n<p>The energy management regulations 2012 that have guided the energy audits markets will otherwise need to be improved to include aspects like identification of energy managers for facilities, capacity building opportunities for the accredited professionals and probably Energy Service Company (ESCOs) regulations to enable introduction of performance contracting model in the energy efficiency market in Kenya.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong>Conclusion<\/strong> <\/h4>\n\n\n\n<p>As we still at the formative stages, currently the three agencies created with this new law are busy re-organizing themselves with the new Energy Act 2019. <\/p>\n\n\n\n<p>EPRA will have a lot of work to do to ensure that the energy efficiency market is vibrant and helps the country meet its COP 21 Paris Agreement goals while saving the country huge investment in building power plants that power energy wastes. <\/p>\n\n\n\n<p>They will also have to promote awareness with the standard and labeling programs, information on energy consumption and energy statistics required to build schemes like the energy savings certificates. Most of the regulations will either have to be created anew or improved to accommodate the demands of the new energy act. <\/p>\n\n\n\n<p>The county government will also need support to drive energy efficiency and conservation at their respective counties. Implementing all this may take a few years but ultimately we shall soon usher in a new era in the energy efficiency and conservation space here in Kenya…<\/p>\n\n\n\n<p><em>Chris Mbori is passionate about energy management professional. He is currently the Managing Director for <a href=\"https:\/\/eenovators.com\/\">Eenovators Ltd<\/a>  and doubles up as the Vice President for the Association of Energy Professionals Eastern Africa<\/em><\/p>\n<div class=\"energ-after-content\" id=\"energ-2282781320\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Chris Mbori President Uhuru Kenyatta recently (March 12, 2019) signed the Energy Bill 2017 ushering a new era in the energy space in Kenya. Being in the energy efficiency market, I have looked through the new Energy Act 2019 and found three interesting highlights to share. 1. The Energy Saving Certificate Scheme This is [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1207,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-1206","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1206","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1206"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1206\/revisions"}],"predecessor-version":[{"id":1288,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1206\/revisions\/1288"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1207"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1206"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1206"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1206"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}