{"id":1210,"date":"2019-05-20T14:08:19","date_gmt":"2019-05-20T14:08:19","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1210"},"modified":"2020-01-13T12:06:04","modified_gmt":"2020-01-13T12:06:04","slug":"world-energy-day-2019-topics","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/events\/world-energy-day-2019-topics\/","title":{"rendered":"World Energy Day 2019 &#8211; Topics"},"content":{"rendered":"\n<p>By Carolyne Gathuru<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Amplifying the Energy and Climate Change Conversation – Unveiling The World Energy Day 2019 Menu…. <\/h2>\n\n\n\n<p>What better time than this to be championing the discourse around the Energy and Climate Change agenda. What with the world decrying the sorry state of energy affairs in the continent and the climate change effects that are slowly but surely creating a whole new world of undesired environmental impacts. This October, Africa congregates to crown the World Energy Day 2019 Celebrations with a conference. That seeks to address &#8211; ‘Energy Sustainability in Africa: Unlocking the Energy and Climate Change Equation’. <\/p>\n\n\n\n<p>Acknowledging that an energy-climate change gap currently exists. Where energy management efficiency and climate change are handled as two separate areas of focus. There is need to synergize efforts for more sustainable impact.  To harness the energies expended to tackle these matters towards a common goal.  With this specific focus, the 2019 gathering of energy and climate change enthusiasts will thoroughly work through the conference theme and discuss both traditional and emerging issues.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Conference discussion topics<\/h4>\n\n\n\n<p>Lined up for discussion include discussion and presentation areas that touch on at least ten SDGs (1, 2, 5, 6, 7, 8, 10, 11, 13, and 15). With a view to creating synergies that plug into sustainable actions for implementation. The presentation list includes:<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li>Leading Energy Change in the region. Designed to provide insights into the role of both public and private sector leadership to support the energy industry and champion energy change<\/li><li>The Government’s Role in realizing the Big 4 Agenda. From an energy perspective and how this dove tails into the major projects on Healthcare, Affordable Housing, Food Security and Manufacturing Infrastructure<\/li><li> An exposition on contextualizing global energy dynamics, and how Africa can tap into this for sustainability<\/li><li> Exploring the adoption of the energy regulations in counties to formulate energy implementation plans with case studies and projections for the more promising counties<\/li><li> An overview of the global, regional and local green building sector and the role of real estate industry players in driving energy and climate change best practice<\/li><li> Opportunities to synthesize the Energy and Water Efficiency Nexus, including monitoring, measurement and mitigation of waste<\/li><li> The corporate endeavour towards bridging the energy and climate change SDGs implementation gap <\/li><li> The gender mainstreaming agenda in the energy and climate change sector – roles and responsibility mapping<\/li><li> Energy efficiency and climate change impacts in the  transport and logistics sector<\/li><li> Technological disruption – riding the digitization wave to harvest opportunities for water, energy and climate change efficiencies<\/li><li> Energy Financing – projects and case studies towards implementation of financial return on investment for energy efficiency <\/li><li> Renewable energy trends in the Industry &#8211; reviewing local and national and local renewable energy prospects and their impact<\/li><li> Energy and Climate Change  Innovation – exploring tapping into Block chain, AI and Big Data<\/li><li>Energy and climate change capacity development in the region and what it takes to empower energy and climate change graduates to full professionals<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\">Conclusion<\/h4>\n\n\n\n<p>With professional speakers hailing from the different continents to provide a global perspective.  Both global energy leaders and climate change experts will provide perspectives for sustainable growth to propel Africa forward. Being part of this conversations for change will contribute towards shaping the future of Africa. Energy and climate change enthusiasts who want to stand up to be counted, need to plug into. Contribute towards these discussions that are more relevant now than ever before. <\/p>\n<div class=\"energ-after-content\" id=\"energ-2535778443\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Carolyne Gathuru Amplifying the Energy and Climate Change Conversation – Unveiling The World Energy Day 2019 Menu…. What better time than this to be championing the discourse around the Energy and Climate Change agenda. What with the world decrying the sorry state of energy affairs in the continent and the climate change effects that [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1211,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[201],"tags":[103,189,191,190],"class_list":["post-1210","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-events","tag-world-energy-day","tag-world-energy-day-2019","tag-world-energy-day-conference","tag-world-energy-day-kenya"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1210","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1210"}],"version-history":[{"count":4,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1210\/revisions"}],"predecessor-version":[{"id":1512,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1210\/revisions\/1512"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1211"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1210"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1210"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1210"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}