{"id":1544,"date":"2019-07-05T05:55:57","date_gmt":"2019-07-05T05:55:57","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=1544"},"modified":"2020-01-13T12:02:03","modified_gmt":"2020-01-13T12:02:03","slug":"important-facts-about-energy-and-tourism","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/important-facts-about-energy-and-tourism\/","title":{"rendered":"Important Facts About Energy And Tourism"},"content":{"rendered":"\n<h3 class=\"wp-block-heading\">Is There a Relationship Between Energy And Tourism?<\/h3>\n\n\n\n<p>By Monica Ngage<\/p>\n\n\n\n<p>Tourism is one of the main foreign income earners for our country. Apart from income generation, it significantly impacts the environment negatively and as a result, there is a need to shift to a form of tourism that is sustainable called <strong>ecotourism<\/strong> which has minimal impacts on the environment. Energy is indispensable in our day to day lives and tourism facilities haven’t been left out.<\/p>\n\n\n\n<p>The United Nations World Tourism Organization (2008) suggests that there is a dual relationship between tourism and global warming where tourism is both a contributor as well as a victim. Tourism through its various components (tourist destinations, transportation, accommodation, travel brokers and travel related services) is responsible for about 5% of global CO2 emissions. Hence the need to adopt sustainable tourism.<\/p>\n\n\n\n<p>Sustainable tourism promotes the adoption of green energy solutions as well as a global trend with travelers being keener on green practices. This has seen the demand for tourism accommodation facilities to take responsibility for their contributions to climate change and the declining environmental state. Green energy, also referred to as renewable energy is derived from sources that can be used repeatedly without getting depleted which include; wind, hydro energy, solar energy biomass, and tidal power. Green energy can be harnessed and used for various uses within a tourist facility, such as cooking, heating water for guests and lighting.<\/p>\n\n\n\n<p>Ecotourism Kenya has a criterion that specifically addresses energy. The criterion states that energy sources should be indicated, monitored and conserved. It further emphasizes the adoption of renewables as well as innovative measures for sustainable use of energy that actively includes efforts by both guests and employees.&nbsp; Further to this, The Energy (solar water heating) Regulations, 2012 require among other things that, all premises within the jurisdiction of local authorities with hot water requirements of a capacity exceeding one hundred liters (100 liters) per day shall install and use solar heating systems.<\/p>\n\n\n\n<p>A good number of facilities within the Eco-rating Scheme have adopted the use of green energy. One example is Olarro Lodge, a Gold Eco-rated facility. The lodge is powered primarily by solar energy.&nbsp; The facility has invested in a total of 150 solar panels fixed with power inverters systems. This energy is harnessed, stored and used to supply the requirements of electricity, water heating and maintenance of the swimming pool. The lodge has also installed twenty-six (26) solar water heating system each with a capacity of 300 liters.<\/p>\n\n\n\n<p>Sustainable tourism also emphasizes energy conservation and efficient use of the already available energy. In this effect, Olarro Lodge has invested in the use of solar rechargeable torches\/flash lights in the guest rooms. All visitors are also briefed upon arrival on the need to conserve energy through switching off unnecessary lights. This has further been exemplified by installing sensitization signage throughout the facility encouraging both staff and guests to switch off unnecessary lights. LED (Light Emitting Diodes) and energy saving bulbs are fixed throughout the facility for energy use efficiency.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Apart from the example mentioned above, we have other simple but efficient practices that tourism facilities can adopt; these includes&nbsp;<\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>Switching off power appliances when not in use,<\/li><li>Replacement of incandescent bulbs with Light Emitting Diode (LED) bulbs which have lower energy consumption,<\/li><li>Use of efficient clothes washer in the laundry \/ running laundry machines on optimum weight hence reducing wastage,<\/li><li>Energy awareness by the assessment of the facilities energy usage data. Both the management and the employees should be well versed with the pros and cons of energy management,<\/li><li>Facility monitoring to access the level of energy consumption and the facility energy demand so as keep a track of environmental impacts over time.<\/li><\/ul>\n\n\n\n<p>Before making any travel and booking arrangements, it is important to know if the accommodation facility is ecofriendly. You can get this information by asking the hotel providers the following:<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li>If they have an environmental policy and demand to see it<\/li><li>The kind of accreditations that they have<\/li><li>The hotel rating say by Ecotourism Kenya<\/li><li>Sustainability standards<\/li><li>Their Waste recycling process and usage of local materials<\/li><li>The involvement of the local people in their activities<\/li><li>Sources of hot water in the showers; is it solar heated?<\/li><li>The conservation projects they engage in<\/li><li>If the hotel uses&nbsp; renewable energy<\/li><li>Where they source their food<\/li><\/ul>\n\n\n\n<p>There is no limit to the questions that you can ask; the more you ask the more you understand the facility.&nbsp;<\/p>\n\n\n\n<p>It is the desire of every business to satisfy their clients. With the increased demand for ecofriendly products, the hospitality facilities will be compelled to go green in order to satisfy their clients. By so doing, they not only increase their clientele base, but also make earth a better place for all of us.<br><\/p>\n\n\n\n<p>Source: Ecotourismkenya.org; <a href=\"https:\/\/ecotourismkenya.org\/eco-rated-facilities\/entry\/21\/\">https:\/\/ecotourismkenya.org\/eco-rated-facilities\/entry\/21\/<\/a><\/p>\n\n\n\n<p>United Nations World Tourism Organization (2008): <a href=\"https:\/\/sdt.unwto.org\/content\/faq-climate-change-and-tourism\">https:\/\/sdt.unwto.org\/content\/faq-climate-change-and-tourism<\/a><\/p>\n\n\n\n<p>ERC Regulations 2012: <a href=\"https:\/\/renewableenergy.go.ke\/index.php\/news\/3\">https:\/\/renewableenergy.go.ke\/index.php\/news\/3<\/a><\/p>\n\n\n\n<p>Ollaro lodge: <a href=\"https:\/\/olarrokenya.com\/\">https:\/\/olarrokenya.com<\/a><br><\/p>\n<div class=\"energ-after-content\" id=\"energ-2289418149\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Is There a Relationship Between Energy And Tourism? By Monica Ngage Tourism is one of the main foreign income earners for our country. Apart from income generation, it significantly impacts the environment negatively and as a result, there is a need to shift to a form of tourism that is sustainable called ecotourism which has [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1545,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-1544","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1544","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=1544"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1544\/revisions"}],"predecessor-version":[{"id":1548,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/1544\/revisions\/1548"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1545"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=1544"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=1544"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=1544"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}