{"id":196,"date":"2018-04-13T03:29:21","date_gmt":"2018-04-13T03:29:21","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=196"},"modified":"2020-01-14T11:55:40","modified_gmt":"2020-01-14T11:55:40","slug":"a-night-with-the-energy-royals","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-industry-news\/a-night-with-the-energy-royals\/","title":{"rendered":"A Night with the Energy Royals"},"content":{"rendered":"\n<p>By Ted Otieno<\/p>\n\n\n\n<p>Last month, we had the opportunity to attend the Energy Management Awards (EMA) Gala Night themed: ‘A Night with the Energy Royals’ with my fellow Energy Engineers from <a href=\"http:\/\/eenovators.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Eenovators Ltd<\/a>.<\/p>\n\n\n\n<p>It was a great event where professionals, institutions and legal bodies interested in carving the path towards a sustainable future for Kenya gathered in order to recognize those who had made commendable steps towards achieving these goals.<\/p>\n\n\n\n<p>As an Energy auditor, seeing the measures adopted by Large and Medium scale industries to cut down on energy consumption, based on recommendations from fellow licensed auditors, has been a positive assurance that the audits conducted are not in vain.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Why Energy Management?<\/strong><\/h4>\n\n\n\n<p>The ever-rising cost of energy creates a significant challenge to enterprises as they strive to become more competitive in a globalized environment. Kenya has experienced significant economic growth in the last couple of years, which has resulted in an increased demand for electricity. <\/p>\n\n\n\n<p>One of Kenya’s long-term goals as outlined in Vision 2030 is to provide an installed capacity of 21,599 MW come 2031. Despite having this target, it is imperative for energy savings to be implemented in order to meet the current demand and cut on the cost of generating new power. A good rule of thumb is that for every one unit of energy saved, three units generated are saved.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>The Award<\/strong><\/h4>\n\n\n\n<p>The Primary purpose of the <a href=\"http:\/\/kam.co.ke\/index.php\/energy-management-awards\" target=\"_blank\" rel=\"noreferrer noopener\">Energy Management Award<\/a> (EMA), managed by the Kenya Association of Manufacturers through the Center for Energy Efficiency and Conservation (CEEC), is to encourage a culture of energy efficiency and conservation. The awards are in several categories:-<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li>&nbsp;Overall Energy Management<\/li><li>Large Energy Consumers<\/li><li>Best Energy Management Team<\/li><li>Overall Energy Management Award<\/li><li>Fuel Oil Savings<\/li><li>Electricity Savings Large<\/li><li>Electricity Savings SMEs<\/li><li>Service Sector Award<\/li><li>Sustained High Performance<\/li><li>Best New Entrant<\/li><li>Energy Award Masters Student<\/li><li>Green Architect of the Year Award<\/li><\/ul>\n\n\n\n<p>This year the overall winner of the awards was Mzuri Sweets demonstrating significant Energy savings measures that included implementation of modern energy management infrastructure in their organization. Their initiatives covered variable speed drives and installation of energy efficient Extract Fans.<\/p>\n\n\n\n<p>Through energy management, the <a href=\"http:\/\/kam.co.ke\/index.php\/energy-services\/overview\" target=\"_blank\" rel=\"noreferrer noopener\">CEEC<\/a> offers an incentive to close the gap between demand and cost of energy. Companies in energy intensive sectors are targeted and encouraged to cut down their consumption. EMA then recognizes enterprises that have made substantial and sustainable gains in energy efficiency through the application of modern energy management principles and practices. In order to be eligible participant for an award a company must have shown: &#8211;<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li>A well developed, documented, communicated and updated energy policy.<\/li><li>A plan of action for implementing the policy<\/li><li>A systematic way of conducting regular investment grade energy audits by licensed energy audit firms as outlined by ERC regulation.<\/li><li>Acquired resources and structures for implementing energy efficiency measures.<\/li><li>Invest in M&amp;V to show gains in energy efficiency over a period of time.<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\">The benefits of participating in EMA include: &#8211;<\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>A free session on Energy Management Training for all participants during the EMA assessment tool awareness seminar.<\/li><li>A forum with KAM Chairman to discuss energy issues.<\/li><li>A walk through audit with a feedback report.<\/li><li>Inclusion into the Energy Champions Club where you will receive the quarterly E-Newsletter.<\/li><li>Exclusive invitation to KAM to build your experience in Energy Management.<\/li><\/ul>\n\n\n\n<p>Companies in energy intensive sectors can participate by filling out an application form. Application forms can be downloaded from the KAM webpage. An assessment tool is sent to for completion and return to the secretariat. A technical team is dispatched to verify the information on the assessment tool by visiting the organization. Thereafter, the technical team does an assessment of returns and a report is developed for the panel of judges. The panel of judges then adjudicates to select the winners and the runners-up and develops a report for the Advisory Council. The Advisory verifies and ratifies the judges’ report. To cap it all is the gala night where the winners are announced.<\/p>\n\n\n\n<p>As a Energy Manager (EMIT) , and for professionals in the energy sector, it is commendable for KAM to have carried out &nbsp;subsidized energy audits in over 350 establishments and training over 120 Certified Energy Managers. It is important for large energy consumers, SMEs and even students to participate in the EMA awards in order to share and benefit from Energy Cost saving Measures implemented by their counterparts and ultimately create a sustainable energy future for Kenya. In the words of Pradeep Paunrana, the KAM chairman, ‘We need to leave the world better than we found it and have better discussions on sustainability.’<\/p>\n\n\n\n<p><strong><em>Ted is a licensed EMIT (Energy Manager in Training) and has a keen interest in implementation of Energy Cost Saving Measures for Commercial and Industrial Clients. Ted also specializes in Energy Audits as well as Monitoring and Verification of Implemented Energy Cost saving Measures. If you would like to reach him send him an email at ted@eenovators.com.<\/em><\/strong><\/p>\n<div class=\"energ-after-content\" id=\"energ-263911160\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Ted Otieno Last month, we had the opportunity to attend the Energy Management Awards (EMA) Gala Night themed: ‘A Night with the Energy Royals’ with my fellow Energy Engineers from Eenovators Ltd. It was a great event where professionals, institutions and legal bodies interested in carving the path towards a sustainable future for Kenya [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":675,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[24],"tags":[71,72,59],"class_list":["post-196","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-energy-industry-news","tag-ema","tag-energy-management-awards","tag-energy-management-in-kenya"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/196","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=196"}],"version-history":[{"count":4,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/196\/revisions"}],"predecessor-version":[{"id":1464,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/196\/revisions\/1464"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/675"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=196"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=196"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=196"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}