{"id":203,"date":"2019-05-02T02:50:50","date_gmt":"2019-05-02T02:50:50","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=203"},"modified":"2020-01-13T12:14:22","modified_gmt":"2020-01-13T12:14:22","slug":"voltage-optimization-fact-or-fiction","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/tools\/voltage-optimization-fact-or-fiction\/","title":{"rendered":"A Review of Voltage Optimization"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">‘Fact or Fiction’<\/h2>\n\n\n\n<p>Voltage optimization seems to be the current buzz word in Kenya among Energy Engineers. Just the other day, at a meeting with colleagues on how to better save energy for a client who has over 100 facilities that need to be audited, the word voltage optimization was getting thrown around, when one of my colleagues asked,” what exactly is the principle behind voltage optimization and does it really work?”<\/p>\n\n\n\n<p>Voltage optimization raises lots of questions before one actually implements it. So what exactly is Voltage optimization? To fully understand Voltage optimization, one needs a good understanding of Voltage management. This is not a new concept even though it has only just recently made its way into this region.<\/p>\n\n\n\n<p>Facilities have been implementing Voltage management for years to better utilize their energy use. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> Common Voltage Management techniques include:- <\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>Voltage Optimization<\/li><li>Voltage Stabilization<\/li><li>Voltage Regulation<\/li><li>Voltage Power Optimization<\/li><li>Voltage Reduction<\/li><\/ul>\n\n\n\n<p>The basic principle of all voltage management techniques is to reduce voltage of all incoming supply and maintain it at this optimum voltage while eliminating transients.<\/p>\n\n\n\n<p>Currently, the supply voltage in <strong>Kenya<\/strong> is <strong>415V\/240V 50 Hz<\/strong>. However, most of the equipment used by C&amp;I clients comes from Europe where the voltage <strong>is 400V\/230V <\/strong><strong>&nbsp;10%<\/strong>. This puts the working voltage range of the equipment at <strong>380-420V<\/strong>. It is for this reason that voltage optimization presents itself as a very feasible Energy cost saving measure in Kenya.<\/p>\n\n\n\n<p>To identify and understand potential opportunities where voltage optimization works well begins with classifying loads under Voltage dependent and Voltage independent loads.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> The best way to understand these loads is with examples. For illustration purposes take some of the common loads in any C&amp;I facility like:- <\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>Resistive Loads &#8211; Heaters<\/li><li>Lighting<\/li><li>Motors<\/li><li>ICT equipment<\/li><\/ul>\n\n\n\n<p>It is important to understand each load since Voltage optimization does not work on a blanket approach.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong>Resistive Loads<\/strong> <\/h4>\n\n\n\n<p>For linear resistive loads the basic power equation is<strong>:- &nbsp;<\/strong><\/p>\n\n\n\n<p>In this case for a <strong>1% decrease<\/strong> in V there is a <strong>2%<\/strong> decrease in power. Most of the linear resistive loads are <strong>voltage dependent<\/strong>. However, one has to be very cautious when the load has feedback control. Take the example of a domestic electric Kettle.<\/p>\n\n\n\n<p>Boiling water takes the same amount of <strong>energy<\/strong> to <strong>boil<\/strong> regardless of the supply. When the Voltage is high the kettle will take a shorter time to boil the water. On the other hand if the Voltage is low it will draw less power but take longer to boil the water before turning off. In practice this load is in fact <strong>Voltage independent<\/strong>.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong>Lighting<\/strong> <\/h4>\n\n\n\n<p>When it comes to lighting, Filament Lamps are the best example of <strong>Voltage dependent loads<\/strong>. A Filament Lamp rated at 40W if supplied at 230Volts draws 40W. However if supplied 242 V it will draw 44W. This means that at the higher Voltage it would consume 10% more energy. When working with voltage optimization for lighting, it is important to concentrate on the lumens\/watt in order to ensure that the Indoor lighting conditions are met.<\/p>\n\n\n\n<p>With Recent energy conservation measures most Filament lamps have been phased out and replaced with LEDs.&nbsp; Unlike Filament Lamps LED lamps are <strong>voltage independent <\/strong>this same reason makes them unsuitable for use with dimmers.<\/p>\n\n\n\n<p>The table below gives a summary of examples of Voltage dependent and Voltage independent Lighting loads.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong>Voltage dependent Loads<\/strong> <\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>Incandescent<\/li><li>Fluorescent – Inductive Ballast<\/li><li>Metal Halide – Depending on ballast<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong>Voltage Independent<\/strong> <\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>Fluorescent Lamp – Electronic Ballast<\/li><li>LEDs<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong>Motors<\/strong> <\/h4>\n\n\n\n<p>During audits, most motors in place have been asynchronous induction motors. When it comes to motors, Voltage management relies on the high losses incurred by these motors to cut back on energy consumption.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> Losses from Over voltage on motors include:- <\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>Saturation of iron core.<\/li><li>Wasted energy through eddy currents.<\/li><li>Increased hysteresis losses.<\/li><li>Excess current draw that leads to excess heat output due to copper losses.<\/li><\/ul>\n\n\n\n<p>These Losses constitute a large portion of the power demand from motors thus rendering them <strong>voltage dependent<\/strong>. Running the motor on the lower end of the rated voltage operation range does not affect efficiency. The only effect may be an increase in slip but this is negligible since speed is mainly a function of the frequency and the number of poles. Voltage management for asynchronous induction motors is therefore an effective solution for energy savings and should be strongly considered.<\/p>\n\n\n\n<p>However servo-motors and motors with variable speed drives are <strong>voltage independen<\/strong>t and do not offer the same measure of savings.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong>ICT equipment<\/strong> <\/h4>\n\n\n\n<p>ICT equipment like most electronic equipment is designed for world markets. As such it accepts a wide range of input voltages while operating with fixed DC voltages. This is possible because they rely on in-built regulated power supplies that consume the same amount of energy over a wide range of inputs. A good example is a typical computer that gives an output of&nbsp;<strong>20V<\/strong>&nbsp;with a nominal input of&nbsp;<strong>100- 240Volts.&nbsp;<\/strong>For this reason most ICT equipment are&nbsp;<strong>Voltage independent<\/strong>.<\/p>\n\n\n\n<p>Voltage optimization is therefore a fact and does work but not always. As a start it is imperative to conduct a survey of your facility in order to determine the potential for implementing voltage optimization before undertaking the investment. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> Below gives a summary of these steps:- <\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>A: Measure Voltage and Power<\/li><li>B: Measure Voltage drop across facility<\/li><li>C: Determine Proportion of energy that is voltage dependent<\/li><li>D: Identify any critical loads<\/li><li>E: Calculate potential energy savings<\/li><li>F: Decide power rating of voltage optimization equipment<\/li><\/ul>\n\n\n\n<p>For an optimal Voltage Management solution, it would be prudent to seek no-capital investment solutions.&nbsp; The whole Process A-F above in this case would be undertaken at no cost to the client and would need to be conducted by a licensed, ERC Energy audit firm.<\/p>\n\n\n\n<p>It would beg imperative that all parties involved in the Voltage Management Project work on a shared savings approach where the consulting parties take all the overhead risk and share the end savings with the client.<\/p>\n\n\n\n<p>It is advisable to partner with companies that have a proven record of having already implemented voltage optimization in a large number of facilities. There is on record energy savings achieved by clients upwards of 20%, with a case study of hotel and service industry clients recording a savings of 25%.<\/p>\n\n\n\n<p>To re-iterate Voltage optimization is fact not fiction. With that being said, it requires a careful study of one’s facility before undertaking the investment.<\/p>\n\n\n\n<p><strong><em>Article by: Ted Otieno<\/em><\/strong><\/p>\n\n\n\n<p><strong><em>ted@eenovators.com<\/em><\/strong><\/p>\n\n\n\n<p><strong><em>Ted is a licensed EMIT (Energy Manager in Training) and has a keen interest in implementation of Energy Cost Saving Measures for Commercial and Industrial Clients. Ted also specializes in Energy Audits as well as Monitoring and Verification of Implemented Energy Cost saving Measures.<\/em><\/strong><\/p>\n<div class=\"energ-after-content\" id=\"energ-3694501910\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>‘Fact or Fiction’ Voltage optimization seems to be the current buzz word in Kenya among Energy Engineers. Just the other day, at a meeting with colleagues on how to better save energy for a client who has over 100 facilities that need to be audited, the word voltage optimization was getting thrown around, when one [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":672,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,199],"tags":[],"class_list":["post-203","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-tools"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/203","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=203"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/203\/revisions"}],"predecessor-version":[{"id":1320,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/203\/revisions\/1320"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/672"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=203"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=203"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=203"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}