{"id":251,"date":"2019-05-16T09:17:39","date_gmt":"2019-05-16T09:17:39","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=251"},"modified":"2020-01-13T12:09:51","modified_gmt":"2020-01-13T12:09:51","slug":"the-difference-between-energy-and-power","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/the-difference-between-energy-and-power\/","title":{"rendered":"THE DIFFERENCE BETWEEN ENERGY AND POWER"},"content":{"rendered":"\n<p>\n\nBY OMBAJO VINCENT GEDION\n\n<\/p>\n\n\n<p><\/p>\n<p>The confusion surrounding these two words cannot be gainsaid. In fact, the confusion also reigns within professional circles of engineers, scientists and technicians.<\/p>\n<p>And when the two words are in the vicinity of each other, for instance in a sentence, the mix-up doubles even more.<\/p>\n<h6>Energy And Power Explained<\/h6>\n<p>Energy and power, are often thought by many as synonyms. However, this misperception can be forgiven because Energy and Power possess a high degree of interrelation.The good news is that they are not in any way difficult to differentiate.<\/p>\n<p>Energy and Power are related but different physical quantities in the field of energy generation, storage and usage.<\/p>\n<p>Stated simply, energy is the capacity to do work or the ability to do work while power is the rate at which that work is done. Essentially, power is a measurement of energy…a measure of its rate.<\/p>\n<p>Power calculates the time by which the energy has been consumed. So energy can be delivered to run an equipment, but the rate at which it runs the equipment is its power. Put simply, that the equipment can run slow or fast translating to low power or high power respectively.<\/p>\n<p>Therefore, it is important to note that energy is a measure of the total quantity of work done while power is a measure of how fast that particular work is done. Suffice to say, thus, that power and energy are not similar. Power is the rate of energy per unit time.<\/p>\n<p>Take the example of a car or a light bulb. For the car to move down a highway, work has to be done to move it. It takes energy to do this work. The car can move faster or slowly. How fast or slow this energy moves the car is called power. Therefore, the faster the work is done on the car, the more the power.<\/p>\n<p>Let us take the example of a filament bulb. For a bulb to light, electrons have to be moved. Moving these electrons take work that obviously requires energy. The rate at which these electrons are moved is power.<\/p>\n<p>The electrons can be moved faster or slowly and that will depend on the energy supplied. Taking an examples of engines, a smaller engine can do the same amount of work, produce the same energy, consume the same fuel just as much as a bigger engine.<\/p>\n<p>But where is the difference? While the two engines can perform the same amount of work, the smaller engine will take more time while the bigger one will take a shorter time.<\/p>\n<p>Why is this so? The smaller engine has less power while bigger engine has more power. The higher the power, the faster is the engine, and the quicker the work gets done.<\/p>\n<p>Electrical power is measured in Watts while Energy is measured in Watt-hours. For instance, if a bulb is rated 100 Watts. That is its power.<\/p>\n<p>But how much energy does it use? It will depend on how long it is left burning. If it burns for 10 hours, the total energy becomes 100 W ×10 hrs=1000 Watt hours. It can be written as 1 kWh because 1000 W is equivalent to 1kWh. To put it plainly, anytime you measure electrical energy, it is important to always check the ‘hours’.<\/p>\n<p>Finally, while energy can be stored, power cannot be stored. Also, while energy has a time component, power is an instantaneous element.<\/p>\n<p>Power remains constant, it cannot vary while energy can vary predictably. Energy changes form while power doesn’t. For example, kinetic energy can change to electrical energy and vice versa for work to be done. As a matter of principle, if something (work) has to happen, energy has to alter its form.<\/p>\n<p>On the other hand, power does not change, it only measures how fast the change has transpired. In short, power and energy are interrelated but not similar.<\/p><div class=\"energ-after-content\" id=\"energ-2423150376\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>BY OMBAJO VINCENT GEDION The confusion surrounding these two words cannot be gainsaid. In fact, the confusion also reigns within professional circles of engineers, scientists and technicians. And when the two words are in the vicinity of each other, for instance in a sentence, the mix-up doubles even more. Energy And Power Explained Energy and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1290,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-251","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/251","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=251"}],"version-history":[{"count":4,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/251\/revisions"}],"predecessor-version":[{"id":1292,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/251\/revisions\/1292"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1290"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=251"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=251"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=251"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}