{"id":2523,"date":"2020-04-29T13:46:44","date_gmt":"2020-04-29T13:46:44","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=2523"},"modified":"2020-04-29T13:46:45","modified_gmt":"2020-04-29T13:46:45","slug":"energy-efficiency-frequently-asked-questions","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/energy-efficiency-frequently-asked-questions\/","title":{"rendered":"ENERGY EFFICIENCY FREQUENTLY ASKED QUESTIONS"},"content":{"rendered":"\n<p>By Ruth Carol Atieno<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">What is Energy Efficiency?<\/h4>\n\n\n\n<p>Energy Efficiency means using less energy to perform the same task and in the end avoiding energy wastage. The less energy required to produce a unit of output, the more energy efficient that economic activity is.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Why Should We Embrace Energy Efficiency?<\/h4>\n\n\n\n<p>Energy Efficiency alone can largely contribute to the economic growth, human development, resilient infrastructure in a nation. Firms that have resorted to operating efficiently have reduced energy demand resulting to lower operating costs.<\/p>\n\n\n\n<p>Energy Efficiency goes hand in hand with clean environmental conditions. The amount of pollutants injected into the environment will go down when we embrace Energy Efficiency. Efficient industries and equipment release fewer greenhouse gases hence a reduction in carbon footprint.<\/p>\n\n\n\n<p>Operating on an Energy Efficient level will make it easier complying to environmental regulations that various governments have put in place. Being compliant will earn you a  good reputation which in the end will increase profits in the case of businesses.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">How does Energy Efficiency contribute to economic growth?<\/h4>\n\n\n\n<p>Energy Efficiency reduces production costs which boosts productivity and therefore economic growth.<\/p>\n\n\n\n<p>Energy Efficiency results into savings. These savings can then be used in the development of additional projects or investing in other economic activities.<\/p>\n\n\n\n<p>Energy Efficiency contributes to the efficiency of other elements of production, for instance capital and labor. Let us take a look at how the introduction of electric arc furnaces to steel making in the United States allowed scrap steel to be recycled for the first time, bypassing the most energy intensive step of the incumbent technology and greatly improving the energy efficiency of the industry. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Should Developing Countries Embrace Energy Efficiency<\/h4>\n\n\n\n<p>Of cause yes!<\/p>\n\n\n\n<p>According to a research by the <a href=\"https:\/\/www.mckinsey.com\/mgi\/overview\" target=\"_blank\" rel=\"noreferrer noopener\">McKinsey Global Institute <\/a>(MGI), if developing countries slow the growth of their energy demand by more than half over the next 12 years, from 3.4% a year to 1.4% a year , then they would gain greatly. <\/p>\n\n\n\n<p>The good news is that developing countries have started embracing Energy Efficiency and major improvements are being experienced.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">How Does Energy Efficiency Impact Climate Change?<\/h4>\n\n\n\n<p> Many analysts assume that Energy Efficiency lead to reduced greenhouse gases emission. But in recent years a number of economists and energy analysts have challenged the assumptions and methods behind these studies. <\/p>\n\n\n\n<p>They have criticized many of these findings and claimed that they are underestimating the technical, financial and information barriers to pursuing energy efficiency improvements.<\/p>\n\n\n\n<p>There is also a rapidly growing discussion that energy efficiency improvements can lead to an increase in demand for energy through a number of economic mechanisms known as “rebound effects.”<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">What Are Rebound Effects?<\/h4>\n\n\n\n<p>A rebound effect is the reduction in expected gains from new technologies that increase the efficiency of resource use, because of behavioral or other systemic responses.<\/p>\n\n\n\n<p>A rebound  effect therefore comes about when an improvement in Energy Efficiency triggers an increase in demand for energy. When the efficiency of an energy activity improves, the cost of the service derived is lowered. <\/p>\n\n\n\n<p>“Correct accounting for the rebound effect may reduce the potential contribution of energy efficiency to climate change mitigation, possibly altering the relative priority of different CO2 abatement policies,&#8221; <a href=\"https:\/\/www.iea.org\/\" target=\"_blank\" rel=\"noreferrer noopener\">The International Energy Agency<\/a> writes.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">What Are The Types of Rebound Effects?<\/h4>\n\n\n\n<p>We have two instances of rebound effects, direct and indirect.<\/p>\n\n\n\n<p>Direct rebound is the percentage of energy savings from efficiency that are offset by increased use. For instance, a 20% improvement in efficiency might provide a 19% only reduction in energy use.<\/p>\n\n\n\n<p>On the other hand, indirect rebound comes about depending how you spend the money you save. One example is when your new car cuts fuel consumption by 50% and you drive 6% more. You buy 53% as much fuel as before. You spend some of those savings on other goods and services, which require energy to produce. <a rel=\"noreferrer noopener\" href=\"https:\/\/blog.ucsusa.org\/peter-oconnor\/energy-efficiency-what-is-the-rebound-effect-946\" target=\"_blank\">Source<\/a><\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Why Do Rebound Effects Matter?<\/h4>\n\n\n\n<p>The immensity of rebound effects determines how effective Energy Efficiency improvements are at contributing to reductions in total energy use and in the end reduced greenhouse gas emissions. <\/p>\n<div class=\"energ-after-content\" id=\"energ-706699207\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Ruth Carol Atieno What is Energy Efficiency? Energy Efficiency means using less energy to perform the same task and in the end avoiding energy wastage. The less energy required to produce a unit of output, the more energy efficient that economic activity is. Why Should We Embrace Energy Efficiency? Energy Efficiency alone can largely [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2527,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"ENERGY EFFICIENCY FREQUENTLY ASKED QUESTIONS ","_seopress_titles_desc":"What is Energy Efficiency? Energy Efficiency means using less energy to perform the same task and in the end avoiding energy wastage","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-2523","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2523","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=2523"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2523\/revisions"}],"predecessor-version":[{"id":2528,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2523\/revisions\/2528"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/2527"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=2523"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=2523"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=2523"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}