{"id":2567,"date":"2020-05-19T10:13:25","date_gmt":"2020-05-19T10:13:25","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=2567"},"modified":"2020-05-19T10:13:27","modified_gmt":"2020-05-19T10:13:27","slug":"how-to-save-money-energy-in-your-retail-store","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/how-to\/how-to-save-money-energy-in-your-retail-store\/","title":{"rendered":"HOW TO SAVE MONEY &#038; ENERGY IN YOUR RETAIL STORE"},"content":{"rendered":"\n<p>By Ruth Carol Atieno<\/p>\n\n\n\n<p>Are you a retail shop or outlet owner? Is it &#8216;green&#8217;? If your answer to the first question is yes then you are in the right place. I will give you several achievable tips for you to join in the match towards a green future. You will save money, energy and the environment by simply putting the ideas into practice as you go about your daily activities.<\/p>\n\n\n\n<p>In the event of going green you will also be able to stand out from your competitors. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Energy Efficient Heating<\/h4>\n\n\n\n<p>Heating alone accounts for 40% of energy used in a retail store. One way to achieve energy efficiency is by setting the store temperatures slightly lower during cold seasons since most of the customers dress in warm outdoor clothes when leaving their houses. You could reduce the temperature by say 1%.<\/p>\n\n\n\n<p>Always keep the doors closed. An open door will let out heated air and let in cold air. You can consider installing a timed air curtain above the doors if they must remain open. The timing will ensure that the curtain only operated during the day.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Energy Efficient Lighting<\/h4>\n\n\n\n<p>Well, there has to be enough lighting in your store to ensure all products are well displayed to the customers.  How about you replace the incandescent and older fluorescent light bulbs with the energy efficient light-emitting diode (LED) or compact fluorescent (CFL) lights?<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Energy Efficient Refrigeration<\/h4>\n\n\n\n<p>Refrigeration on the other hand can account to almost half of the energy consumed in a retail shop. You can achieve energy efficient refrigeration by:<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li>Avoiding over-filling fridges &#8211; more products on the shelves prevents air circulating and means the equipment has to work harder.<\/li><li>Turning off internal display lights when the store is closed.<\/li><li>If the display refrigerators are fitted with doors, which is recommended for energy efficiency, make sure that the doors close properly and that the door seals fit correctly. For display refrigerators with pull down thermal insulating blinds, ensure these fit properly and are closed when the store is closed.<\/li><li>Remove anything that might restrict the airflow around the fridge.<\/li><li>Use insulating blinds and covers.<\/li><li>Keep condensers free from dust.<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\">Less Toxic Cleaning Materials<\/h4>\n\n\n\n<p>Ensure the chemicals used when cleaning your retail shop are less harmful to the environment. Harmful chemicals can contaminate your products therefore risking the lives of the consumers and in the end putting your business at the risk of having to shutdown. You could even opt for a way cheaper and environmentally friendly option like using just a mixture of water and vinegar.<\/p>\n\n\n\n<p>You can also consider contracting professional cleaners to do the cleaning as they have better knowledge on the best cleaning materials.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Fixtures<\/h4>\n\n\n\n<p>Buy used fixtures or use fixtures made out environmentally friendly materials such as wood. You will save money and also practice recycling in the end.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Indoor Plants For Air Conditioning<\/h4>\n\n\n\n<p>Plants can be used for clean air circulation or air conditioning. You could have these plants placed under the air conditioning vents to allow for quality air circulation.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Optional Packaging and Receipts<\/h4>\n\n\n\n<p>Save the trees!<\/p>\n\n\n\n<p>Ask customers if they need packaging and receipts instead of just giving them out because its a norm. You can also consider emailing them the receipts instead of having to print them out every time a customer buys goods from your retail store.<\/p>\n\n\n\n<p>Try and avoid packaging materials made out of plastic.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Energy Efficient Equipment<\/h4>\n\n\n\n<p>You might not be aware but that old computer, old AC, old freezer you have in your store is using up most of the energy supplied. Replace them with new ones but also, when selecting which ones to buy, check the energy star rating.<\/p>\n\n\n\n<p>Buy energy efficient equipment.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Switch It Off When Not In Use<\/h4>\n\n\n\n<p>Do not leave computers, printers or cash registers on when the shop is closed. They still use energy even when on sleep or idle modes. This will save you a lot.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Install Motion Sensors<\/h4>\n\n\n\n<p>Areas such as washrooms do not have people occupying them all the time and therefore no need for lighting throughout. Install motion sensors that will trigger lights to come on only when someone is in the area.<\/p>\n\n\n\n<p>For the products area you could take advantage of the natural light and use less overhead light during the day.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Sell Green Products<\/h4>\n\n\n\n<p>In the same spirit of trying to achieve a green store, help your customers have access to energy efficient products by having them in stock.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Get Employees Involved<\/h4>\n\n\n\n<p>To achieve a green store every stakeholder must be involved in the process. This means that even the employees should take part in the process. <\/p>\n\n\n\n<p>How do employees come in? First, you can train them on how to operate the equipment in an energy efficient way. Second, you can draw out an action plan that will ensure every employee knows what is expected of them. Third, motivating them will make them want to do their best, recognize the most energy efficient employee say monthly or yearly.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Conclusion<\/h4>\n\n\n\n<p>The ball is now in your court. It time to save money, save energy and have a clean environment.<\/p>\n<div class=\"energ-after-content\" id=\"energ-567411243\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Ruth Carol Atieno Are you a retail shop or outlet owner? Is it &#8216;green&#8217;? If your answer to the first question is yes then you are in the right place. I will give you several achievable tips for you to join in the match towards a green future. You will save money, energy and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2571,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"","_seopress_titles_desc":"You will save money and the environment by simply putting the ideas into practice as you go about your daily activities.","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[204],"tags":[],"class_list":["post-2567","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-how-to"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2567","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=2567"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2567\/revisions"}],"predecessor-version":[{"id":2572,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2567\/revisions\/2572"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/2571"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=2567"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=2567"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=2567"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}