{"id":2654,"date":"2020-06-30T07:39:34","date_gmt":"2020-06-30T07:39:34","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=2654"},"modified":"2020-06-30T07:44:19","modified_gmt":"2020-06-30T07:44:19","slug":"pump-over-sizing","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/pump-over-sizing\/","title":{"rendered":"PUMP OVER SIZING: CAUSES, EFFECTS, DETECTION AND REMEDIES"},"content":{"rendered":"\n<p>By Liz Nekesa<\/p>\n\n\n\n<p>Pumping systems support essential processes in buildings, manufacturing and water treatment. They are widely used in industries to provide cooling and lubrication services, transfer fluids in processes and provide motive force in hydraulic systems.<\/p>\n\n\n\n<p>Inadequate performance of pumps in cooling systems lead to unwanted overheating and pump downtime in the manufacturing and could also lead to loss in productivity. These, and other more drastic consequences of pump failure, inefficiency and improper sizing reaffirm the very critical need for pump reliability.<\/p>\n\n\n\n<p>To ensure pumps meet the needs of a system under all conditions, designers tend to size pumps conservatively in an attempt to ensure pumps are large enough to meet the said needs, this is Oversizing.<\/p>\n\n\n\n<p>In this blog, we look at other reasons for oversizing of pumps (centrifugal), its effects, detection and remedies.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Reasons for Over sizing of Pumps.<\/strong><\/h4>\n\n\n\n<p>The main cause for over sizing of pumps is application of safety margins by designers and planning engineers to cater for the many uncertainties in the design process. This plays out in several scenarios, some explained below.<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li>Pump sizing and system’s pressure drop is calculated much earlier in planning before pipe work has been routed. A safety factor is thus included in these initial calculations as the individual process piping is generally unknown at the concept stage.<\/li><li>Pump manufacturers add safety margins as well to guarantee the pumps will achieve intended performance hence oversizing may be inevitable.<\/li><li>Anticipation of expansion of the system and production capacity in the future may necessitate the installation of the needed infrastructure in the planning stage leading to higher safety margins.<\/li><li>Pump wear results in reduction in head and capacity, a safety factor may be included to counteract this eventual effect of wear.<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Effects of Over sizing pumps.<\/strong><\/h4>\n\n\n\n<p>Oversizing of pumps seems inevitable and necessary however, applying too much of a safety margin to a design can actually have unanticipated effects on system reliability, performance and efficiency. The penalties extend beyond high energy costs.<\/p>\n\n\n\n<p>Oversized pumps results in more flow delivered than required for the system. The effects are as below:<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li>Increased wear and maintenance costs as excessive fluid power from oversized pumps must be dissipated by a valve or a pressure regulating device.<\/li><li>Valve seat wear which results from throttling excess flow and cavitation creates a significant maintenance problem and shorten the interval between valve overhauls<\/li><li>Noise and vibration caused by excessive flow creates stress on pipe welds and pipe supports and in severe cases erode pipe walls.<\/li><\/ul>\n\n\n\n<p>The end result of attempts to incline on pump reliability by over sizing leads to less system reliability caused by additional wear and low efficiency in the operations<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Detection of over sized pumps.<\/strong><\/h4>\n\n\n\n<p>There are five common indications that a pump is oversized. These include:<\/p>\n\n\n\n<h5 class=\"wp-block-heading\">1. <strong>Excessive flow noise:<\/strong><\/h5>\n\n\n\n<p>This an indication that is frequently disregarded as operators get used to the noise in industry settings and is even an affirmation that things are ‘working’. The noise is brought about by flow-induced pipe vibrations. These vibrations tend to loosen flanged connection and other mechanical joints.<\/p>\n\n\n\n<h5 class=\"wp-block-heading\">2. <strong>Highly throttled flow control valves<\/strong><\/h5>\n\n\n\n<p>Imagine driving a car by having the accelerator fully depressed and using the brake to achieve desired speed. This is the scenario achieved by throttle valves that choke fluid flow so that less fluid moves through the valve while the pump is working to move the fluid. Excessive throttling needed to control flow is a major indicator of oversized pumps,<\/p>\n\n\n\n<h5 class=\"wp-block-heading\">3. <strong>Heavy use of By-Pass lines<\/strong><\/h5>\n\n\n\n<p>Among other reasons by-pass piping is normally installed, to supplement performance and handle excessive pressure or flow. A large number of open by pass valves is an indication that the system is performing inefficiently due to improper balancing, oversized pumps or both. Furthermore, energy needed to push fluid through these lines is wasted.<\/p>\n\n\n\n<h5 class=\"wp-block-heading\">4. <strong>Frequent Replacements.<\/strong><\/h5>\n\n\n\n<p>Best Efficiency Point (BEP) refers to a design point in pump curves where efficiency is maximized and the pump runs smoothest and radial forces are minimized. At this point the pump operates most cost efficiently in regard to efficiency and maintenance.<\/p>\n\n\n\n<p>Oversizing results in pumps operating to the left of their BEP due to generation of high back pressures from increased flow velocity. This leads to greater pressure exerted on mechanical seals, pipe vibrations that exacerbates bearing and seal wear and consequent frequent replacements.<\/p>\n\n\n\n<h5 class=\"wp-block-heading\">5. <strong>Intermittent Pump Operation.<\/strong><\/h5>\n\n\n\n<p>In the case where pumps are used to fill and drain or maintain a steady liquid level in a tank, the presence of an oversized pump will result in a sporadic cycle. A right sized pump would drain a tank more gradually and continuously as compared to an oversized pump.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Remedies to Over sized pumps.<\/strong><\/h4>\n\n\n\n<p>The following measures can be adopted to mitigate the effects of oversized pumps in a system.<\/p>\n\n\n\n<h5 class=\"wp-block-heading\">1. <strong>Impeller trimming<\/strong><\/h5>\n\n\n\n<p>Applicable to centrifugal pumps this is defined as the <em>process of machining the diameter of an impeller to reduce the energy added to the system fluid<\/em>, lowering flow and pressure generated by the pump. This is a practical correction to pumps that are oversized and has less impact than that of buying a smaller impeller.<\/p>\n\n\n\n<p>Benefits of impeller trimming include: <em>reduction in operating and maintenance cost, less fluid energy wasted in bypass lines, across throttle valves or dissipated as noise and vibrations<\/em>. Energy savings are roughly proportional to cube of the diameter reduction.<\/p>\n\n\n\n<p>It is advisable to reduce diameters not less than 70% of their original size as trimming affects operating efficiency and complicate performance predictions. In the case where excessive trimming is required replacing impeller with a smaller impeller is viable but costly.<\/p>\n\n\n\n<h5 class=\"wp-block-heading\">2. <strong>Use of Adjustable speed drives. (ASD).<\/strong><\/h5>\n\n\n\n<p>This a measure to achieve speed control in the case of variable flow rates. ASD’s modify speed of a single speed motor through mechanical or electrical methods and are most practical for applications with continuous changes in flow demand.<\/p>\n\n\n\n<p>ASD’s provide efficient operation by driving pumps at different speeds according to system needs.<\/p>\n\n\n\n<p>The most popular type of ASD is the Variable Frequency Drive (VFD) and electrical drive that adjust electrical frequency of power supplied to change rotational speed.<\/p>\n\n\n\n<h5 class=\"wp-block-heading\">3. <strong>Large\/small Pump configurations<\/strong><\/h5>\n\n\n\n<p>In this configuration the large and small pump are in parallel with the small pump referred to as a <em>pony pump<\/em>. This configuration operates more efficiently than using one large pump.&nbsp;<\/p>\n\n\n\n<p>In the example of draining and filing up a tank, the repeated stopping and restarting of pump wears it out and leads to unreliable pump operation. These adverse effects are even more severe when the pump is over sized.<\/p>\n\n\n\n<p>Adopting a smaller pump with lower capital cost is a good solution to reduce intermittent operation of the existing pump.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong><em>In conclusion<\/em><\/strong><\/h4>\n\n\n\n<p>There is an overall bias towards over sizing of pumps due to unknowns such as pipe fouling, scaling and future production rates, however, one cannot turn a blind eye on its negative effects on overall efficiency of the system, maintenance costs and power wastage.<\/p>\n\n\n\n<p>In light of the COVID-19 pandemic, the resulting economic stress on industries has catapulted savings derived from energy efficiency into the limelight. Adoption of measures to curb losses due to over sizing of pumps is prudent.<\/p>\n<div class=\"energ-after-content\" id=\"energ-3857634633\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Liz Nekesa Pumping systems support essential processes in buildings, manufacturing and water treatment. They are widely used in industries to provide cooling and lubrication services, transfer fluids in processes and provide motive force in hydraulic systems. Inadequate performance of pumps in cooling systems lead to unwanted overheating and pump downtime in the manufacturing and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2656,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"","_seopress_titles_desc":"Inadequate performance of pumps in cooling systems lead to unwanted overheating and pump downtime in the manufacturing and could also lead to loss in productivity.","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-2654","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2654","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=2654"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2654\/revisions"}],"predecessor-version":[{"id":2662,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2654\/revisions\/2662"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/2656"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=2654"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=2654"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=2654"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}