{"id":2682,"date":"2020-07-10T13:13:07","date_gmt":"2020-07-10T13:13:07","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=2682"},"modified":"2020-07-10T13:13:08","modified_gmt":"2020-07-10T13:13:08","slug":"5-ways-energy-professionals-can-champion-their-career-growth","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/5-ways-energy-professionals-can-champion-their-career-growth\/","title":{"rendered":"5 WAYS ENERGY PROFESSIONALS CAN CHAMPION THEIR CAREER GROWTH"},"content":{"rendered":"\n<p>By Karen Thuranira<\/p>\n\n\n\n<p>At every onset of a new year, most people set resolutions, and energy professionals are not an exception. For many, these goals involve improving their personal lives and are mostly centered on improving their health and wealth.&nbsp; But, have you ever considered how much time you spend on your career? Do you set resolutions relating to your workplace?<\/p>\n\n\n\n<p>For most energy professionals, engaging in growth and development activities is critical to ensuring that they remain competent and grow their careers in the energy industry. Bodies like the Engineers Board of Kenya(EBK), Association of Energy Engineers(AEE) and many others, would require that one earns a certain number of CPD points for their license to be renewed.<\/p>\n\n\n\n<p>Despite these bodies that make it mandatory for professionals to constantly grow and develop themselves, it is our responsibility to ensure that we are always growing and getting better in what we do.<\/p>\n\n\n\n<p>2020 has not been a very normal year and most people including professionals in different industries have been negatively affected by the effects of the Coronavirus. People have been working from home, and most activities have been put on pending due to the lockdown and other restrictive government directives.<\/p>\n\n\n\n<p>As we get into the second half of the year and as many countries open up after the lockdown, most professionals are looking for ways to make up for the lost time and ensure that they make the best of the remaining time before the year comes to an end.<\/p>\n\n\n\n<p>If you are looking to grow yourself professionally, engage deeply your work life and impact your place of work positively during this second half of the year, here are a few ideas that could help;<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">1. <strong>Creating a culture of mentorship<\/strong><\/h4>\n\n\n\n<p>In every workplace, there are different professionals, some with a wealth of experience and yet they do not get an opportunity to put all the knowledge they have to work.<\/p>\n\n\n\n<p>Taking a poll around your workplace to see what talents and skills people possess and whether they would be willing to share with others, can help a great deal. You may find people who are experts in different areas like renewable energy, clean energy, energy efficiency, and other fields, who would gladly welcome the chance to pass that knowledge on to others. Mentorship can make them feel good and improve productivity and confidence among those learning new skills.<\/p>\n\n\n\n<p>It is always advisable not to limit people to skills directly related to work, either. Someone among the team may be great at playing musical instruments or a certain sport and can teach a few interested people. This could make a difference in somebody&#8217;s life.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">2. <strong>Constantly Checking that everyone stays on track<\/strong><\/h4>\n\n\n\n<p>Most companies create strategic plans which comprise their annual performance goals at the beginning of the year. Due to the effects of the Covid-19,&nbsp; some companies were not able to revisit these goals during the first half of the year.<\/p>\n\n\n\n<p>As things normalize, it is important to revisit these goals and create a catch-up plan so as not to lose focus. Plan a strategy meeting at least once every month to ensure things remain on track.<\/p>\n\n\n\n<p>It would be wise for team members to schedule a brief weekly meeting or every fortnight to review their progress or they can create a buddy system within their organization where 2 colleagues can constantly follow up with each other&#8217;s progress to ensure they remain in line with the set goals.<\/p>\n\n\n\n<p>Should a&nbsp; team member realize that he\/she is not executing tasks that are critical to their career growth, It is advisable to sit down with their supervisor to see if there&#8217;s a need to adjust some goals, or deliberate on other solutions.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">3. <strong>Nurturing the skill of problem &#8211; solving<\/strong><\/h4>\n\n\n\n<p>No one likes people who complain and no one wants to be known as a person who complains all the time. You will be more respected and feel more empowered if you can suggest a few ways to solve problems that are frustrating you and your team members.<\/p>\n\n\n\n<p>As a professional and a team member, whenever there is a problem, try approaching your supervisor or manager with the problem and a proposed solution. This makes it easier for all of you and helps make the decision-making process so much easier. You also get to earn yourself respect amongst your peers and feel empowered for being a problem solver.<\/p>\n\n\n\n<p>It is also important for team members to feel that they are a part of the team and that their opinion is needed and appreciated. This helps boost their morale and confidence as well as encouraging a positive attitude towards their work and their superiors.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">4. <strong>Becoming the brand<\/strong><\/h4>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" width=\"552\" height=\"368\" data-src=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2020\/07\/image.png\" alt=\"\" class=\"wp-image-2686 lazyload\" data-srcset=\"https:\/\/energyzedworld.com\/wp-content\/uploads\/2020\/07\/image.png 552w, https:\/\/energyzedworld.com\/wp-content\/uploads\/2020\/07\/image-300x200.png 300w\" data-sizes=\"(max-width: 552px) 100vw, 552px\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 552px; --smush-placeholder-aspect-ratio: 552\/368;\" \/><\/figure>\n\n\n\n<p>Companies invest a lot of resources and time into building a strong brand. Employees need to realize that they represent their company&#8217;s brand whenever they are in public.<\/p>\n\n\n\n<p>It is therefore good to be the best version of yourself whenever you are attending a conference, a social event, an association meeting, or even a trade show or a business dinner. Always keep it in mind that you are representing both yourself and your company and you ought to do it in the best way possible.<\/p>\n\n\n\n<p>Do not forget that your presence on social media also speaks volumes about you and the brand you represent. Try sharing your expertise on LinkedIn, speak to business groups about your company&#8217;s products and services, and maintain your professional reputation every time you are on social media.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">5. <strong>Ever heard people say that you should work smarter and not harder?<\/strong><\/h4>\n\n\n\n<p>Most companies have invested in systems that ensure efficiency at work. For instance, we have systems like ASANA that help teams work together on a task and send reminders when a task is due, we have Hootsuite for social media activities, Calendars, and many other systems depending on what the business does.<\/p>\n\n\n\n<p>All these systems are meant to ensure efficiency at the workplace and to help track the set goals properly. It is therefore beneficial to embrace and learn to use them as best as we can because they make our work easier and manageable.<\/p>\n\n\n\n<p>Employees are encouraged to give suggestions or ideas that can help run things smoothly or make things easier for the team.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" width=\"710\" height=\"480\" data-src=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2020\/07\/kipchoge.jpg\" alt=\"\" class=\"wp-image-2685 lazyload\" data-srcset=\"https:\/\/energyzedworld.com\/wp-content\/uploads\/2020\/07\/kipchoge.jpg 710w, https:\/\/energyzedworld.com\/wp-content\/uploads\/2020\/07\/kipchoge-300x203.jpg 300w\" data-sizes=\"(max-width: 710px) 100vw, 710px\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 710px; --smush-placeholder-aspect-ratio: 710\/480;\" \/><\/figure>\n\n\n\n<p>It is said that no one can go back and make a brand new start but anyone can start from now and make a brand new ending.&nbsp; Let us all put our best foot forward and make the best of this year. Or at least the remaining part of this year.<\/p>\n<div class=\"energ-after-content\" id=\"energ-1311599947\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Karen Thuranira At every onset of a new year, most people set resolutions, and energy professionals are not an exception. For many, these goals involve improving their personal lives and are mostly centered on improving their health and wealth.&nbsp; But, have you ever considered how much time you spend on your career? Do you [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2684,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"5 WAYS ENERGY PROFESSIONALS CAN CHAMPION THEIR CAREER GROWTH ","_seopress_titles_desc":"Engaging in growth and development activities is critical to ensuring that you remain competent and grow your career in the energy industry","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-2682","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2682","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=2682"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2682\/revisions"}],"predecessor-version":[{"id":2687,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2682\/revisions\/2687"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/2684"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=2682"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=2682"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=2682"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}