{"id":2773,"date":"2020-08-11T10:58:43","date_gmt":"2020-08-11T10:58:43","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=2773"},"modified":"2020-08-11T10:58:44","modified_gmt":"2020-08-11T10:58:44","slug":"an-energy-engineers-take-on-the-power-of-vulnerability-by-brene-brown","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/an-energy-engineers-take-on-the-power-of-vulnerability-by-brene-brown\/","title":{"rendered":"AN ENERGY ENGINEER&#8217;S  TAKE ON The POWER OF VULNERABILITY BY Brené Brown"},"content":{"rendered":"\n<p>By Martin Ochieng<\/p>\n\n\n\n<p>The energy space is a unique one by all definitions of the term. This space is one of the very few professional occupations where the professional in question has to sell an element of faith to the client. The profession requires engineers to adequately communicate the potential of their recommendations in a way that bridges the gap between the “absolutely technical” and the “oversimplified.” This is no small fete and as such requires an element of vulnerability on the engineer’s part. I know, sounds a little far-fetched, but let me explain.<\/p>\n\n\n\n<p>The potential client’s perception of what energy engineers do is varied across the board on the get-go and includes a few inaccuracies. Most clients think of us as maintenance personnel. Spoiler alert, we are not. Others think of us as representatives of the regulator. Well, we kind of are, but it’s not that simple. What most perceptions have in common is that we are seen as “magical creatures” who can lower your bills. I’d like to think that is true, but again, it’s not that simple.<\/p>\n\n\n\n<p>The rather obscured reality between who energy engineers are and what society thinks of them draws us closer to why vulnerability is crucial to this field. Whenever an energy engineer submits a report, calculates potential savings, or costs an installation, the engineer puts his or her name on a document containing a promise of savings and trusts that the training and experience gathered over time is enough to predict an eventuality of reduced costs. We open ourselves up to criticism through all we do. This needs a great deal of vulnerability. The right kind that allows us to open up and make promises based on training and trust that the client will follow the steps laid out and achieve the predicted savings.<\/p>\n\n\n\n<p>This assertion is especially true considering the wide variety of professionals energy engineers encounter. These professionals work with Engineers potentially more experienced in their respective fields than they are, accountants with years of expertise under their belts, and executives who have earned their place in the professional world. Each job means these engineers have to relearn multiple disciplines fast to apply their expertise for potential savings. As such, energy engineers have to be willing to make mistakes and learn from professionals in their respective fields. This field is one of the very few where engineers have to be willing to learn from the client’s expertise which requires a lot of humility and vulnerability.<\/p>\n\n\n\n<p>However, the level of trust meted out by clients on energy engineers is astonishing. The experience I have gathered shows that because energy engineers are willing to be vulnerable, most clients attach a level of trust not common to similar fields considering the nature of professional energy management. As such I find vulnerability crucial as it helps energy engineers learn, grow, and be confident enough to provide depictions of what is possible in energy management.<\/p>\n\n\n\n<p>To get more insights into what vulnerability means for professionals in the energy space both work-related and in their personal lives, I asked members of the <a rel=\"noreferrer noopener\" href=\"http:\/\/eenovators.com\" target=\"_blank\">Eenovators LTD<\/a> staff to watch a <strong>TED<\/strong> talk on <a rel=\"noreferrer noopener\" href=\"https:\/\/www.youtube.com\/watch?v=iCvmsMzlF7o&amp;t=552s\" target=\"_blank\">The Power of Vulnerability <\/a>by Brené Brown. I then asked them to share their thoughts on the topic cutting across the professional space into personal implications. Here are some of their responses.<\/p>\n\n\n\n<p>My biggest take-home from the Brene Brown TED Talk on the Power of Vulnerability has been the 3C’s. There were tons of taking homes and I totally enjoyed every moment of the 20min with each concept speaking to me, but this one spoke to me the loudest. That people who have a strong sense of love and belonging and a sense of worthiness are Whole Hearted people who truly believe that they are worthy of love and belonging. I pondered over that for a moment and got a strong conviction that I want that! <\/p>\n\n\n\n<p>That I want that for myself and my life! That I want to be wholehearted! This new concept\/addition to my vocabulary has stuck with me. I have found that this is something I want to aspire to. I want to grab a hold of. I want to be wholehearted, I want for my children to be wholehearted too. I want them to have the 3 C’s – to have the courage to be imperfect, the Compassion to be kind to themselves first then to others and to have real Connection in life as a result of authenticity and living authentic lives. To have comfort in their discomfort. And the way to have them have that is to raise them like that. And for me to raise them like that I need to be like that, because I cannot give what I do not have. And so from now until year-end, I am revising my goals and re-prioritizing to have Whole Heartedness driven by the 3C’s right at the top of my list!<\/p>\n\n\n\n<p>Be myself. I should not try to be like others, copy or imitate others as this will subject me to vulnerability. I have found myself in such a situation before and it didn&#8217;t work well. But in our everyday people we try to copy\/imitate people whom we think are doing very well, and since we are unique in our own way and can never be like them; we soon get exhausted and frustrated, and vulnerability comes in.<\/p>\n\n\n\n<p>Everyone is vulnerable-It how we treat this vulnerability that will determine if we shall reap positive or negative results. And that&#8217;s what makes the difference between those who have a high self-esteem and those who have low self-esteem. I am now working to embrace the positive side of vulnerability<\/p>\n\n\n\n<p>Having watched the video, I learnt connection with other people is very important and that with shame and fear, that we feel sometimes brings about disconnection and that we should be willing to do something regardless of the outcome. As an individual, I have let go of great opportunities because of feeling that “I am not good enough” and from this video henceforth, I learnt that I am enough and I can do anything with just some courage, becoming open-minded and accepting that I am vulnerable just like everyone else.<\/p>\n\n\n\n<p>I first encountered Brene Brown when a friend was talking about her book on shame. I was curious to hear about someone who had broken down the emotion we all try and hide. Her Ted Talk on Vulnerability was profound for me because it gave me the antidote to shame. What stood out for me from the talk was that you cannot numb the negative emotions of shame and fear that come with vulnerability and experience joy, love and belonging. They come as a package. As we all strive to become wholehearted people, we must be willing to be vulnerable, embracing both sides of what it brings.<\/p>\n<div class=\"energ-after-content\" id=\"energ-2612401080\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Martin Ochieng The energy space is a unique one by all definitions of the term. This space is one of the very few professional occupations where the professional in question has to sell an element of faith to the client. The profession requires engineers to adequately communicate the potential of their recommendations in a [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2775,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"AN ENERGY ENGINEER&#039;S  TAKE ON THE POWER OF VULNERABILITY BY BRENÉ BROWN","_seopress_titles_desc":"The experience I have gathered shows that because energy engineers are willing to be vulnerable, most clients attach a level of trust ","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-2773","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2773","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=2773"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2773\/revisions"}],"predecessor-version":[{"id":2776,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2773\/revisions\/2776"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/2775"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=2773"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=2773"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=2773"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}