{"id":282,"date":"2019-02-16T06:21:22","date_gmt":"2019-02-16T06:21:22","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=282"},"modified":"2020-01-13T12:34:03","modified_gmt":"2020-01-13T12:34:03","slug":"why-every-clean-mind-thinks-green-energy","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/why-every-clean-mind-thinks-green-energy\/","title":{"rendered":"Why Every Clean Mind Thinks Green Energy"},"content":{"rendered":"\n<p>By Ombajo Vincent Gedion <\/p>\n\n\n\n<p>Clean energy is all the world is about today. Yet there is little information on what it is all about. And for many who surely have little or no information, are also seemingly unsure of its worth. <\/p>\n\n\n\n<p>The real problem is that we have pigeonholed clean energy, thus narrowing our perspective of its potential. Individuals, governments and even businesses unknowingly shrink the potential of clean energy. <\/p>\n\n\n\n<p>Yet, green energy encompasses our entire spheres of life from economics, social, environmental and health dimensions. Today, with continued global appreciation of its actual potential, clean energy is growing tremendously. <\/p>\n\n\n\n<p>It would be interesting to see how life turns out in the next couple of years. As a matter of certainty, I can safely predict that clean energy will be the foremost driver of the global economy in the next decade. A time is coming when all policies concerning growth and development will be punctuated by directed efforts at adopting green energy. But why is there all this craze about renewable energy?<\/p>\n\n\n\n<p>There exists multiple benefits of green energy. It is clear that green energy impacts the demand for and supply of conventional energy which then translate to positive effects on energy systems, the economy, and the environment. <\/p>\n\n\n\n<p>The foundation of benefits of clean energy lies in energy savings and the generation of clean energy. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\">What is key to remember is that green energy initiatives moderate energy consumption from fossil fuel generation in two major ways;<\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>Clean energy resources increase the amount of energy from green sources as opposed to conventional sources. Clean energy sources are also more efficient in their energy generation.<\/li><\/ul>\n\n\n\n<ul class=\"wp-block-list\"><li>Programs, directed initiatives and target policies of energy efficiency result in direct reductions in consumption of energy. This in turn reduces the need to generate more energy. And if the generation were to be from fossil fuels, it would be minimized, hence low carbon emission into the atmosphere.<\/li><\/ul>\n\n\n\n<p>When it comes to energy and its usage, there are two sides of a coin; the demand and the supply side. There are initiatives on both sides that are aimed at promoting clean energy. <\/p>\n\n\n\n<p>The initiatives on the demand side target consumption and energy efficiency measures are emphasized. On the supply side, initiatives here target generation. Emphasis here is placed on the generation mix of energy supply resources with most being clean.<\/p>\n\n\n\n<p>So most governments and organization are running to green energy because it is a both a money saver, a money maker and in addition, clean energy sustains finances involved in it. <\/p>\n\n\n\n<p>Essentially, it pays back itself. No money is lost. And during these tough economic times, common sense dictates that clean energy is a better bet for investment not just for financial sense, but for sustainability purposes.<\/p>\n\n\n\n<p>When the two principles discussed above are jointly championed, positive effects are seen in all sectors of economy. Happiness index could even go up when both governments and individuals are to spend less on essentials like energy.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2013\/08\/waterfall1.jpg\"><img decoding=\"async\" data-src=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2013\/08\/waterfall1-300x177.jpg\" alt=\"Hydropower in kenya\" class=\"wp-image-71 lazyload\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 300px; --smush-placeholder-aspect-ratio: 300\/177;\" \/><\/a><\/figure>\n\n\n\n<p>The core principle behind realizing these benefits is built upon using the available energy efficiently, while generating clean energy from clean energy resources. <\/p>\n\n\n\n<p>The overall effect is that consumers use less and pay even much less for energy and suppliers generate less clean power, and at a lower cost. Money sense…therefore, over an extended period of time is the foremost driver of clean energy.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignleft\"><a href=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2015\/12\/Diff.jpg\"><img decoding=\"async\" data-src=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2015\/12\/Diff.jpg\" alt=\"Diff\" class=\"wp-image-275 lazyload\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" \/><\/a><\/figure><\/div>\n\n\n\n<p>Another key driver of clean energy is climate change. We are living in a different generation, where social and environment responsibility is almost a collective form of global self-actualization. It is almost ‘fashionable’ to be green. Sustainability is what drives business and no one wants the earth to perish. Clean energy use reduces climate change because carbon dioxide emissions are reduced by significant levels. What that presents is a healthy planet for the continued peaceful coexistence of all humanity.<\/p>\n\n\n\n<p>So the next time you see huge wind turbines and large solar panels next to your home, don’t scratch your head so much…those are the motivations behind such investments. Sometimes time chooses on things while at times, things choose on time. For clean energy, it’s a remarkable coincidence. Time has chosen on it just as people and things have.<\/p>\n<div class=\"energ-after-content\" id=\"energ-851793993\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Ombajo Vincent Gedion Clean energy is all the world is about today. Yet there is little information on what it is all about. And for many who surely have little or no information, are also seemingly unsure of its worth. The real problem is that we have pigeonholed clean energy, thus narrowing our perspective [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":651,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-282","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/282","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=282"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/282\/revisions"}],"predecessor-version":[{"id":1424,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/282\/revisions\/1424"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/651"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=282"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=282"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=282"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}