{"id":286,"date":"2016-05-22T11:38:10","date_gmt":"2016-05-22T11:38:10","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=286"},"modified":"2020-01-13T12:48:03","modified_gmt":"2020-01-13T12:48:03","slug":"kenya-shopping-malls-and-energy-efficiency","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/kenya-shopping-malls-and-energy-efficiency\/","title":{"rendered":"Kenya, Shopping Malls and Energy Efficiency"},"content":{"rendered":"\n<p>By Ombajo Vincent Gedion<\/p>\n\n\n\n<p>No nation in Africa has seen the kind of growth that Kenya has experienced over the last decade. Undoubtedly, the Silicon Savannah, now the known name of Kenya, is headed for even better horizons. Being a hotbed of innovation and entrepreneurial spirit, the growth of the Kenyan middle class has been realized at a somewhat tremendous speed. <\/p>\n\n\n\n<p>The sole evidence for this enormous growth can be seen through the eyes of the several shopping malls setting base in Kenya. Shopping malls, also known as cathedrals of consumption or Meccas of shoppers are not just a preserve of the capital, Nairobi. Every notable city in Kenya today boasts of a shopping mall or a large retailer shop. And seemingly, escalators and large spaces seem to be the mark of prestige, and a signature of sophistication, as seen by Kenyans.<\/p>\n\n\n\n<p>However, there is one aspect in all these growth syndrome that seems to go unnoticed. It is actually the elephant in the room, Energy. Have you ever wondered how much energy is consumed daily by these malls? How much energy could possibly be in use for the malls to have such never failing beautiful lighting? And how much power goes into ensuring that ventilation is top-notch for the thousands of shoppers in these malls? How much water is consumed annually and how is it used?<\/p>\n\n\n\n<p>Now that attention has shifted, ready yourself for good news and possible remedies. Energy efficiency is the alpha and omega that punctuates all these raised concerns. Having energy efficiency as a core operating policy in these malls has the potential of reducing the cost of power by huge margins. Implementing conservation measures in malls is a pretty complicated process mainly because these malls are not just expansive in size, but also comprises of tens or hundreds of enterprises. From stores, gyms, offices, restaurants to retail outlets, amusement parks, hospitals, banks and so on.<\/p>\n\n\n\n<p>So many elements consume energy in a mall setting. Most malls are not heated conventionally, but by electric lights, skylights and of course the body heat of the thousands of shoppers that frequent the malls. This calls for a working air conditioning system that has to be efficient in order to use less energy. Ventilation is also another key concern that addressing needs more usage of energy. Lighting of the entire malls consume so much energy that if energy efficiency measures are not instituted, a lot of costs can be incurred in the power bills.<\/p>\n\n\n\n<p>For a very long time, and in numerous cases, energy conservation was largely viewed as a penalty, an unwelcome cost, a cutting-back, a lessening of living standards, a practice of self-denial. In the 21st century, this view has drastically changed due to the increased cost of energy that has resulted from a higher global energy demand. Today, and to most people, energy efficiency has been transformed into the “fifth fuel”. This is after coal, petroleum, nuclear power and renewables such as solar and wind. Energy efficiency has also easily become a significant way of addressing environmental concerns like climate change.<\/p>\n\n\n\n<p>While still on renewables, it is worth noting that investing in solar energy is the wisest thing that malls could do to radically reduce their energy costs. Because malls have a large roofing area, solar panels could be mounted and power from the sun harnessed forthwith. Space not being a problem, money should not be a hindrance because solar eventually pays back for its initial capital outlay and the maintenance costs are shockingly meagre. One outstanding fact is that unlike solar panels that escalate energy supply while replacing the dirtier energy, energy conservation reduces energy demand.<\/p>\n\n\n\n<p>Some of the energy efficiency measures that can realize cost reduction include using LED technology for lighting. Investing in lighting controls like occupancy sensors and daylight harvesters will go a long way in reducing energy consumed by lights. Skylights will reduce power usage during the day. On the roof of the stores, they can be intentionally painted white to reduce heating of stored products and goods. This reduces the cooling and air conditioning load. <\/p>\n\n\n\n<p>Efficient air filters that are thinner and lighter will work best because less energy is used in running them, thanks to their minimal weight. Water as an essential resource can be used more efficiently through low-flush toilets. Malls can also have their own water recycling system because a lot of water is consumed by the shoppers and it should not go to complete waste.<\/p>\n\n\n\n<p>Energy efficiency in the malls will present financial incentives to mall owners in terms of cost reduction. Every tenant in a mall should also have their own metering system to elevate energy saving to individual responsibility. Eventually low costs trickle down to consumers, business booms as profits swell, while the environment is saved. Energy efficiency should be seen as an essential business strategy in the 21st century.<\/p>\n<div class=\"energ-after-content\" id=\"energ-2831699191\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Ombajo Vincent Gedion No nation in Africa has seen the kind of growth that Kenya has experienced over the last decade. Undoubtedly, the Silicon Savannah, now the known name of Kenya, is headed for even better horizons. Being a hotbed of innovation and entrepreneurial spirit, the growth of the Kenyan middle class has been [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":649,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-286","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/286","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=286"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/286\/revisions"}],"predecessor-version":[{"id":1488,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/286\/revisions\/1488"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/649"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=286"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=286"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=286"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}