{"id":2860,"date":"2020-09-09T07:00:01","date_gmt":"2020-09-09T07:00:01","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=2860"},"modified":"2020-09-09T07:00:03","modified_gmt":"2020-09-09T07:00:03","slug":"measures-for-green-recovery-in-africa","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/measures-for-green-recovery-in-africa\/","title":{"rendered":"MEASURES FOR GREEN RECOVERY IN AFRICA"},"content":{"rendered":"\n<p>By Linet Njeri<\/p>\n\n\n\n<p>I first heard of the term green recovery during one of the World Energy Day Round tables on Energy Efficiency and Renewable Energy Optimization. It was mentioned by one of the speakers, Lisa Reynolds, the CEO of Green Buildings and Design Group based in South Africa. She described green recovery as the term coined to describe the process of having sustainability as part of the successful ramping up of the economy post-Corona virus. Many have seen Corona virus as a way of the planet saying ‘enough with the pollution humans, let’s take a break’. Research has shown that there was a significant reduction in global emissions following the lockdowns that were instituted around the world to mitigate the spread of the virus. This is because most emissions from the transportation industry including motor vehicles and airplanes were at a standstill. Additionally, the stay at home measures taken in many countries led to the reduction of energy use in offices and industries due to reduced production.<\/p>\n\n\n\n<p>Recovery of the economy post-Covid-19 has been seen as a chance to restart in a way that favors the environment and planet as a whole to ensure the reduction of global emissions through the adoption of green practices. Although Covid-19 has been the focus of many governments over the last 8 months, climate change has still been causing havoc and in some cases leading to more deaths than those from Covid-19. For instance, in Kenya, the country has been experiencing floods and mudslides for most part of the year that has led to the death of over 500 people and the displacement of thousands of people. This means that governments and the world still needs to focus on reduction of carbon emissions so as to curb global warming and its effects. A focus on green recovery is the first step.<\/p>\n\n\n\n<p>Some of the measures by organizations and governments and that can be taken for a green recovery include:<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Government Policy&nbsp;<\/strong><\/h4>\n\n\n\n<p>As governments plan for medium and long term economic recovery measures, it is important the plans include green recovery measures such a climate stimulus fund, that can be used to encourage organizations to adopt greener measures as they get back to business as usual. Governments can create policies to encourage green recovery by aligning their economic stimulus programmes to climate objectives and the SDGs. In Africa, the African Union is encouraging countries to consider clean energy access for all as they plan recovery measures post-Covid-19.&nbsp;<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Green workplaces<\/strong><\/h4>\n\n\n\n<p>As the Coronavirus cases continue to go down around the world, many organizations are making plans to get their employees back to working from offices. Covid-19 has challenged the way we view workplaces and has increased the need to redesign spaces to ensure social distancing. This provides organizations with an opportunity to incorporate green practices as they redesign their workplaces. Some of the changes that can be made include adding the number of windows to provide for more natural lighting and thus reduce energy use, painting office spaces with bright colors that reflect daylight thus reducing the need for overhead lighting, installing solar powered equipment and incorporating green policies into the workplace culture.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Energy Efficiency<\/strong><\/h4>\n\n\n\n<p>As businesses look to reduce their costs in the journey to recovery, energy efficiency and management provides opportunities for such reductions. It is important that organizations adopt energy efficiency measures before moving to the implementation of renewable energy projects. In industrial settings, data shows that heat accounts for 50% of energy needs and electricity only 20%. There is need for clean, reliable industrial heating needs, steam production and thermal comfort among other heating needs to be met so as to reduce energy usage in industries.&nbsp;<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Renewable Energy<\/strong><\/h4>\n\n\n\n<p>Green recovery will rely heavily on the adoption of renewable energy sources and the shift from overreliance on fossil fuels. The Covid-19 pandemic was a huge eye opener for some industries such as the oil industry. For instance, during the peak of the pandemic, crude oil prices dropped to $0 as a result of grounding of most transportation, leading to massive losses. This has led many oil companies to announce their plans to have zero carbon emissions by 2050 and to switch to production to renewable sources of energy. This is a clear sign that the time is now for organizations and industries to get onto the renewable energy bandwagon.&nbsp;<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Transport<\/strong><\/h4>\n\n\n\n<p>Following the recent ‘collapse’ of the oil industry and the statistics showing the reduction of carbon emissions as a result of the decreased of transportation around the world, there is an emerging interest in e-mobility as the next transport frontier. In Africa, many young people are getting an understanding of climate change and the role that transportation plays in carbon emissions. They are therefore choosing to go for hybrid vehicles even as the infrastructure for electric cars is beginning to emerge in the continent. In addition, as countries consider a green recovery, it is important that measures such as shared transportation systems as well as the efficiency of public transportation are looked into to encourage more users and therefore less emissions.<\/p>\n\n\n\n<p>In conclusion, a green recovery in Africa will rely on the collaboration of both the government and the private sector. The government can play a huge role in developing policies to support the adoption of green measures as well as providing a financial stimulus to encourage more organizations to adopt these green policies. Organizations on the other hand can adopt green workplaces, energy efficiency and renewable energy measures to begin the walk towards a green recovery. Is a green recovery possible in Africa? Yes we can!<\/p>\n<div class=\"energ-after-content\" id=\"energ-2410721633\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Linet Njeri I first heard of the term green recovery during one of the World Energy Day Round tables on Energy Efficiency and Renewable Energy Optimization. It was mentioned by one of the speakers, Lisa Reynolds, the CEO of Green Buildings and Design Group based in South Africa. She described green recovery as the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2862,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"MEASURES FOR GREEN RECOVERY IN AFRICA","_seopress_titles_desc":"Green recovery is the term coined to describe the process of having sustainability as part of the successful ramping up of the economy post-Corona virus","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-2860","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2860","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=2860"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2860\/revisions"}],"predecessor-version":[{"id":2863,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2860\/revisions\/2863"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/2862"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=2860"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=2860"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=2860"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}