{"id":2873,"date":"2020-10-12T13:39:35","date_gmt":"2020-10-12T13:39:35","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=2873"},"modified":"2020-10-12T13:39:36","modified_gmt":"2020-10-12T13:39:36","slug":"energyzing-the-internal-customer-three-lessons-from-jerusalema-challenge","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-industry-news\/energyzing-the-internal-customer-three-lessons-from-jerusalema-challenge\/","title":{"rendered":"ENERGYZING THE INTERNAL CUSTOMER – THREE LESSONS FROM JERUSALEMA CHALLENGE"},"content":{"rendered":"\n<p>By Carolyne Gathuru<\/p>\n\n\n\n<p>The world continues to be taken by storm by the <a rel=\"noreferrer noopener\" href=\"https:\/\/www.youtube.com\/watch?v=QcLvdg-wr6k\" target=\"_blank\">#JerusalemaChallenge<\/a>, that has served to transcend borders and boundaries globally, with uploads from people of all walks of life taking on the new craze. Eenovators was not left out of it and in the spirit of celebrating Customer Service Week 2020 &#8211;  that globally revolved around the theme of having a #DreamTeam, and locally was anchored on the theme of #ChampioningCustomerConvenience &#8211; purposed to join the bandwagon and attempt the dance. As part of the agenda for the quarter’s strategy review meeting – a quarterly engagement to review the company’s performance against strategy – the <a href=\"https:\/\/www.youtube.com\/watch?v=QcLvdg-wr6k\" target=\"_blank\" rel=\"noreferrer noopener\">#JerusalemaChallenge<\/a> was formally entered into the agenda and team members encouraged to participate. On the material day, the workshop moderator created high anticipation about this specific agenda item. In the afternoon after a heavy brainstorm and review session, she ushered the team out into the grassy lawn at the facility where the workshop was being held, requested the communications officer to set up the video recording equipment, and declared that it was time to deliver on the objective. It would at this point be important to update that indeed the dance was delivered, amidst fun, merriment and other delightful emotions, and that in the space of all this internal customer engagement, that lessons actually emerged. <\/p>\n\n\n\n<p>So what were the observations based on the teams’ behavior and conversations during the dance?<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">1. <strong>Planning is King<\/strong><\/h4>\n\n\n\n<p>Ahead of the workshop date, some of the younger and savvier team members had sent tutorials of the dance on the company WhatsApp group encouraging members to look through them with a view to catching up with the dance moves. And indeed on the material date, it was these younger and more savvy members that were placed at the front row as they had taken the time to review the dance moves and had mastered the steps. It was as a result of these three members, that the rest of the team managed to observe and catch up with what was needed for success, albeit on the material date itself. The very cliché saying that failing to plan is planning to fail is still as fresh now as it was when it was first coined, and planning for even what may seem mundane or run of the mill, is what delivers great results. This lesson will continue to be applied in the company for successful customer and project outcomes.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">2. <strong>Teamwork Reigns<\/strong><\/h4>\n\n\n\n<p>In order to pull off the <a href=\"https:\/\/www.youtube.com\/watch?v=QcLvdg-wr6k\" target=\"_blank\" rel=\"noreferrer noopener\">#JerusalemaChallenge <\/a>with some level of success, required significant teamwork. The Eenovators team has an intergenerational mix with members ranging from being in their 60’s ( the Baby Boomers) to members in their 20’s ( Gen Z’ers) and the team came together to give the challenge their best shot. Different roles were assigned to the members including a cheering and encouraging squad as well as the dance frontliners and back benchers. After about three or so attempts, there was some semblance of order, and the challenge output began to take shape. There were two members in the role of ‘instructors’ who helped by counting the steps to enable the rest follow, and yet another member doing the demos for observation. The dance finally came together beautifully. The other cliché saying that teamwork is what makes the dream work is still also as fresh now as it was whenever it was first coined, and it is important to encourage great teamwork always. <\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" width=\"1024\" height=\"683\" data-src=\"https:\/\/energyzedworld.com\/wp-content\/uploads\/2020\/10\/121458648_3624133647630616_4013832678530632600_o-1024x683.jpg\" alt=\"\" class=\"wp-image-2876 lazyload\" data-srcset=\"https:\/\/energyzedworld.com\/wp-content\/uploads\/2020\/10\/121458648_3624133647630616_4013832678530632600_o-980x653.jpg 980w, https:\/\/energyzedworld.com\/wp-content\/uploads\/2020\/10\/121458648_3624133647630616_4013832678530632600_o-480x320.jpg 480w\" data-sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) and (max-width: 980px) 980px, (min-width: 981px) 1024px, 100vw\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 1024px; --smush-placeholder-aspect-ratio: 1024\/683;\" \/><\/figure>\n\n\n\n<h4 class=\"wp-block-heading\">3. <strong>Attitude Conquers <\/strong><\/h4>\n\n\n\n<p>With a well balanced mix of both introverts and extroverts in equal measure, it was the great attitude that carried the day including: the willingness to try and join in despite this dance challenge being out of members’ comfort zones; the never-give-up attitude that members displayed, trying a couple of times to get things right and move to the beat; the encouragement from the members who were quicker at picking up the pace to those who were struggling a bit more; the applause when the team managed to get into the swing of things and deliver a synchronized dance round; and finally being the most important was the cheerful and heartfelt celebration on the achievement. It is very important as a team to celebrate wins and to have a spirit of encouragement and affirmation that edifies team members. The saying about hiring for attitude and training for skill is just as well relevant now as it has ever been, because it is having a great attitude that carries teams through thick and this culture needs to be maintained.<\/p>\n\n\n\n<p>The <a href=\"https:\/\/www.youtube.com\/watch?v=QcLvdg-wr6k\" target=\"_blank\" rel=\"noreferrer noopener\">#JerusalemaChallenge <\/a>in the corporate space has received mixed feelings with some negative comments seeping through about team members getting coerced into performing the routinized dance to tick a box or for ‘PR’ purposes. Ultimately what matters is not really the activity at hand – because this time it is the <a href=\"https:\/\/www.youtube.com\/watch?v=QcLvdg-wr6k\" target=\"_blank\" rel=\"noreferrer noopener\">#JerusalemaChallenge<\/a> and next time it will be something else – but the culture at the particular workplace and what it portends when members are called upon to take part in corporate activities. With the above key tenets on good planning, great teamwork and fantastic attitude, anything is possible. Including pulling off a <a href=\"#JerusalemaChallenge\">#<\/a><a href=\"https:\/\/www.youtube.com\/watch?v=QcLvdg-wr6k\" target=\"_blank\" rel=\"noreferrer noopener\">JerusalemaChallenge <\/a>with a mixed team at different levels. An energized internal customer leads to better communication, internal excellence and ultimately good external delivery, which is the objective of all brands.  This is a call for those groups that have not as yet thrown their hat in the ring and attempted the <a href=\"https:\/\/www.youtube.com\/watch?v=QcLvdg-wr6k\" target=\"_blank\" rel=\"noreferrer noopener\">#JerusalemaChallenge<\/a>, to do so and share with us the results. At Eenovators, we’re still buzzing from it and we anticipate that the buzz will carry for quite a while.<\/p>\n<div class=\"energ-after-content\" id=\"energ-723602048\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Carolyne Gathuru The world continues to be taken by storm by the #JerusalemaChallenge, that has served to transcend borders and boundaries globally, with uploads from people of all walks of life taking on the new craze. Eenovators was not left out of it and in the spirit of celebrating Customer Service Week 2020 &#8211;  [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2875,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"ENERGYZING THE INTERNAL CUSTOMER – THREE LESSONS FROM JERUSALEMA CHALLENGE","_seopress_titles_desc":"Eenovators was not left out of it and in the spirit of celebrating Customer Service Week 2020, purposed to join the bandwagon and attempt the dance. As part of the agenda for the quarter’s strategy review meeting","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,24],"tags":[],"class_list":["post-2873","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-energy-industry-news"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2873","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=2873"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2873\/revisions"}],"predecessor-version":[{"id":2877,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2873\/revisions\/2877"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/2875"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=2873"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=2873"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=2873"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}