{"id":2895,"date":"2020-12-04T06:02:40","date_gmt":"2020-12-04T06:02:40","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=2895"},"modified":"2020-12-04T06:13:22","modified_gmt":"2020-12-04T06:13:22","slug":"habits-and-energy-efficiency","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/habits-and-energy-efficiency\/","title":{"rendered":"HABITS AND ENERGY EFFICIENCY"},"content":{"rendered":"\n<div class=\"wp-block-image\"><figure class=\"alignleft size-large is-resized\"><img decoding=\"async\" data-src=\"https:\/\/energyzedworld.com\/wp-content\/uploads\/2020\/12\/WhatsApp-Image-2020-12-04-at-8.42.17-AM-775x1024.jpeg\" alt=\"\" class=\"wp-image-2899 lazyload\" width=\"132\" height=\"174\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 132px; --smush-placeholder-aspect-ratio: 132\/174;\" \/><\/figure><\/div>\n\n\n\n<p>By Eugene Omondi<\/p>\n\n\n\n<p>A recently developed habit of reading books and articles in psychology has put me in a frame of mind where I question a lot of things that we do. But having majored in environmental sciences, it seemed almost inevitable that I would wonder why as a generation we haven’t yet grasped the topic of sustainability. Especially when it comes to energy.<\/p>\n\n\n\n<p>Yes, we know about energy sustainability and yes, we read about it but its practicality is a no easy feat. Just like any other generation that have existed before us, we tend to think that we are doing better when we throw around the energy efficiency jargon but the truth is we aren’t.&nbsp;<\/p>\n\n\n\n<p>We really need to take a hard look at ourselves and dish out the reality-check that we so deserve.&nbsp;<\/p>\n\n\n\n<p>We are wasteful!!!<\/p>\n\n\n\n<p>That being said, as a part of this generation I wouldn’t want to only point fingers and throw shade. Instead, let me try to be a part of the solution by first analyzing why we do what we do. Why are we so inefficient in our energy consumption?&nbsp;<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Habits<\/strong><\/h4>\n\n\n\n<p>Reading through the Psych-Mechanics blog, I came across something interesting called TRR; that is Trigger, Routine and Reward. This is the mechanics of habit development. Basically, something stimulates us to act in a certain way to gain a certain reward.&nbsp;<\/p>\n\n\n\n<p>But how does this connect to energy efficiency?&nbsp; You ask.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Overconsumption<\/strong><\/h4>\n\n\n\n<p>The current global economic trend is being driven by a culture of high consumption and a subsequent high production levels. We are definitely not a conservative population. We don’t like being associated with “little”.&nbsp; We buy more than we need, but why?<\/p>\n\n\n\n<p>We binge watch all the thirteen episodes of “<em>For Life<\/em>” through the night whenever the words “tomorrow is a weekend” crosses our minds. I don’t understand what the exact reward is in this case apart from entertainment. Regardless, this is one of the ways that we unnecessarily consume electricity.<\/p>\n\n\n\n<p>Whenever we see a friend with a Toyota V8 we are triggered and boy the first thing we do is call our banker and demand financing for the same. This is the routine with this generation. The reward is a feeling of belonging. Feeling like a part of the “V8 engine” or “Subaru Forester” community. We then immediately dump our low fuel consuming car just for a feeling of belonging. The world and future generations be damned.&nbsp;<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Doing the right thing is lame<\/strong><\/h4>\n\n\n\n<p>Apparently we don’t draw any satisfaction from doing the right thing anymore. Okay this is from my own observation so I will graciously accept the weird looks coming my way. There seems to be a bystander effect when it comes to making decisions but this is not unique to this generation. So I won’t tie it down to us.<\/p>\n\n\n\n<p>However, human beings have for long shown to lack absolutes when it comes to most things we say or do. We speak and act in relative terms. We fail to engage in energy efficient behaviors simply because someone else is not doing it. We have a tendency to act in a manner similar to those around us.<\/p>\n\n\n\n<p>This behavior pattern determines whether we buy an energy efficient bulb or not. It determines the kind of car we drive. It helps us decide whether to buy solar panels or not. It also helps in developing a habit of switching off the refrigerator when it’s not in use or even the lights whenever we walk out of a room. If we do not draw any satisfaction from such simple acts then we cannot develop sustainable habits for energy conservation.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>What to do?<\/strong><\/h4>\n\n\n\n<p>It was a sad moment for me when during my research, I discovered that once a habit has been learnt it never goes away [I wish I had a sad face emoji for this part but I don’t so use your imagination].&nbsp;<\/p>\n\n\n\n<p>It turns out that the more we practice such unsustainable habits as the ones mentioned, we strengthen the neural pathways for these habits. The reverse is true for sustainable habits as well.<\/p>\n\n\n\n<p>So if it is true that any habit once learnt can’t be undone, we are then left with one option and that is to develop new habits.&nbsp; What I mean is whenever you are about to turn away from your energy efficient car or bulb, please create a habit of analyzing this decision. Write down the pros and cons. Through this newly developed habit you will most likely make the wise decisions.<\/p>\n\n\n\n<p>The trick is in developing new habits such as sleeping as early as we need and in the process turning off all electrical appliances and sockets that we do not need through the night. Moreover, developing a healthy lifestyle such as exercising can definitely deter us from staying up all night. You will be too tired to watch a whole TV series through the night.&nbsp;<\/p>\n\n\n\n<p>I hope this helps you stay healthy and develop good habits that are energy efficient.<\/p>\n<div class=\"energ-after-content\" id=\"energ-4037448441\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Eugene Omondi A recently developed habit of reading books and articles in psychology has put me in a frame of mind where I question a lot of things that we do. But having majored in environmental sciences, it seemed almost inevitable that I would wonder why as a generation we haven’t yet grasped the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2904,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"","_seopress_titles_desc":"This behavior pattern determines whether we buy an energy efficient bulb or not. It determines the kind of car we drive. It helps us decide whether to buy solar panels or not. It also helps in developing a habit of switching off the refrigerator when it’s not in use or even the lights whenever we walk out of a room","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-2895","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2895","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=2895"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2895\/revisions"}],"predecessor-version":[{"id":2902,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2895\/revisions\/2902"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/2904"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=2895"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=2895"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=2895"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}