{"id":2938,"date":"2020-12-14T08:37:12","date_gmt":"2020-12-14T08:37:12","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=2938"},"modified":"2020-12-14T10:50:21","modified_gmt":"2020-12-14T10:50:21","slug":"how-can-data-accelerate-sustainable-transport","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-financial-calculator\/how-can-data-accelerate-sustainable-transport\/","title":{"rendered":"How Can Data Accelerate Sustainable Transport?"},"content":{"rendered":"\n<p>By Liz Nekesa<\/p>\n\n\n\n<p>I sat through the first E-mobility conference in East Africa held in February where the goal of 500,000 EV’s by 2030 was set. The question ‘Is the region ready to bring forth this shift” lingered in my mind.<\/p>\n\n\n\n<p>The global increase in electric vehicles presents an exciting opportunity and benefits such as lower maintenance, lower energy costs, and environmental benefits in terms of improved air quality and reduced green-house emissions. Some of the developed countries have proposed the ambitious goal of a 2040 ban on convectional vehicles.<\/p>\n\n\n\n<p>The e-mobility revolution has definitely made its entry in Africa with a focus on fleet services, two and three wheeler as well<\/p>\n\n\n\n<p>Couple of months later I moderated a session in the <strong><a href=\"https:\/\/www.worldenergyday.net\/virtual-conference-report\/\" target=\"_blank\" rel=\"noreferrer noopener\">World Energy Day Conference<\/a><\/strong> focused on Sustainable Transport and I was exposed to futuristic Kenya.<\/p>\n\n\n\n<p>Imagine it’s another sunny day in Nairobi’s traffic jam but there are no fuel stops or engines revving as the matatu you are on is using a battery swap model approach as it mode of propulsion.<\/p>\n\n\n\n<p>Your grandmother back in rural country is irrigating her crops using a pump powered from a nearby solar powered charging station for the local electric tuk tuks.<\/p>\n\n\n\n<p>The nearby Nyama choma joint you go to serves as a charging station for your car.<\/p>\n\n\n\n<p>Is this a future worth hoping for? Is it a pipe dream? What role will data play in accelerating this uptake of green transport? Here are my two cents on why data will offer the necessary leap frog.<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li>The biggest barrier to EV adoption is the overall lack of awareness among citizens and misinformation. Aggressively sharing data on the economic and environmental benefits brought about by EV’s is a first step towards changing the narrative.<\/li><\/ul>\n\n\n\n<ul class=\"wp-block-list\"><li>Access to timely and reliable data on to energy consumption of homes could pave way for bundle energy products that integrate vehicle charging with energy consumption at home.<\/li><\/ul>\n\n\n\n<ul class=\"wp-block-list\"><li>A mismatch in demand and power generation in Kenya, has seen consumers bear high energy costs. Policy and technology should be wielded to rectify matching of demand and generation. EV’s could be the answer to driving up demand and reducing the existing gap between production and consumption. Data will play a key role in harmonizing the two.<\/li><\/ul>\n\n\n\n<ul class=\"wp-block-list\"><li>Charging infrastructure has previously been as a major obstacle but what is not widely known is that the e-mobility future has three key technology-driven disruptive trends: electrification of vehicles, connected &amp; autonomous vehicles and Mobility-as-a-Service. The solution of battery swapping for public and private sector is viable and will be dependent on routes and traffic data.<\/li><\/ul>\n\n\n\n<ul class=\"wp-block-list\"><li>EVs are an inherently flexible technology; able to store electricity, charge at periods of reduced demand on the network, and use stored energy during periods of significant increased demand on the network. However, two and three wheelers in rural set up drive up the uptake of sustainable transport, with the right data an integrated system can be developed to power up irrigation and water pumping unlocking new opportunities.<\/li><\/ul>\n\n\n\n<ul class=\"wp-block-list\"><li>Strong financial incentives for businesses and private citizens that adopt either plug in hybrid or half battery electric vehicles would be a catalyst to encourage sustainable transport and accelerate sales. All this will be anchored on data available.<\/li><\/ul>\n\n\n\n<p>There is no doubt that the transportation industry is changing and for Africa, there is a need to embrace an eco-system approach by integrating data, things and people so as to have e-mobility customized to our needs. Data shall be key in coordination of national initiatives to expand charging opportunities and prioritizing renewable energy to charge them.<\/p>\n<div class=\"energ-after-content\" id=\"energ-2988914376\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Liz Nekesa I sat through the first E-mobility conference in East Africa held in February where the goal of 500,000 EV’s by 2030 was set. The question ‘Is the region ready to bring forth this shift” lingered in my mind. The global increase in electric vehicles presents an exciting opportunity and benefits such as [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2940,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"How Can Data Accelerate Sustainable Transport?","_seopress_titles_desc":"The global increase in electric vehicles presents an exciting opportunity and benefits such as lower maintenance","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,197],"tags":[],"class_list":["post-2938","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-energy-financial-calculator"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2938","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=2938"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2938\/revisions"}],"predecessor-version":[{"id":2944,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2938\/revisions\/2944"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/2940"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=2938"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=2938"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=2938"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}