{"id":2972,"date":"2021-02-22T09:56:36","date_gmt":"2021-02-22T09:56:36","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=2972"},"modified":"2021-02-22T09:56:37","modified_gmt":"2021-02-22T09:56:37","slug":"how-the-month-of-love-2021-was-celebrated-eenovators-style","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/events\/how-the-month-of-love-2021-was-celebrated-eenovators-style\/","title":{"rendered":"HOW THE MONTH OF LOVE 2021 WAS CELEBRATED EENOVATORS STYLE"},"content":{"rendered":"\n<h4 class=\"wp-block-heading\">Anonymous Valentine Date<\/h4>\n\n\n\n<p>BY MONICA NGAGE<\/p>\n\n\n\n<p>Its valentines 2021 and Eenovators family is not left behind. A week to valentine’s day , our meeting chairperson led&nbsp; us in an activity which would lead us to expressing love and appreciating each other. You can bear me witness this came in handy as most of the times we never get to appreciate the good deeds that others do more so in a busy working environment. Names were put down on paper and we randomly &nbsp;picked up names of persons that we would write appreciation notes and buy gifts for. The beauty of it was that it was anonymous and you wouldn’t know who exactly bought you the gifts\/or wrote you the note; save for the guesses &amp; speculations. Despite the activity being exciting, it was not an easy process deciding on the gifts to buy. I conducted a short survey into the experience of each person based and this is what they had to say:<\/p>\n\n\n\n<p>Anonymous 1:<\/p>\n\n\n\n<p>This exercise to celebrate our internal customers has been very heartwarming. When requested to pick the anonymous names I ended up with someone I am not sure I know very well but felt optimistic that I would find something for them. I also was very curious as to who had picked my name. I struggled to think about an appropriate gift, but given that our team has generally young people, I felt I would not go wrong with a gift that appeals to those young at heart. The reaction of the person I gifted was one of gratitude and they indicated that they very much appreciated the gift and that it meant much to them. My gift that I was gifted by someone who I feel really found an appropriate and timely gift for me has made me extremely happy. This gift has come at a time when I was embarrassing myself with a very old item that needed replacement and the gift has been just the perfect replacement. How awesome is that? I have started using it immediately. We are thankful for the organizer of this exercise, it has served to lift our spirits and our togetherness.<\/p>\n\n\n\n<p>Anonymous 2:<\/p>\n\n\n\n<p>I felt much joy when I picked up my valentine but immediately wondered what I would get the person. However, in selecting the gift, a lot came into play like trying to figure what the best would fit the other person without asking them. I was unable to decide on the gift there and then and I had a change of mind severally. It was very hard though, to come up with the gift. On my part when I received the gift, I immediately tried to figure out who it was and&nbsp;was touched at how well they captured my personality in the gift.<\/p>\n\n\n\n<p>Anonymous 3:<\/p>\n\n\n\n<p>I was under pressure because I had no idea what to get for the person i picked. And so i decided to take a walk around the store and then I saw this one gift that just suited the person. I felt nervous not knowing if they were going to like it. But am glad they did<\/p>\n\n\n\n<p>Anonymous 4:<\/p>\n\n\n\n<p>It was amazing for my random choice and I decided on the gift there and then; and this is what I finally gifted to the person. I was so excited by the gift I received which surprisingly happened to match my expectations! I was however not really curious to know the anonymous valentine.<\/p>\n\n\n\n<p>Anonymous 5:<\/p>\n\n\n\n<p>It felt nice. I got a chance to gift someone anonymously. I was unable to settle on the gift there and then with the challenge being wanting to buy something valuable, affordable and something to be cherished by the person. I procrastinated until the last minute and so I had difficulty with last minute rush to get the present. On the other side, I was very excited with the gift I received; and although I didn’t have any expectations I was super surprised with the gift as I would never had thought about receiving it. I was curious to know the anonymous valentine but I knew her handwriting so I pretty much can guess who she is<\/p>\n\n\n\n<p>Anonymous 6:<\/p>\n\n\n\n<p>I was excited about my random choice. However, I couldn’t figure out the gift there and then as i had not interacted much with the person. After changing my mind severally, I ended up buying something different from what i had decided to buy after going to the shop. On my side, I had an open expectation on the gift and was very excited upon receiving it. I am however curious as to who my valentine was.<\/p>\n\n\n\n<p>Anonymous 7:<\/p>\n\n\n\n<p>I was super excited with my random choice but my happiness was cut short when I realized it would be hard to get her a gift. I decided on the gift there and then but later changed my mind during the gift hunting so as to find a more befitting gift. On my part, I had an open expectation on the gift and was surprised by how my anonymous valentine knew my fine details. Yes I want to know him\/her to feed my curiosity though I could guess who it was from her handwriting and the lovely message in the card. God bless her\/him for me!<\/p>\n\n\n\n<p>Ruth, we were super excited about the activity not to mention the lovely gifts that we received. We celebrate you too! However, we are not letting you go until we get to know our anonymous valentines!<\/p>\n<div class=\"energ-after-content\" id=\"energ-2049618597\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Anonymous Valentine Date BY MONICA NGAGE Its valentines 2021 and Eenovators family is not left behind. A week to valentine’s day , our meeting chairperson led&nbsp; us in an activity which would lead us to expressing love and appreciating each other. You can bear me witness this came in handy as most of the times [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2974,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"HOW THE MONTH OF LOVE 2021 WAS CELEBRATED EENOVATORS STYLE","_seopress_titles_desc":"A week to valentine’s day , our meeting chairperson led  us in an activity which would lead us to expressing love and appreciating each other","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[201],"tags":[],"class_list":["post-2972","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-events"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2972","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=2972"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2972\/revisions"}],"predecessor-version":[{"id":2975,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2972\/revisions\/2975"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/2974"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=2972"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=2972"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=2972"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}