{"id":2978,"date":"2021-02-24T05:41:10","date_gmt":"2021-02-24T05:41:10","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=2978"},"modified":"2021-02-24T05:41:11","modified_gmt":"2021-02-24T05:41:11","slug":"interview-communication-a-dilemma-for-engineers","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/interview-communication-a-dilemma-for-engineers\/","title":{"rendered":"INTERVIEW COMMUNICATION &#8211; A DILEMMA FOR ENGINEERS?"},"content":{"rendered":"\n<p>BY CAROLYNE GATHURU<\/p>\n\n\n\n<p>As part of the need to provide learning and development opportunities to the youth in the engineering space, <a href=\"https:\/\/eenovators.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Eenovators Ltd<\/a> put out an ad for an Energy Internship opportunity to join the Eenovators Technical Team. The call for an intern was placed on the Eenovators’ social media portals, and a total of two hundred and thirty-three applicants responded to the call. The communication was expressly clear that this was an internship opportunity and not an employment vacancy. The sheer number of applicants posed quite a complication given that the company only needed one person and the efforts to sift through the numerous applications and whittle these down to a manageable number was a tall order. As a result of the overwhelming interest, the interview panel consisting of members from the Human Resources Department and the Strategy Department opted to implement a three-step process to assist with elimination and selection of a smaller number of candidates to interview. <\/p>\n\n\n\n<p>The first step was a thorough review of the applicants’ CVs and application letters. This exercise provided a very interesting perspective. There were all manner of CVs received that befuddled the panel. Some were very colourful renditions, with CVs appearing with bright red, blue, green and yellow backgrounds. All of which the panel placed aside owing to the challenge of navigating through them, based on their blinding colours. In a bid to ‘stand-out’ which is what the panel assumed was the rationale behind these colourful pieces, these candidates ousted themselves owing to the complexity of their colourings. The second type that was placed aside were the over summarized one -pager CVs that were sent in by candidates. These one pager types, were miniscule versions of CVs that did not quite communicate to the panel what the candidate was capable of doing and provide insights into who they are and what they are bringing to the table. These summarized versions left the interview panel struggling to understand what the one liners, and squeezed listings without explanations really mean and what lay behind the different summarized entries. When one is applying for a position, it is in their best interest to provide information that will add to the readers understanding of them and not ‘take away’ from that. The third lot of CVs and application letters that were cast aside were those with spelling and grammatical errors that put off the interviewers. What was discerned from these was that attention to detail and the care to package and present well was absent and sorely lacking. The interviewers extrapolated this to the potential candidate’s projection and value of themselves, and imagined the same ‘casualness’ would be applied when meeting customers during energy audit presentations, training or other project activities.&nbsp;<\/p>\n\n\n\n<p>With stage one complete, the interview panel opted for an online screening process to get to briefly meet the candidates and to understand their motivations and passions, before ultimately inviting the last five candidates for an in – person interview. This stage comprised of three main questions:<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Please tell us briefly about yourself and kindly do not mention anything that is already covered in your CV<\/h4>\n\n\n\n<p>This question threw many candidates totally off balance. A majority of them were unable to express themselves beyond what was captured in their CVs. This question was designed this way to enable candidates talk through their understanding of themselves beyond what is documented. Many candidates had crammed the information on their CVs, and as such were paralyzed when asked to talk about something out of that scope. It was observed that they would consistently repeat information from the CV and when asked to steer clear of the CV’s contents, they were at a loss of what to say. It was only those that managed to communicate about themselves that passed on to the next level. The challenge goes out to young people to have sufficient self-awareness beyond the sections captured in the CV.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Please tell us what you know about the company and your understanding of its undertakings<\/h4>\n\n\n\n<p>This question was designed to observe the level of interest of the candidates in joining the company. If a candidate has not taken time to research and find out about the company they want to join, then they do not have interest in the specific company beyond ‘getting an opportunity’ there. The interviewers were looking for the candidate’s efforts to find out more about the company, understand what it does, and also understand what the company is hoping to achieve in terms of its vision mission and values. The candidates who had made zero efforts to conduct some background checks online were automatically dropped from the list. It is important for one to take interest and to understand the nature and operations of a company that one wants to join, to see if it aligns with one’s own personal vision<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Please tell us your ‘why’, your personal motivation for wanting to join the internship programme<\/h4>\n\n\n\n<p>This question was designed to understand the personal motivation of the candidates who had applied to join the internship programme. This was done in a bid to review if the candidate does indeed have a personal vison of who they are and where they want to go in life, the things they want to do and accomplish, and if these in any way have a connection with the programme as a vehicle towards achieving those dreams. It is at this stage that quite a number of candidates fell out. They were unable to articulate why they wanted to join and how joining would be of benefit to them. Many had no vision bigger than their own self-serving purposes. It is only the candidates who had an inspiring vision of how joining the internship programme would lead them towards making a difference for the community, changing some challenging aspects of society that they desire to change, and\/or assisting to bring impact in a sphere bigger than themselves, that sailed through to the final interview stage.<\/p>\n\n\n\n<p>The final in person interviews were conducted with four candidates who had made it to this level and the final candidate was selected. It is only at this last stage that some simple technical questions on energy management were asked to gauge interest in the sector. It is said that organizations should hire for attitude and train for skill. This exercise was a clear revelation about the role of attitude in getting far and getting first in life. It is our encouragement to the engineering fraternity to take on a great and positive attitude, improve on non-technical skills like communication and people relations, and the next opportunity one gets to interview for a position of choice will be a much easier engagement. The winning formula for any interview situation is to be natural. To not harvest information from the internet and attempt to regurgitate it to the interview panel, and to be as honest and as forthright as possible no matter how counter intuitive that may seem.&nbsp;<\/p>\n\n\n\n<p><a href=\"http:\/\/eenovators.com\" target=\"_blank\" rel=\"noreferrer noopener\">Eenovators Ltd<\/a> thanks all the candidates that applied for the Energy Intern Opportunity and is very pleased to welcome Peter Achieng the one successful candidate from the massive sea of candidates, aboard the <a href=\"https:\/\/eenovators.com\/\" data-type=\"URL\" data-id=\"https:\/\/eenovators.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Eenovators Ltd<\/a> train to greatness. We wish him a fulfilling and informative internship period ahead. <\/p>\n<div class=\"energ-after-content\" id=\"energ-3132224376\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>BY CAROLYNE GATHURU As part of the need to provide learning and development opportunities to the youth in the engineering space, Eenovators Ltd put out an ad for an Energy Internship opportunity to join the Eenovators Technical Team. The call for an intern was placed on the Eenovators’ social media portals, and a total of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2980,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"INTERVIEW COMMUNICATION - A DILEMMA FOR ENGINEERS?","_seopress_titles_desc":"As part of the need to provide learning and development opportunities to the youth in the engineering space, Eenovators Ltd put out an ad for an Energy Internship opportunity to join the Eenovators Technical Team","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-2978","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2978","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=2978"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2978\/revisions"}],"predecessor-version":[{"id":2981,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/2978\/revisions\/2981"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/2980"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=2978"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=2978"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=2978"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}