{"id":3069,"date":"2021-04-22T12:58:09","date_gmt":"2021-04-22T12:58:09","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3069"},"modified":"2021-04-22T12:58:10","modified_gmt":"2021-04-22T12:58:10","slug":"what-energyzed-discussions-are-happening-in-the-space-of-the-world-energy-day-celebrations-2021","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-industry-news\/what-energyzed-discussions-are-happening-in-the-space-of-the-world-energy-day-celebrations-2021\/","title":{"rendered":"What ‘Energyzed’ Discussions are Happening In the Space of the World Energy Day Celebrations 2021?"},"content":{"rendered":"\n<p>BY CAROLYNE GATHURU<\/p>\n\n\n\n<p>Fantastic conversations are lined up to energize all the activities in the run up to the World Energy Day Conference 2021 happening in Kampala Uganda form 20-22<sup>nd<\/sup> October 2021. These include Online Webinars, Social Media Communication, Audios and Videos in different places, spaces and through different channels. These are conversations no energy enthusiast will want to miss!<\/p>\n\n\n\n<p>The overarching theme for the year is &nbsp;– Energy Sustainability in Africa; Unlocking Food Sustainability, Climate Change and Water Equation. This has been inspired by the fact that there is need to synergize efforts for more impactful and harmonized discussions in these areas, which when effected will bring about transformative change.<\/p>\n\n\n\n<p>The WED Celebrations and conference seek to address this under the banner of these twelve main themes that every energy professional, practitioner and enthusiast would find very value adding to plug into:<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Covid Management:<\/strong><\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>What energy interventions have been engaged in the continent to both combat and manage the Covid -19 pandemic in its various states and stages? Have these been sufficient and are they cross cutting or country specific? What can the countries in this continent share in terms of best practice and interventions? What are the immediate, medium term and longer lasting action plans?<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Building Resilience:<\/strong><\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>Now more than ever Africa needs to examine her energy resilience structures and assess what needs to be put in place to ensure continuity and sustainability. The subject of resilience has been brought to the fore glaringly by the ravages that Covid -19 has exhumed and the need for energy stability. Resilience has become a buzz word but does not need to remain that but be actualized.<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Food Sustainability:<\/strong><\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>Where does food sustainability start and sustainable clean energy and energy efficiency end? How can Africa bring home SDG 2 on zero hunger through a focus on energy and the need for embedding this into sustainable food production, movement, distribution and consumption? How does clean energy and energy efficiency enhance the food sustainability agenda?<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Addressing Climate Change:<\/strong><\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>Africa is extremely hopeful around the climate change agenda given the turn of global events and with the recommitment of key global players to plans to re-enter the Paris climate accord and champion a global reset. Is Africa ready to run with the climate change agenda and keep at par with the global pace? What structures are in place and what can be prioritized?<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Water Management:<\/strong><\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>Water monitoring and analytics that provide insights into water usage in real-time vide technology, transfers useful data for analysis. This trending empowers domestic and industrial facility managers make informed decisions for improvement. The harmonization of these strategies and efforts in pretty much the same way energy monitoring is conducted will serve the continent to have more impactful outcomes.<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Community involvement:<\/strong><\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>The future of sustainability projects lies in the bottom-up approach of transfer of initiatives, projects, and interventions towards full community ownership. The-solutions-are-with-the-people is no longer a catch phrase, but indeed the key that is necessary to ensure that whatever gets started gets rooted, and the so-called energy ‘white elephants’ are a thing of the absolute past in the continent.&nbsp;<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Tech Innovation:<\/strong><\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>COVID-19 is said to have been and continues to be the ultimate tech and innovation disruptor, from the need to innovate for digitization of processes, the need for social distancing and extreme change of what was normal life and work earlier known. How has the energy sector in Africa stepped up to fill the various voids and allow for sustainable and efficient normalization of the abnormal?&nbsp;<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Policy Matters:<\/strong><\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>If it is not written it will not get done is the mantra around which energy, food sustainability, water management and climate change matters around which the conference theme is built stands. Numerous policies, regulations, legislation and guiding frameworks exist and are in place. The million-dollar question is if these are active on the ground and delivering on intention. Are paper and placement in alignment?<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>The Inclusion Agenda:<\/strong><\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>The energy sector absolutely need not be left out of the inclusion wave sweeping over the globe. #EverythingMatters and energy professionals must discuss and bring to the fore energy inclusion at all levels including; financial, gender, geographical, sectoral, youth, bottom of the pyramid and disability inclusion. Partnerships would be the strategy to deliver on ensuring inclusivity. Where and how energy sits in these spheres is a must discuss this year.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Renewables Relevance:<\/strong><\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>The place of renewables over the years has never waned in relevance, and the need to achieve the global sustainable development goals anchored on clean energy remains in check. How far has the continent gone in the development and entrenchment of clean energy into both government and private projects? Are there wins and gains to be shared across the countries? Benchmarking and learning is a key WED agenda.<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Energy Financing:<\/strong><\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>With energy auditing, energy monitoring, energy consulting and energy research and studies ongoing in the continent in very high gear, the energy conservation, efficient use and management recommendations produced from these activities often face the biggest barrier to entry – financing. Africa’s sustainable project initiatives need to benefit from existing green funding and to develop further strategies to unlock funding to implement the various pending projects.<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Energy Awareness:<\/strong><\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>Africa’s greatest potential lies in creating energy awareness at all levels to increase knowledge and as such influence attitude and behaviour change for impact. Both formal and informal structures need to be adopted to ensure wider reach. Awareness at professional level needs to be pushed through with energy professionals upskilling, as well as community interventions. Energy change can only be achieved with high levels of awareness and the WED activities will serve to augment this.<\/li><\/ul>\n\n\n\n<p>Participating in the WED Celebrations 2021 will demonstrate commitment towards energy transformation. The planet has seen significant setbacks over the past year and a half and the time is ripe for the energy sector to create significant steps forward. &nbsp;The continent is gaining significance in the energy space and collaboration to ensure success is inevitable. This is therefore a call for commitment from anyone and everyone who cares for the planet to register for the WED activities!<\/p>\n\n\n\n<p>Send your registration request or any enquiries for information to <a href=\"mailto:info@worldenergyday.net\">info@worldenergyday.net<\/a><\/p>\n<div class=\"energ-after-content\" id=\"energ-2143693440\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>BY CAROLYNE GATHURU Fantastic conversations are lined up to energize all the activities in the run up to the World Energy Day Conference 2021 happening in Kampala Uganda form 20-22nd October 2021. These include Online Webinars, Social Media Communication, Audios and Videos in different places, spaces and through different channels. These are conversations no energy [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3071,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"What ‘Energyzed’ Discussions are Happening In the Space of the World Energy Day Celebrations 2021?","_seopress_titles_desc":"Fantastic conversations are lined up to energize all the activities in the run up to the World Energy Day Conference 2021 happening in Kampala Uganda form 20-22nd October 2021","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[24],"tags":[],"class_list":["post-3069","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-energy-industry-news"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3069","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3069"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3069\/revisions"}],"predecessor-version":[{"id":3072,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3069\/revisions\/3072"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3071"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3069"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3069"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3069"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}