{"id":3074,"date":"2021-05-03T08:08:55","date_gmt":"2021-05-03T08:08:55","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3074"},"modified":"2021-05-04T09:36:36","modified_gmt":"2021-05-04T09:36:36","slug":"africas-youth-breaking-the-glass-ceiling","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/africas-youth-breaking-the-glass-ceiling\/","title":{"rendered":"AFRICA’S YOUTH: BREAKING THE GLASS CEILING"},"content":{"rendered":"\n<p>By Albert Kibiwott<\/p>\n\n\n\n<p>Africa’s youth are the key drivers for harnessing clean energy. The future of Africa depends on inclusivity of the youth in stimulating its growth, especially in the green energy sector. Programs, such as the <a href=\"https:\/\/eenovators.com\/youth-in-energy-empowerment-program-yeep\/\" target=\"_blank\" rel=\"noreferrer noopener\">Youth in Energy Empowerment Program<\/a>, are what governments and international development agencies should be supporting in the region in an effort to realize the United Nations’ Sustainable Development Goals (SDGs) and the National Determined Contributions (NDCs).<\/p>\n\n\n\n<p>Statistics from the African Development Bank and World Bank show that over 60% of the population in Sub-Saharan Africa are under the age of 25 and that the youth population is expected to rise to 830 million by 2050. This is an indication that the youth can be seen as current and future assets who need to be fully capitalized through job creation and other economic opportunities. Unemployment is a significant challenge affecting the youth in the region. Lack of quality education and professional skills are among the top contributors to this problem. With the widening gap between education and the job market, many youth have been forced to work in the informal sector, which is not only unstable but also provides very low levels of income.<\/p>\n\n\n\n<p>The green energy sector is indeed an avenue to break this glass ceiling among the African youth. The sector can generate a high number of direct employment opportunities through its value chain of sales, marketing, installation, and maintenance services. This itself could create more than 4.5 million jobs by 2030 as estimated by the International Renewable Energy Agency (IRENA). Currently, there are an estimated 322,000 jobs in the clean energy sector in Africa. However, as renewable energy and its related technologies are being adopted across Africa, opportunities are growing rapidly.<\/p>\n\n\n\n<p>But just how can young people embrace these breakthroughs? It is a high time that the youth innovate pathways to overcome the current challenges. There is a dire need for increased collaboration between the training institutions and the industry. Creating awareness as well as highlighting the job opportunities and required skill sets to the students in educational institutions, is a quick way of demystifying green growth and possible avenues in the industry to the youth. The curricula in these institutions should be co-designed in a manner that the technical skills in the clean energy sector are well captured. Moreover, apprenticeships and internship programs in clean energy companies could provide opportunities for graduates to gain work experience for their professional growth.<\/p>\n\n\n\n<p>Things of quality have no fear of time. The certification agencies in the industry should ensure that training programs meet the desired international standards and appropriate guidelines. According to UNESCO in its second engineering report, <em>Engineering for Sustainable Development: Delivering on the Sustainable Development Goals<\/em>, published on 4 March 2021, besides Africa having the lowest number of engineering professionals per capita of all regions of the world, a more worrying stat shows that the quality of engineers in most countries is low and there are no indications that the situation is likely to improve soon. This is a wake-up call to training and accreditation institutions to transform the programs and align their standards to ensure that quality graduates join the market. As this is done, the youth should be equipped with modern skills, especially in the areas of artificial intelligence, big data ecosystems, and the development of smart and green cities.<\/p>\n\n\n\n<p>The youth&nbsp;are the&nbsp;backbone&nbsp;of all nations. Investing and supporting youth entrepreneurs is an inevitable option for governments across Africa. Although some countries have made some strides in elevating the youth in business, more grants and affordable loan finance mechanisms should be put in place. Most renewable energy sources require high starting capital, which many youth may not afford. The regional governments, therefore should chip in and assist these innovative minds by undertaking three key steps: strengthening funding for youth programs, improving capacity building in the energy sector, and expanding the technological know-how in the renewable energy sector in the region. Young African leaders should be part of policy discussions that seek to find solutions to high unemployment rates among other challenges.<\/p>\n\n\n\n<p> In light of Africa’s ambitious goals to attain its sustainable development goals (SDGs), the youth should be placed at the center of these efforts. The growing youth population in Africa comes with high energy, innovative and creative minds, which are undoubtedly the key to future prosperity as highlighted by the <em>African Economic Outlook<\/em>. It is time that African leaders include the young people in educational, economic, and political activities and treat the youth empowerment agenda as a matter of urgency. Looking into the future, one only hopes that African youth will lead the way in creating the right opportunities and environment for the next generations. This can only happen if they are armed with the necessary skills and experience to take the continent forward.<\/p>\n\n\n\n<p><strong>BIOGRAPHY<\/strong><\/p>\n\n\n\n<p>Albert Kibiwott is a trainee in the Youth in Energy Empowerment Program (YEEP) with a background in Electrical and Electronic Engineering and a certificate in cobenefits in renewable energy. He has particular interests in renewable energy, entrepreneurship, and sustainable development. He currently trains as an Energy Audit Technician with the <a href=\"https:\/\/iepa.org.za\/\" target=\"_blank\" rel=\"noreferrer noopener\">Institute of Energy Professionals Africa (IEPA<\/a>) and <a href=\"http:\/\/eenovators.com\" target=\"_blank\" rel=\"noreferrer noopener\">Eenovators Limited<\/a>.<\/p>\n\n\n\n<p>Kibiwott enjoys reading engineering journals and blogs and playing football and scrabble.<\/p>\n<div class=\"energ-after-content\" id=\"energ-3339500850\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Albert Kibiwott Africa’s youth are the key drivers for harnessing clean energy. The future of Africa depends on inclusivity of the youth in stimulating its growth, especially in the green energy sector. Programs, such as the Youth in Energy Empowerment Program, are what governments and international development agencies should be supporting in the region [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3076,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"AFRICA’S YOUTH: BREAKING THE GLASS CEILING","_seopress_titles_desc":"Programs, such as the Youth in Energy Empowerment Program, are what governments and international development agencies should be supporting in the region in an effort to realize the United Nations’ Sustainable Development Goals (SDGs) and the National Determined Contributions (NDCs)","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,207],"tags":[],"class_list":["post-3074","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3074","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3074"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3074\/revisions"}],"predecessor-version":[{"id":3114,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3074\/revisions\/3114"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3076"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3074"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3074"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3074"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}