{"id":3087,"date":"2021-05-04T08:48:11","date_gmt":"2021-05-04T08:48:11","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3087"},"modified":"2021-05-04T09:34:24","modified_gmt":"2021-05-04T09:34:24","slug":"mobilizing-youths-towards-universal-clean-energy-access","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/mobilizing-youths-towards-universal-clean-energy-access\/","title":{"rendered":"MOBILIZING YOUTHS TOWARDS UNIVERSAL CLEAN ENERGY ACCESS"},"content":{"rendered":"\n<p><strong>By <strong>Patrick Kanyuira<\/strong><\/strong><\/p>\n\n\n\n<p>“With their future at risk, youth are the ultimate stockholders in energy,” as said by Damilola Ongunbiyi, co-chair UN-energy and chief executive of sustainable energy for all. Indeed, to push and accelerate consumption of clean energy, the youth are an integral part of the wheel. In Kenya alone, it is estimated that the youthful age of 34 years and below makes up 78.31% of the population. In spite of the youth being the majority, it is said energy sector is being run by the older generation. Now, this begs the question, how can the youth be mobilized and actively engaged towards the success of universal accessibility to clean energy?<\/p>\n\n\n\n<p>First, there is need for the youth to be educated. Knowledge is a key and a remedy to various problems. Making the youth understand their role in this space, how to make a niche and how to make use of opportunities in the sector is important. Additionally, it would be informative to have them understand the pros and cons of clean energy accessibility, current technologies and progress of clean access in the country. Thanks to programs such as the Youth in Energy Empowerment Program, students are guided on energy management skills and how important it would be towards not only saving costs, but enhancing accessibility as wastages are mitigated. Also, the knowledge gained will help the youth create awareness and be pro-active towards clean energy access.<\/p>\n\n\n\n<p>The Youth should be supported to actualize their innovations. This takes me back to school projects. It reminds me of a group that was working on a concentrated solar project integrated with a fly-wheel for storage purposes. The group believed this was a remedy for lighting their villages as most of them came from unpowered areas. But sadly a few years later, the project has never seen the light of the day, as they lacked people who could correctly and prudently guide them towards actualizing it. &nbsp;If youth projects and innovations could be taken a notch higher and more seriously, more and more youth would be encouraged and inspired to join this bandwagon towards clean energy accessibility.<\/p>\n\n\n\n<p>For actual experience, youth need to be engaged in volunteer-ship programs. Organizations like World Access to Modern Energy take in the youth for volunteer opportunities. They are engaged in vigorous training and handiwork on decentralized systems especially on precision agriculture in rural areas. With such opportunities the youth can bear witness to clean energy access to villages both for households and agriculture, and be encouraged and inspired to continue to pursue clean energy access to all.<\/p>\n\n\n\n<p>A major hindrance to most youth is financing their projects. Think of Evans Wadongo who is the chief executive officer of Use Solar, Save Lives. When he began his project, he had problems finding funding as the project was offering the solar lighting for free. He is among the few lads and lasses who never despaired or relinquished their dreams due to lack of funds. I attended a youth webinar hoisting their projects with hope of being funded, but the organization only going to sponsor some. I could feel and see despair of the youth who never won as they had high hopes that did not come to fruition. A project that proposed a solution of biodegradable waste providing clean heating energy with profound impact and impeccable returns could not be actualized by a group of youth due to lack of funds. Funding does indeed create a barrier, but should not lead to young people giving up their bright and innovative ideas.<\/p>\n\n\n\n<p>To conclude, great changes in destiny of mankind can only be effected in minds of young ones-the youth. Let’s make the youth ready and include them in all energy conversations.<\/p>\n<div class=\"energ-after-content\" id=\"energ-3576658180\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Patrick Kanyuira “With their future at risk, youth are the ultimate stockholders in energy,” as said by Damilola Ongunbiyi, co-chair UN-energy and chief executive of sustainable energy for all. Indeed, to push and accelerate consumption of clean energy, the youth are an integral part of the wheel. In Kenya alone, it is estimated that [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3089,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"MOBILIZING YOUTHS TOWARDS UNIVERSAL CLEAN ENERGY ACCESS","_seopress_titles_desc":"Indeed, to push and accelerate consumption of clean energy, the youth are an integral part of the wheel. In Kenya alone, it is estimated that the youthful age of 34 years and below makes up 78.31% of the population","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,207],"tags":[],"class_list":["post-3087","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3087","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3087"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3087\/revisions"}],"predecessor-version":[{"id":3110,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3087\/revisions\/3110"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3089"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3087"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3087"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3087"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}