{"id":3091,"date":"2021-05-04T08:53:25","date_gmt":"2021-05-04T08:53:25","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3091"},"modified":"2021-05-04T08:53:26","modified_gmt":"2021-05-04T08:53:26","slug":"recycling-and-energy","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/recycling-and-energy\/","title":{"rendered":"RECYCLING AND ENERGY"},"content":{"rendered":"\n<p>By Gloria Maruti<\/p>\n\n\n\n<p>As long as there is human activity going on in any part of the world, waste will be produced at one point or the other, and in various forms. Managing that waste however sometimes poses a problem, more so in third world countries. One common negative attitude towards waste management among individuals is <em>“it doesn’t affect me directly, so it’s not my problem.”<\/em> The truth is, whether we like it or not, the waste we produce in our day to day activities impacts not only our lives but that of our Earth. The good news is that some of the waste we produce can be managed by recycling. Although much has been said about it, some of us are still quite green on the impact that recycling has on the planet as a whole and how it benefits not only us but future generations to come. How then do we define recycling? In simple terms, it can be described as the process of converting material that would have otherwise been thrown away (waste) into new materials and objects.<\/p>\n\n\n\n<p>Recycling has very many benefits including conservation of natural resources, saving energy, reduction in demand for raw materials, reduction of waste sent to landfills and incinerators, pollution reduction and job creation in the recycling and manufacturing industries among others. Of all these benefits, saving energy is one of the most significant benefits when it comes to matters concerning our day to day lives and the planet as a whole.<\/p>\n\n\n\n<p>Here is why…<\/p>\n\n\n\n<p>Each time a new item is produced from raw materials, a significant amount of energy is consumed. Looking at the four stages of product development, that is, extraction of raw materials, manufacture of the materials into products, products consumption and product disposal, helps us to understand the role that recycling has on conservation of energy. The process of recycling almost always uses less energy. This means fewer fossil fuels are burned which then translates to less emission of greenhouse gases, that contributes to negative climate change which in turn translates to better life on the planet.<\/p>\n\n\n\n<p>The aspect of the role of recycling in energy conservation can be looked at from various points of view. To help understand how energy is conserved let&#8217;s take an example of paper. We know that paper comes from wood and that wood comes from trees. Now, the process of cutting down trees and converting them to wood requires the use of energy right from the fuel used to run the machines that cut down the trees. Transportation of the cut trees to the paper-manufacturing plant in bulk consumes energy in terms of the fossil fuel burned and used to run the vehicles that carry out the transportation. In the paper-manufacturing plant, the process of extracting and processing the wood in order to make usable materials like paper is quite energy intensive. Just imagine how many machines the wood has to go through to become paper.<\/p>\n\n\n\n<p>Let’s now look at making new paper from recycling.&nbsp; Manufacturing recycled paper uses a considerably lower amount of energy because it eliminates several energy-intensive steps in the process of paper manufacture. The process is quite simple actually. You simply collect the waste paper to be recycled, take it through the recycling process by mixing it with chemicals and water then rolling it into new paper. It has been proven that the process of manufacturing recycled paper consumes only 60% of the energy needed to produce paper from fresh pulp. As a plus, thousands of trees are saved in the process. This in turn leaves more habitat for plants and animals, which then conserves wildlife.<\/p>\n\n\n\n<p>In the rural parts of our country Kenya, it is not uncommon to find residents using old newspapers to light the traditional cooking stove commonly referred to as <em>jiko<\/em>. Do you know just how much energy can be conserved by recycling waste newspapers? Well, recycling a daily newspaper for a month can conserve enough energy to power a 36-inch television for 130 hours. That’s almost five and a half days. Quite a lot of money in terms of electric bills can be saved from that, wouldn’t you say?<\/p>\n\n\n\n<p>Remember, it is not only paper that can be recycled.&nbsp; There are so many materials that can be recycled which include glass, metal, aluminium, steel, compost, wood, fibre, concrete, paperboard, cement, among others. Energy savings from recycling other materials such as aluminium and plastic are in fact far much more than that for paper. Recycling 6 steel cans a week for a year saves enough energy to run at 36-inch television for 225 hours. How much energy is saved depends on the material in question. Look at aluminium for example. The amount of energy required to make a single virgin aluminium can, can be used to make 20 recycled cans. The beauty about recycling aluminium is that aluminium can be recycled indefinitely without degrading. That means there is virtually no need to slot fresh aluminium materials into the production cycle if we recycle the aluminium we already made.<\/p>\n\n\n\n<p>Much less energy is consumed in the making of steel, plastic and aluminium products by recycling that it does to produce them from natural gas, oil or rocks. This is because a great amount of the energy consumed in these processes is channelled to the refining of the crude raw material.<\/p>\n\n\n\n<p>It is almost impossible to talk about the role of recycling in energy conservation and leave out climate change. The process of recycling not only reduces waste but is an effective way to decrease the generation of greenhouse gases which are responsible for climate change. How? It helps conserve energy in the process of materials for industrial and consumer use and also helps to reduce the flow of materials into landfills where decomposition of materials produces methane.<\/p>\n\n\n\n<p>Saving energy translates to cost savings associated with the provision of this energy. Why then have we not fully embraced recycling as a nation despite all its benefits? According to The Ministry of Environment and Forestry, the major challenge is inadequate financing, poor infrastructure and technology. In my opinion, a very important challenge that is overlooked is creating adequate public awareness. The more awareness we create about recycling the more attention it will receive and the more people will embrace the need. Awareness will inspire the need to create a habit of recycling which will in due time become a lifestyle and attract investors in the industry. Let’s embrace recycling, conserve energy and save the planet.<\/p>\n<div class=\"energ-after-content\" id=\"energ-789273423\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Gloria Maruti As long as there is human activity going on in any part of the world, waste will be produced at one point or the other, and in various forms. Managing that waste however sometimes poses a problem, more so in third world countries. One common negative attitude towards waste management among individuals [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1624,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"RECYCLING AND ENERGY ","_seopress_titles_desc":"As long as there is human activity going on in any part of the world, waste will be produced at one point or the other, and in various forms. Managing that waste however sometimes poses a problem, more so in third world countries","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,207],"tags":[],"class_list":["post-3091","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3091","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3091"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3091\/revisions"}],"predecessor-version":[{"id":3093,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3091\/revisions\/3093"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1624"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3091"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3091"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3091"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}