{"id":3094,"date":"2021-05-04T09:04:16","date_gmt":"2021-05-04T09:04:16","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3094"},"modified":"2021-05-04T09:04:16","modified_gmt":"2021-05-04T09:04:16","slug":"were-all-affected-by-energy","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/were-all-affected-by-energy\/","title":{"rendered":"WE’RE ALL AFFECTED BY ENERGY"},"content":{"rendered":"\n<p>By Richard Ojunga<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">“WASTING ELECTRICITY”?<\/h4>\n\n\n\n<p>I remember when I was younger, I used to play a certain game. This was probably the hardest game I have ever had to play, and what made it harder was the fact that it was ‘prohibited’. Let’s call this game <em>Faster than light<\/em>. Basically, what one had to do to play this game was to slowly close a refrigerator door and “catch” the refrigerator light while it was still on before the door completely shut. Coming to think of it, I don’t think I ever managed to successfully do that — one actually had to be faster than light to do this. What I did successfully manage to do, however, was not to get caught while playing the game, by my caregiver. What would happen if I were to get caught? Best case scenario would be to be told something along the lines of, “You’re wasting electricity”, and worst-case scenario, you may ask? Just know that it would most definitely have ended in tears, so one had to be fast, at least fast enough not to get caught playing, or fast enough to run away after getting caught — I was never good at the latter.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">ENERGY IN DAILY LIFE<\/h4>\n\n\n\n<p>In retrospect, I never really understood what was meant by “wasting electricity” just up until recently. Whether you played this game or not, most of us waste energy (electricity included) or feel the impacts of wasted energy either directly or indirectly — from daily tasks such as cooking or even using vehicular means of transport. In fact, society has often been dependent on energy, just in different ways. Just until recently, firewood was the primary means of cooking energy which has gradually decreased and been replaced by other sources such as gas; and transport has evolved from walking to steam trains to electric vehicles. In one way or another, we interact with cooked food, which requires some energy to prepare. Similarly, transportation systems such as buses and personal cars require energy to run. Why is this important? You probably already knew that you need energy to prepare your delicious meals and run your luxurious dream car, and that this energy comes at a cost. Did you know though that: you could save on some of these costs; that there are cleaner and cheaper alternative sources of energy; that consumption of energy has an impact on climate; and that energy is a vital part of our society even in the future? If you did, that’s great! And if you didn’t, then you’re in luck because there currently exist so much information about the same and I’d advise&nbsp; checking out some of them.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">BUILDING AND FORTIFYING BRIDGES TOGETHER<\/h4>\n\n\n\n<p>If you’re still wondering about “wasting energy” as I did for a long time, then you share a similar thought with energy professionals whose agenda includes: identifying, mitigating or eliminating energy waste amongst others. We might not all be energy professionals but we are all affected by energy in one way or another, and we have a role to play in the energy field just as the professionals do. I believe, that at least in the context of energy, we are the makers of our own future, and that a significant amount of our energies should be directed towards making us aware of how energy is an integral part of daily life and how we can play a part in the energy space. This is applicable even from a young age so that the concept of wasting electricity while playing <em>Faster than light<\/em> makes sense to us. Hopefully, this should create a mind shift that will ensure sustainable and improved energy practices and policies on a household and global level — then we probably wouldn’t have to be worrying too much about the price of food commodities going up because of something such as oil price inflation. We all have a part to play in this, to build new as well as fortify already existing energy related practises and awareness.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">INVESTING IN THE NEXT GENERATION<\/h4>\n\n\n\n<p>With sustainability in mind, we may definitely have to consider the next generation. The next generation of technologies, practices and even people who act as the pillars of safeguarding the future. A good foundation is, however, required and needs to be solid from start. This means that as early as now, people, particularly the youth who carry the mantle of a sustainable future in energy as well as other aspects of life, need to be sensitised, trained and mentored. Creating a suitable environment and support system as well as imparting the necessary skills and education to the upcoming generation would aid in getting them on board with the current energy situation, and pave the way for a more informed, energy conscious and efficient future. As you finalize reading this, I would like to welcome you, in whatever capacity you may have, to be part of this all-inclusive cause of contributing to energy sector that affects all of us.<\/p>\n<div class=\"energ-after-content\" id=\"energ-3358186958\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Richard Ojunga “WASTING ELECTRICITY”? I remember when I was younger, I used to play a certain game. This was probably the hardest game I have ever had to play, and what made it harder was the fact that it was ‘prohibited’. Let’s call this game Faster than light. Basically, what one had to do [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":931,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"WE’RE ALL AFFECTED BY ENERGY","_seopress_titles_desc":"In retrospect, I never really understood what was meant by “wasting electricity” just up until recently. Whether you played this game or not, most of us waste energy (electricity included) or feel the impacts of wasted energy either directly or indirectly ","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,207],"tags":[],"class_list":["post-3094","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3094","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3094"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3094\/revisions"}],"predecessor-version":[{"id":3096,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3094\/revisions\/3096"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/931"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3094"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3094"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3094"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}