{"id":3097,"date":"2021-05-04T09:08:24","date_gmt":"2021-05-04T09:08:24","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3097"},"modified":"2021-05-04T09:13:23","modified_gmt":"2021-05-04T09:13:23","slug":"what-role-do-you-play-in-the-clean-energy-campaign","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/what-role-do-you-play-in-the-clean-energy-campaign\/","title":{"rendered":"WHAT ROLE DO YOU PLAY IN THE CLEAN ENERGY CAMPAIGN?"},"content":{"rendered":"\n<p>By Cherrily Shikweya<\/p>\n\n\n\n<p><a href=\"https:\/\/unfccc.int\/process-and-meetings\/the-paris-agreement\/the-paris-agreement\" target=\"_blank\" rel=\"noreferrer noopener\">The Paris Agreement, adopted at COP 21<\/a>, requires its member countries to commit to reducing their greenhouse gas emissions, hence limit global warming to a temperature increase below 2ºC, and preferably 1.5ºC. One way countries can cut down on global emissions is by adopting cleaner and renewable energy technologies. Consequently, the energy sector has come up with action plans that align with this course.<\/p>\n\n\n\n<p>To many people, discussions on renewable energy is not of their concern; it is an agenda for the government, the company that produces and distributes electricity, or the energy consulting firm. They understand what clean energy is and its benefits, but do not know what they can do to contribute to its attainment, so they do nothing about it. Truth is 100% clean energy cannot be accomplished unless everyone is involved. Furthermore, climate change affects all. This is why everyone’s voice and contribution is needed, from you as an individual, all the way up to the policy maker. So, what exactly is your role? Below are a few things each one of us can do in our different spaces to contribute to the clean energy campaign.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Individuals<\/strong><\/h4>\n\n\n\n<p>Use clean energy. Complement your electricity supply with a renewable source e.g solar power by installing solar panels. Solar power is especially useful for water heating in households. This will help to reduce reliance on energy from fossil fuels<\/p>\n\n\n\n<p>Embrace renewable energy projects in your community. Accept to be a part of clean energy projects being implemented by the government or non-governmental organizations. Whether it is the installation of windmills or a requirement to use specific cookstoves, cooperate.<\/p>\n\n\n\n<p>Contribute to clean energy innovations. Be involved in the development of clean energy technologies through sharing your thoughts and ideas on renewable energy projects.<\/p>\n\n\n\n<p>Educate people in your surrounding about clean energy. The responsibility to create awareness is on all of us. Tell a person or two about clean sustainable energy and the benefits.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Businesses and Corporates<\/strong><\/h4>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" width=\"266\" height=\"189\" data-src=\"https:\/\/energyzedworld.com\/wp-content\/uploads\/2021\/04\/2.png.jpg\" alt=\"\" class=\"wp-image-3065 lazyload\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 266px; --smush-placeholder-aspect-ratio: 266\/189;\" \/><\/figure>\n\n\n\n<p>Sponsor clean energy innovations through funding. Invest in research and development in renewable energy infrastructure.<\/p>\n\n\n\n<p>Support sustainable energy adoption. Offer financial, advisory and technical support to communities adopting renewable energy technologies.<\/p>\n\n\n\n<p>Inspire people to use renewable energy. Lead by example, for instance through the use of clean energy within your organization. Make your next construction project a green building.<\/p>\n\n\n\n<p>Raise awareness. Run programs that raise clean energy awareness among your employees, clients, and partners. Equally spread the message in social places. Schools are a good place to start.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Industries<\/strong><\/h4>\n\n\n\n<p>Invest in renewable energy resources. Adopt clean energy technologies and infrastructure. The investment may seem large now, but it will definitely save money in the next few years.<\/p>\n\n\n\n<p>Appreciate the value of clean energy. Reduce carbon emissions through the use of clean energy. This is not only for the purpose of complying to government regulations, but to contribute to the fight against climate change and secure future generations, hence the future of your industry.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>The Government and Leadership<\/strong><\/h4>\n\n\n\n<p>Develop and implement policies that promote the use renewable energy. Examples are policies on carbon tax and carbon trade, as well as policies that encourage foreign investment in renewable energy technologies.<\/p>\n\n\n\n<p>Educate the public on existing and new energy policies. This will help to ensure that citizens are informed of government energy policies, and can therefore comply with the policies with pan understanding.<\/p>\n\n\n\n<p>Empower. Build capacity of the private sector to harvest renewable energy resources through financing, tax incentives, and smooth licensing procedures. An example is by endorsing solar off-grid technologies.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Conclusion<\/strong><\/h4>\n\n\n\n<p>Collective effort is essential for the achievement of clean sustainable energy, thus limitation of global warming. We must unite our action and commitment towards this goal. I challenge you to participate in the clean energy campaign. Go ahead and find out what more you can do. Get involved.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p>Cherrily Shikweya<\/p>\n\n\n\n<p>B. Eng. Chemical and Process Engineering<\/p>\n\n\n\n<p>Technical University of Kenya<\/p>\n<div class=\"energ-after-content\" id=\"energ-139636471\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Cherrily Shikweya The Paris Agreement, adopted at COP 21, requires its member countries to commit to reducing their greenhouse gas emissions, hence limit global warming to a temperature increase below 2ºC, and preferably 1.5ºC. One way countries can cut down on global emissions is by adopting cleaner and renewable energy technologies. Consequently, the energy [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3100,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"WHAT ROLE DO YOU PLAY IN THE CLEAN ENERGY CAMPAIGN?","_seopress_titles_desc":"This is why everyone’s voice and contribution is needed, from you as an individual, all the way up to the policy maker. So, what exactly is your role? Below are a few things each one of us can do in our different spaces to contribute to the clean energy campaign.","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,207],"tags":[],"class_list":["post-3097","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3097","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3097"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3097\/revisions"}],"predecessor-version":[{"id":3103,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3097\/revisions\/3103"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3100"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3097"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3097"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3097"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}