{"id":3104,"date":"2021-05-04T09:19:53","date_gmt":"2021-05-04T09:19:53","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3104"},"modified":"2021-05-04T11:50:16","modified_gmt":"2021-05-04T11:50:16","slug":"blissful-ignorance","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/blissful-ignorance\/","title":{"rendered":"BLISSFUL IGNORANCE"},"content":{"rendered":"\n<p>By Sephan Ogola<\/p>\n\n\n\n<p>I find the phrase: “That is what we usually do, and it works” not only naïve but also dangerous. It exhibits primitive contentment, carelessness and perhaps even irresponsibility. Consequently, invention and innovation are inhibited and without growth and development, humanity is doomed. The fact that something has always worked or produced certain desirable results is not proof of efficiency. More often than not, we fail to analyse the sustainability aspect of such processes, products or actions. It may be because we are consumed by our pursuit for profits or sheer myopia, but now more than ever, the consequences are apparent and the dire effects encountered worldwide can no longer be ignored. Global warming whose main causal agent is greenhouse gas emissions <strong>[1]<\/strong> that constitutes carbon dioxide, methane et al, threatens our future<strong>.<\/strong><\/p>\n\n\n\n<p>You would be pleased to know that not all is lost. In fact, bold, promising initiatives are under way such as <strong><a href=\"https:\/\/unfccc.int\/process-and-meetings\/the-paris-agreement\/the-paris-agreement\" target=\"_blank\" rel=\"noreferrer noopener\">The Paris Agreement<\/a><\/strong> which received overwhelming support from several world leaders to a tune of around 196 signatories. Its&nbsp;goal is to <strong>limit global warming<\/strong> to well below 2 ˚C, <strong>preferably to 1.5 ˚ Celsius<\/strong>, compared to pre-industrial levels. To achieve this long-term temperature goal, countries aim to reach global peaking of greenhouse gas emissions as soon as possible to achieve a climate neutral world by mid-century <strong>[2]. <\/strong>Achieving this vision calls for a collective effort from every individual in their respective professions and day to day life, otherwise its attainment will remain a pipe dream.<\/p>\n\n\n\n<p>Take a stroll in the populous Nairobi estates and you would be amused or possibly unsettled by the tens of buildings in close proximity; some still under construction, each with its own aerial ambitions. These are not sky-scrappers but residential apartment buildings averaging six to eight floors, with a single apartment block sometimes hosting as many as fifty units. Get into one and you begin to see the problem. Without a watch, one could easily lose track of time. The rooms are so dark, most sitting room lights are on for the better part of the day translating into about 8 hours of unnecessary electricity lighting with a bulb of 22W for a single room. The irony is that, the more efficient a light bulb is, the more expensive it is, making them out of reach for most of these occupants who stand to benefit the most. I am not a prophet of doom but sooner or later the saying; “A chain is only as strong as its weakest link,” becomes more evident.<\/p>\n\n\n\n<p>Anyway, to find the rate of yearly energy consumption for a single bulb-lit room, we compute 22W times 8 hours times 365 days resulting in 64.24 kWh. Multiply this by the 20 to 50 houses you realize that a single block is responsible for approximately 1,284.3 kWh or 1,284.3 units (1 unit = 1 kWh) <strong>[3] <\/strong>in the best-case scenario in unnecessary energy consumption, not forgetting that these calculations account for only one bulb, and most of these households have several bulbs in different rooms. Several such estates exist, an issue that could have been curbed easily by stringent enforcement of legislations pertaining to urban development and planning.<\/p>\n\n\n\n<p>According to the Kenya National Energy Efficiency and Conservation Strategy report, approximately 0.333 Kg of carbon gases are emitted into the atmosphere for every kilowatt hour (kWh) of electricity used within the Kenyan territory, <strong>[4]<\/strong> this factor differs from country to country. The 1,284.3 kWh earlier calculated translates to 423.82 Kg of unnecessary carbon gases emitted per year courtesy of a single poorly planned apartment building alone, it might appear insignificant but cumulatively throughout the country and the world at large the figure becomes prohibitive.<\/p>\n\n\n\n<p>An analysis of the national energy shows heavy dependency on wood fuel and other biomass that account for 68% of the total energy consumption (petroleum 22%, electricity 9%, others account for 1%) <strong>[5].&nbsp; <\/strong>Thousands of tones of  wood fuel are used annually in schools and various institutions of higher learning in Kenya, and &nbsp;it is common to find wood lying in open fields unshielded from the elements. Those responsible for them are oblivious to the fact that wet wood not only has a low heating value and more wood would therefore be required to produce the same effect as relatively fewer dry wood would, but also produces more carbon gases. On top of that, as of 2016 about 80% of Kenya was arid or semi-arid, with the remaining 20% shared between 27 million people and other numerous animals. De-forestation rate was about 0.4 % which translated to around 100K km^2&nbsp; lost every year <strong>[6]. <\/strong>Yet very little is done to replace the lost cover. It is important to understand that forests play a very crucial role in absorbing carbon dioxide hence reduction of carbon gases emitted into the atmosphere, which would have otherwise contributed to global warming. And for this reason, individuals and companies like <a rel=\"noreferrer noopener\" href=\"https:\/\/www.tamuwa.com\/\" target=\"_blank\">Tamuwa Limited<\/a> that bring forth sustainable solutions such as manufacturing of briquettes which have the benefits of among others; burning longer while producing very little to no smoke, ought to be empowered further and encouraged to thrive. This is seeing that hey offer a counter measure towards deforestation and consequently combating climate change.<\/p>\n\n\n\n<p>The carbon trading concept, <strong>[7] <\/strong>if adhered to faithfully among other mechanisms in the war against climate change, might just see the realization of the aim of The Paris Agreement <strong>[2]<\/strong> in time. This would give energy solution companies like <a rel=\"noreferrer noopener\" href=\"http:\/\/eenovators.com\" target=\"_blank\">Eenovators Limited <\/a>an opportunity to not only help other firms and the world achieve its goals of carbon gas emission reduction through effective production processes and renewable energy incorporation hence improved profitability, but also create more employment opportunities for people. In any case, going green will most likely pays off in the long run <strong>[8]<\/strong>.<\/p>\n\n\n\n<p>Although the industrial sector is the biggest contributor to carbon gas emissions, every little effort will go a long way in curtailing the issue at hand. It &nbsp;therefore starts with an individual initiative to create awareness and walk the talk, failure to which a collision course lingers.<\/p>\n\n\n\n<p><strong><u>REFERENCES.<\/u><\/strong><\/p>\n\n\n\n<ol class=\"wp-block-list\" type=\"1\"><li><a href=\"https:\/\/www.wwf.org.au\/what-we-do\/climate\/causes-of-global-warming#gs.yowqi4\">https:\/\/www.wwf.org.au\/what-we-do\/climate\/causes-of-global-warming#gs.yowqi4<\/a><strong><\/strong><\/li><li><a href=\"https:\/\/unfccc.int\">https:\/\/unfccc.int<\/a><strong>&nbsp;<\/strong><\/li><li><strong>Principles of Power Systems by V.K Mehta.<\/strong><\/li><li><a href=\"https:\/\/unepdtu.org\/wp-content\/uploads\/2020\/09\/kenya-national-energy-efficiency-and-conservation-strategy-2020-1.pdf\">https:\/\/unepdtu.org\/wp-content\/uploads\/2020\/09\/kenya-national-energy-efficiency-and-conservation-strategy-2020-1.pdf<\/a><strong><\/strong><\/li><li><a href=\"https:\/\/energypedia.info\/wiki\/Kenya_Energy_Situation\">https:\/\/energypedia.info\/wiki\/Kenya_Energy_Situation<\/a><strong><\/strong><\/li><li><strong>Obar Mark &#8211; KTN report, May 6, 2016.<\/strong><\/li><li><a href=\"https:\/\/www.fern.org\/publications-insight\/what-is-carbon-trading-584\/\">https:\/\/www.fern.org\/publications-insight\/what-is-carbon-trading-584\/<\/a><strong><\/strong><\/li><li><a href=\"https:\/\/www.businessdailyafrica.com\/bd\/lifestyle\/personal-finance\/going-green-could-pay-off-in-trillions-3352904\">https:\/\/www.businessdailyafrica.com\/bd\/lifestyle\/personal-finance\/going-green-could-pay-off-in-trillions-3352904<\/a><strong><\/strong><\/li><\/ol>\n<div class=\"energ-after-content\" id=\"energ-3850828091\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Sephan Ogola I find the phrase: “That is what we usually do, and it works” not only naïve but also dangerous. It exhibits primitive contentment, carelessness and perhaps even irresponsibility. Consequently, invention and innovation are inhibited and without growth and development, humanity is doomed. The fact that something has always worked or produced certain [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3106,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"BLISSFUL IGNORANCE","_seopress_titles_desc":"I find the phrase: “That is what we usually do, and it works” not only naïve but also dangerous. It exhibits primitive contentment, carelessness and perhaps even irresponsibility","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,207],"tags":[],"class_list":["post-3104","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3104","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3104"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3104\/revisions"}],"predecessor-version":[{"id":3115,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3104\/revisions\/3115"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3106"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3104"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3104"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3104"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}