{"id":3125,"date":"2021-05-12T08:17:06","date_gmt":"2021-05-12T08:17:06","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3125"},"modified":"2021-05-12T08:17:07","modified_gmt":"2021-05-12T08:17:07","slug":"time-to-embrace-use-of-biofuels","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-financial-calculator\/time-to-embrace-use-of-biofuels\/","title":{"rendered":"TIME TO EMBRACE USE OF BIOFUELS"},"content":{"rendered":"\n<p>By Nelson Simanto<\/p>\n\n\n\n<p>Kenya has seen a drastic change in fuel prices in the past two years due to an increase taxes and fuel levies. This has led to an increase in price of petroleum products as seen in the prices of kerosene which is retailing 100 Kenyan shillings in 2021 compared to 86 Kenyan shilling  the same period in 2020. It has also seen a rise in the price of liquid petroleum gas which is now retailing at 1000 Kenyan shillings compared to 750 Kenyan shillings per six kilograms. With the ongoing though economic times majorly due to the disruptions of the pandemics on their economic livelihood, most Kenyans who depend on this petroleum products are struggling to afford the prices. This has given biomass startups an upper hand to be competitive in the market with their innovative solutions.<\/p>\n\n\n\n<p>One such startup business is one which is producing biofuel based on methanol which is retailing at 70 Kenyan shillings per litre which is 30% cheaper the kerosine. The biofuel they produce is clean fuel which does not produce unwanted smells and fumes or smoke, Safe as it reduces the accidents of explosions and fires, the fuel is environmentally friendly as its generated form biomass material making it sustainable and it’s easy to ignite with a matchstick.<\/p>\n\n\n\n<p>They have also distribution centers of the local neighborhoods as they have partnered with the local shops to dispense their fuels making it easily available and easy to access. They also have offers on burners making them cheap to access and they are easy to regulate compared to kerosine stove, giving it an edge over kerosine which is mainly dispensed at petrol stations.<\/p>\n\n\n\n<p>Another startup success is one which has seen growth in recent years involves use of biomass waste from rice husks and coconut shell waste to produce briquettes for cooking and heating. The price being competitive as well at 50 Kenyan shillings per kilogram, the briquettes produce a high heating value and longer burning periods 3 times that of convention charcoal and kerosine once ignited, briquettes produced have minimal to no emissions, odorless, no soot hence environmentally friendly and are easily available in local supermarkets and locals’ shops.<\/p>\n\n\n\n<p>Other notable startups are in the electrical space which involve use of solar to generate power for lighting and entertainments. The startups have provided products and services which are cheap to procure as the have set up cheap payment models an example of paying small installments as low as 20 Kenyan shillings per day towards finally owning the equipment’s and selling of the product in local places products are easily available.<\/p>\n\n\n\n<p>Kenyans should embrace this new technology to help in these hard times for their cooking needs while helping reduce over reliance of kerosene which causes major pollution, health effects and to help the startups create employment and continue development of the products and services. As they are already helping in achieving the vison 2030 and the sustainable goals of developments of which the Kenyan government is trying be the leading model in the African continent.<\/p>\n<div class=\"energ-after-content\" id=\"energ-2962939435\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Nelson Simanto Kenya has seen a drastic change in fuel prices in the past two years due to an increase taxes and fuel levies. This has led to an increase in price of petroleum products as seen in the prices of kerosene which is retailing 100 Kenyan shillings in 2021 compared to 86 Kenyan [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3127,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"TIME TO EMBRACE USE OF BIOFUELS","_seopress_titles_desc":"Kenyans should embrace this new technology to help in these hard times for their cooking needs while helping reduce over reliance of kerosene which causes major pollution, health effects and to help the startups create employment and continue development of the products and services","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,197,207],"tags":[],"class_list":["post-3125","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-energy-financial-calculator","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3125","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3125"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3125\/revisions"}],"predecessor-version":[{"id":3128,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3125\/revisions\/3128"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3127"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3125"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3125"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3125"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}