{"id":3149,"date":"2021-06-03T06:44:40","date_gmt":"2021-06-03T06:44:40","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3149"},"modified":"2021-06-03T06:44:40","modified_gmt":"2021-06-03T06:44:40","slug":"does-internship-empower-you-for-job-opportunities","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/does-internship-empower-you-for-job-opportunities\/","title":{"rendered":"DOES INTERNSHIP EMPOWER YOU FOR JOB OPPORTUNITIES?"},"content":{"rendered":"\n<p>By Monica Ngage<\/p>\n\n\n\n<p>Majority of the Kenyan population are the youth who account for around 75% of the total population. Most of these have freshly graduated from universities and colleges. They face a challenge of unemployment with many employers terming them as half-baked during interviews. If this problem is not solved its likely to raise a chain of several other problems like substance abuse, depression, crimes, not forgetting suicidal cases among many others.<\/p>\n\n\n\n<p>So, how do we bridge the gap that exists between “half- baked” graduates and the needs from employers? How do we empower these young people to develop an entrepreneurial mind?<\/p>\n\n\n\n<p>It’s simple. All they need is an internship that will give them hands on experience that is needed in the formal employment sector. In a bid to empower young engineers, Eenovators in collaboration with WE4F is running an internship program for Young Energy Engineers of between 21-30 years dubbed YEEP. This program runs for 6 months and is delivered in 2 phases. The first phase where the students attend a class training for 2 months to understand energy auditing, and the second phase where the student is attached practically at an agrifood facility<\/p>\n\n\n\n<p>How will this program benefit young professionals?<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">1. <strong>Gain valuable experience<\/strong><\/h4>\n\n\n\n<p>We have seen many job adverts highlighting experience as key requirement for the job and you wonder; how do you get 5 yrs experience yet you have just graduated. YEEP gives you an opportunity to gain hands on experience that will boost your CV and make you valuable and marketable for in the job market.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">2. <strong>Opportunity to grow and develop your career<\/strong><\/h4>\n\n\n\n<p>Without the relevant experience, we are highly likely to land into jobs that do not match our career paths. In this case you do not get a chance to develop your career denying you an opportunity to practice in your field of specialization. YEEP therefore offers you an opportunity to work in your desired field and help you build strong skills in your energy career.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">3. <strong>Differentiates you with other job seekers<\/strong><\/h4>\n\n\n\n<p>Graduates with some level of experience often stand out to potential employers. This is because they require less training and they can also handle more responsibilities. YEEP training is all round equipping you with skills in energy auditing, energy efficiency and essential life skills developing you holistically.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">4. <strong>Opportunity to network with professionals in the field<\/strong><\/h4>\n\n\n\n<p>During phase 2 of the YEEP programme which is the internship phase, you have an opportunity to interact with many different professionals in the field who have had vast experience in energy management. You can learn so much from them and some could even be your mentors! And who knows? They might be your connection to your first job!<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">5. <strong>Transition to employment<\/strong><\/h4>\n\n\n\n<p>Many employers will use internships for their recruitment. Interns who exhibit exemplary performance are likely to be absorbed in the company at the end of the internship period. If your work is exemplary in the institution where you have been placed, it is likely that they will offer you an opportunity should it be available or be very willing to recommend you as needed.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">6. <strong>Develop and refine skills<\/strong><\/h4>\n\n\n\n<p>During internship, you are likely to experience problems and challenges that would require you to work on and provide solutions. These can be opportunities for you to try out something that you learnt in school. It can also turn into a business idea that could land you into your own company!<\/p>\n\n\n\n<p>In conclusion, internship has many unforeseen benefits other than financial benefits that you are likely to receive if you get a paid one. I therefore call upon young people to look out for such opportunities to build on their experience &amp; skills. You should not at any time turn down such an opportunity given that it’s unpaid; you could have lost a great opportunity that could have paid you much more than what you have been paid during the internship tenure!<\/p>\n<div class=\"energ-after-content\" id=\"energ-4134815437\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Monica Ngage Majority of the Kenyan population are the youth who account for around 75% of the total population. Most of these have freshly graduated from universities and colleges. They face a challenge of unemployment with many employers terming them as half-baked during interviews. If this problem is not solved its likely to raise [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3151,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"DOES INTERNSHIP EMPOWER YOU FOR JOB OPPORTUNITIES?","_seopress_titles_desc":"So, how do we bridge the gap that exists between “half- baked” graduates and the needs from employers? How do we empower these young people to develop an entrepreneurial mind?","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,207],"tags":[],"class_list":["post-3149","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3149","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3149"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3149\/revisions"}],"predecessor-version":[{"id":3152,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3149\/revisions\/3152"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3151"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3149"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3149"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3149"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}