{"id":3154,"date":"2021-06-07T07:34:40","date_gmt":"2021-06-07T07:34:40","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3154"},"modified":"2021-06-07T07:34:41","modified_gmt":"2021-06-07T07:34:41","slug":"youth-in-energy-empowerment-programme-debunks-common-enginneering-myth","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/youth-in-energy-empowerment-programme-debunks-common-enginneering-myth\/","title":{"rendered":"YOUTH IN ENERGY EMPOWERMENT PROGRAMME DEBUNKS COMMON ENGINNEERING MYTH"},"content":{"rendered":"\n<p>By Carolyne Gathuru<\/p>\n\n\n\n<p>There’s a huge debate!&nbsp; A typical debate scenario with the proposers and opposers taking the stand. The motion in question and the topic under dispute in the debate is the statement:<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><em>‘Soft’ skills are more impactful than ‘hard’ skills in the workplace for Engineers<\/em><\/h4>\n\n\n\n<p>The opposers of the motion are found in the results of the Energy Professionals Training Survey 2021 where Energy professionals when asked an open-ended question on other essential skills to learn, Analytical Skill or Data Analytics were the top preferred skills with a 16.7% rating over the others. Energy Audit was the second most preferred skills at 15.2% and other top skills included, solar PV skills at 10.6%), Artificial Intelligence, Project management and energy management each accounting for 9.1%. The list did not contain any of the ‘soft’ skills, nowadays more aptly known as people management skills or essential skills. Energy engineers particularly, from this survey are more skewed to building their technical capacities in preference to their personal development capacities.<\/p>\n\n\n\n<p>Both Forbes Magazine and the World Economic Forum 2019\/2020 indicate that the ten top key skills required for success at the work place, irrespective of the specific profession include; Learnability, Resilience, Agility, Collaboration, Verbal and Written Communication, Empathy, Creativity, Problem Solving, Leadership and Negotiation. Both resources go further to say that the future of work given the rapidly changing world needs and the malleability of the workplace, require twelve key competencies to survive. The future-of-work competence list is largely in congruence with the critical skills list, and includes:&nbsp; Creativity, Emotional Intelligence, Analytical and Critical Thinking, Active Learning, a Growth Mindset, Judgement and Decision making, Interpersonal Skills, Leadership, Diversity and Cultural Intelligence, Tech skills and Embracing change.<\/p>\n\n\n\n<p>The Youth in Energy Empowerment Programme a joint collaboration between Eenovators Ltd and GIZ-WE4F (GESELLSCHAFT FÜR INTERNATIONALE ZUSAMMENARBEIT- Water and Energy for Food programme) specific project <em>&#8211; “Building ESCO Models for Promotion of Food Security through Water and Energy Management with a Focus on Youth Empowerment”, <\/em>stands on the debate proposers side that pushes to communicate the importance of growing holistic energy professionals who have the capacity to lead and implement change through excellent people skills.<\/p>\n\n\n\n<p>The firs cohort of this programme is well underway currently in their 6<sup>th<\/sup> month, and in addition to the technical training undertaken, essential skills lessons continue to be infused in the YEEP curriculum. The following training focus areas and delightful outcomes have been experienced thus far:<\/p>\n\n\n\n<p><strong>The Art of Communication<\/strong> – The Energy Engineers received a heavy dose of communication excellence training inputs needed to ensure on the ground excellence. The need for energy change is anchored on the need to positively influence different stakeholders towards getting buy in for the desired output. Communicating with excellence is the key that unlocks the door to the much-needed energy change. Armed with knowledge and tips on how to overcome barriers to communication, how to handle common communication fails, and how to pitch ideas and present reports to different audiences purposefully, the YEEP professionals have hit the ground running at their respective internship host sites. Feedback from the ground after one month of activity indicate that having been equipped with the tools to communicate better, has led to gains and mileage that would hitherto not have been achieved. The impact of this has been demonstrated by Albert Kibiwott, one of the YEEP professionals, taking center stage in the latest Energy Professionals Round Table Webinar, a forum that brings together energy professionals from around the world to discuss pertinent energy matters, focus on knowledge transfer and develop actions for implementation. Kibiwott as one of the key note speakers, presented the need for inclusivity of the youth in the sustainable projects as a useful strategy to achieve project success, as well as covered the key tenets of the challenges facing young energy professionals in the continent and the proposed solutions to over come these. His call to action for energy professionals was to guide the youth on how to access sustainable project funding, as well as a call to the government and other funding bodies to customize funding programmes to fit the youth agenda. The reception of Kibiwott’s persuasive and informative communication, speaking directly for the youth as changemaker, was very welcome by the energy professionals in attendance during the webinar. <em>Are ‘Soft’ skills more impactful than ‘hard’ skills in the workplace for Engineers? <\/em>The WED webinar jury of participants has made a decision on this one!<\/p>\n\n\n\n<p><strong>Personal Branding Skills<\/strong> – To positively influence change, one has to be seen to walk the talk of that change, and to convey sufficient confidence through both spoken and unspoken demeanour. The need for energy engineers tasked with the arduous task of getting communities and different stakeholders to place sustainable resource management at a priority level, to be a voice that can be listened to is paramount. This has called for the YEEP professionals to embraced the training they received and to define and enhance their personal brands to be impactful at their practicum sites. It is said that people listen to people they respect, and as such developing a personal brand that stands for a desirable value system is a key tool in the energy transformation space. Demonstrating professionalism and conducting selves with professional etiquette has been the modus operandi on the ground at the different agro and food production sites of placement. This has so far had all the YEEP attachees receive a very warm welcome from the teams on site. From the experience of Richard Ojunga currently at Wildfire Flowers, branding oneself to learn on the go and to be coachable, and not make the assumptions and take on the brand of knowing-it-all has been helpful. He says: <em>“VITU KWA GROUND NI DIFFERENT” Is a phrase you might hear being commonly used by Kenyans, usually shortened to “Vitu kwa ground” or “Vitu kwa grao”, which directly translates to “Things on the ground (are different)”. It’s often used to express how differently actual happenings can vary from expectations. Just a month into the internship program on the ground at my host site Wildfire Flowers, and I can relate to the aforementioned saying. There is a staggering amount of, often new, information to process and relate with the theory that our trainers ensured we were well-versed in. Don’t get me wrong, I believe that all members of the first YEEP cohort are branded and ready for the deep-end. We are slowly but surely removing the floaters as we get our footing in, and get more accustomed to the vast facets energy management has to offer &#8212; which go well beyond arithmetic calculations. <\/em>&nbsp;&nbsp;<strong><em>Are ‘Soft’ skills more impactful than ‘hard’ skills in the workplace for Engineers?<\/em><\/strong>The workforce on the ground at the different host sites have made a decision on this one!<\/p>\n\n\n\n<p><strong>Leading with Excellence<\/strong> – John Maxwell, acclaimed author and strategic management professional on leadership excellence has a much-tooted quote that indicates ‘Leadership is influence, nothing more and nothing less!’. This has been the situation on the ground with the YEEP professionals who have the ambitious objectives of setting up energy committees at the different organizations where they are attached, and to lead energy, water and food management best practice. Where a committee may be found to already be in place, their further objective is to ensure that the committee has its resource management action plan in place, and is delivering on the planned actions. This has called for the YEEP team members to step up and take their places at the table of leadership excellence and to determine the paths to follow to lead the organization to energy change. The leadership training they underwent has been of value. &nbsp;Direct feedback from Irvine Koech reporting live from the ground at Ol Njoruwa( Mbegu Farm) where he is attached, demonstrates leadership excellence as follows: <em>“I have identified an area of focus to enhance the Energy Conservation awareness among the workforce at the farm. This is a challenge that I am confident that I can overcome within the next couple of months. I intend to leverage my cordial relationship with senior management to develop sound policies and training programs geared towards enforcing behavioral change<\/em> <em>I can proudly say that I am &#8220;living my best life&#8221; at Ol-Njoruwa<\/em>. <em>My daily interaction with the workers and staff at the farm has exposed me to different life experiences.<\/em>” This is leadership and people management excellence being applied in a live environment by an energy engineer in training. <strong><em>Are ‘Soft’ skills more impactful than ‘hard’ skills in the workplace for Engineers?<\/em><\/strong>The feedback on the ground is a testament of the power of leadership and people management!<\/p>\n\n\n\n<p><strong>Emotional Intelligence<\/strong> – Psychologists equate emotional intelligence to wisdom. Leadership lessons call upon leaders to harness the power of emotional intelligence as a key ingredient for successful leadership at all levels. That EQ trumps IQ any time, and that lack of EQ has brought down many a world leader, is not in dispute. The YEEP professionals therefore ahead of progressing with the second half of the programme, underwent sessions with EI practitioners from both a training and practical application angle, to plant the seeds to nurture emotional intelligence as much needed workplace and personal life competence. Emotional intelligence as a differentiator will continue to set apart the professionals in this programme, with their current practical tips and guidelines designed to empower them to handle different life and workplace situations. This includes challenging people interactions that may present in different formats. With a boost towards managing self and others through: self-motivation, awareness and control as well as empathy and interpersonal skills, &nbsp;Cohort 1 of the YEEP programme have had a more empowered landing on the ground. Feedback from Gideon Omangi currently attached at Cargill Kenya Ltd comprises of an emotionally intelligent frame of mind as follows: <em>“My first week at Cargill was first about the people. As one of our instructors told us, “the people on the ground are the greatest asset in energy management”. I had to work on developing an understanding at a friendship level with the staff at the facility. I was placed in the maintenance department and they are doing a good job at making me feel at home. In this period, I also learnt the culture of the staff, which I am still learning, hoping that with this knowledge I can easily effect change, even in behavioral aspects that will improve energy efficiency. <\/em>The strategy to work amicably and entrench self with others rather than work from the outside in demonstrates great EI.<strong><em> Are ‘Soft’ skills more impactful than ‘hard’ skills in the workplace for Engineers?<\/em><\/strong>The wisdom at work in the mind frame and day to day execution on the ground here provide an answer to this debate!<\/p>\n\n\n\n<p>The impact witnessed both a personal and professional level, and the effects on the ground with key stakeholders in the different circles of influence, are an exaltation of where the place of essential skills or people development skills should be in the realm of career excellence for technical professionals. It is one thing to be well trained and have the expertise to deliver technically apt solutions, but it is another thing to be able to work harmoniously with others and to provide inroads by which organizations and communities may be transformed. The impact of the YEEP professionals having completed six months of the programme is high level and speaks volumes into Africa’s implementation of the global SDGs 4 on lifelong learning, 2 on zero hunger, 3 on good health and wellbeing and 7 on clean energy and energy efficiency.<\/p>\n\n\n\n<p>The sky is no longer the limit for this cohort, with the great strides made so far, and in the timeframe this great impact has been felt so far, going beyond the sky in the flight to energy transformation greatness is an achievable dream.<\/p>\n<div class=\"energ-after-content\" id=\"energ-85908886\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Carolyne Gathuru There’s a huge debate!&nbsp; A typical debate scenario with the proposers and opposers taking the stand. The motion in question and the topic under dispute in the debate is the statement: ‘Soft’ skills are more impactful than ‘hard’ skills in the workplace for Engineers The opposers of the motion are found in [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3156,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"YOUTH IN ENERGY EMPOWERMENT PROGRAMME DEBUNKS COMMON ENGINNEERING MYTH","_seopress_titles_desc":"There’s a huge debate; A typical debate scenario with the proposers and opposers taking the stand. The motion in question and the topic under dispute in the debate is the statement: ‘Soft’ skills are more impactful than ‘hard’ skills in the workplace for Engineers","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,207],"tags":[],"class_list":["post-3154","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3154","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3154"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3154\/revisions"}],"predecessor-version":[{"id":3157,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3154\/revisions\/3157"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3156"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3154"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3154"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3154"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}