{"id":3163,"date":"2021-06-16T09:08:25","date_gmt":"2021-06-16T09:08:25","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3163"},"modified":"2021-06-18T08:20:12","modified_gmt":"2021-06-18T08:20:12","slug":"my-yeep-internship-experience-at-cargill-limited","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/youth-empowerment\/my-yeep-internship-experience-at-cargill-limited\/","title":{"rendered":"MY YEEP INTERNSHIP EXPERIENCE AT CARGILL LIMITED"},"content":{"rendered":"\n<p>By Gideon Omangi<\/p>\n\n\n\n<p>On 3<sup>rd<\/sup> May, the ship left the yard, to test the wild waters, to prove itself and the workmanship of its builders. I can also say troops were sent into war, each to his front in the battle. Better still, the treasure hunt began; trained and skilled, the hunters broke forth seeking the prize.&nbsp; The first cohort of the <a href=\"https:\/\/eenovators.com\/youth-in-energy-empowerment-program-yeep\/\" target=\"_blank\" rel=\"noreferrer noopener\">Youth in Energy Empowerment Program, YEEP<\/a>, began their industrial assignments. Being one of them, the rubber met the road for me at <a href=\"https:\/\/www.cargill.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Cargill Kenya<\/a>.<\/p>\n\n\n\n<p><a rel=\"noreferrer noopener\" href=\"https:\/\/www.cargill.com\/\" target=\"_blank\">Cargill<\/a> is a global conglomerate in the Agro-food sector that is committed to helping the world thrive through nourishment. In Kenya, the company has its base in Nakuru and Mombasa. In Nakuru, grains including wheat, barley, canola, sorghum etc. are processed and stored. The plant also has a subsidiary that prepares maize seeds for planting. In line with the <a href=\"https:\/\/eenovators.com\/youth-in-energy-empowerment-program-yeep\/\" target=\"_blank\" rel=\"noreferrer noopener\">YEEP<\/a> program’s objective of enabling energy efficiency and adoption of clean energy technologies in the agri-food sector, <a href=\"https:\/\/www.cargill.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Cargill<\/a> stands out as an important beneficiary.  I have been at the Nakuru facility for three weeks now and I am going to shed light on my vision, my duties and how it has been thus far.<\/p>\n\n\n\n<p>My goal for this internship project is to sharpen my skills in energy management and to add, on top of the theoretical knowledge, industrial experience that will help me develop into a professional in the energy realm. Besides building myself, the overarching goal is to improve the energy situation at <a href=\"https:\/\/www.cargill.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Cargill<\/a>. The fundamental role of energy management is to enable a facility get more for less. More in this case is not limited to financial income but several other benefits that will improve the performance of <a href=\"https:\/\/www.cargill.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Cargill<\/a> in the global market. My vision is to cut down the plant’s energy expenditure, initiate environment and energy conscious projects, and to enlist Cargill’s staff to the larger army of individuals with sustainability at heart.<\/p>\n\n\n\n<p>My first week at <a href=\"https:\/\/www.cargill.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Cargill<\/a> was first about the people. As one of our instructors told us, “the people on the ground are the greatest asset in energy management”. I had to work on developing an understanding at a friendship level with the staff at the facility. I was placed in the maintenance department and they are doing a good job at making me feel at home. In this period, I also learnt the culture of the staff, which I am still learning, hoping that with this knowledge I can easily effect change, even in behavioral aspects that will improve energy efficiency.<\/p>\n\n\n\n<p>With the help of the maintenance team and other members of staff, I was taken through the factory process, severally. This has been helpful in enabling me understand the role of each sub-process and later their impact in energy terms. I am also working on a process model that will highlight the role of each section and the energy consumed. This will help in determining which process flows are necessary and which improvements will promote efficiency. The walkthroughs also helped identify low hanging fruits, the passive energy efficiency measures that are cheap to adopt. There were few passive efficiency opportunities, a positive sign of <a href=\"https:\/\/www.cargill.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Cargill’s<\/a> commitment to proper energy management.<\/p>\n\n\n\n<p>The second week was more about the paperwork. I went through past energy audit reports to understand what had been done and that which is yet to be implemented. I noted some projects that need attention as they were presented to be having a great potential.&nbsp; The report helped get a more detailed understanding of the plants energy use including the cost in procuring energy. With the past energy expenditure as a reference point, it will be useful in tracking our progress and really see how impactful my presence will be at the facility.&nbsp;<\/p>\n\n\n\n<p>The third week has so far been the most challenging. We set up an energy committee for <a href=\"https:\/\/www.cargill.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Cargill<\/a>. I came up with objectives and functions for the committee but the challenge was how to effectively communicate the objectives to the committee and induce a passion for energy management.  As an engineer, it is easy to make machines do what you want; I have realized it is more paramount to be able to convince people to adopt your ideas. To make sure that the committee did not just look into the electricity bill alone, we framed it to be a natural resource committee that discusses water, fuel and even grains with the aim of improving sustainability. We also demonstrated the e-gauge meters to the energy committee. This offered a baseline, a knowledge on how the plant consumes it energy. It is said, “You can’t plan a route to where you want to go unless you know where you are”. The meter offers real time tracking of key performance indicators. With the meter, we were able to validate and even invalidate some measures highlighted in the previous report.<\/p>\n\n\n\n<p>My experience has been more of finding a path in the dark. I am grateful to the <a href=\"http:\/\/eenovators.com\" target=\"_blank\" rel=\"noreferrer noopener\">Eenovators<\/a> team who have been handy with ideas and instructions that are improving my practice. I hope by the end of the internship period I would have effected change at <a href=\"https:\/\/www.cargill.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Cargill<\/a> and taken part in feeding the world sustainably. As Admiral Rickover put it, “Good ideas are not adopted automatically. They must be driven into practice with courageous patience”. The grind continuous.<\/p>\n<div class=\"energ-after-content\" id=\"energ-3425807242\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Gideon Omangi On 3rd May, the ship left the yard, to test the wild waters, to prove itself and the workmanship of its builders. I can also say troops were sent into war, each to his front in the battle. Better still, the treasure hunt began; trained and skilled, the hunters broke forth seeking [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3165,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"MY YEEP INTERNSHIP EXPERIENCE AT CARGILL LIMITED","_seopress_titles_desc":"On 3rd May, the ship left the yard, to test the wild waters, to prove itself and the workmanship of its builders. I can also say troops were sent into war, each to his front in the battle","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[207],"tags":[],"class_list":["post-3163","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3163","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3163"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3163\/revisions"}],"predecessor-version":[{"id":3230,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3163\/revisions\/3230"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3165"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3163"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3163"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3163"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}