{"id":3167,"date":"2021-06-16T09:16:14","date_gmt":"2021-06-16T09:16:14","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3167"},"modified":"2021-06-18T07:01:24","modified_gmt":"2021-06-18T07:01:24","slug":"my-yeep-internship-experience-at-ol-njorowa-mbegu-farm","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/youth-empowerment\/my-yeep-internship-experience-at-ol-njorowa-mbegu-farm\/","title":{"rendered":"MY YEEP INTERNSHIP EXPERIENCE AT OL-NJOROWA (MBEGU FARM)"},"content":{"rendered":"\n<p>By Koech Irvine Kiplangat<\/p>\n\n\n\n<p>After sitting for the Energy Audit Technician exam administered by the <a href=\"https:\/\/iepa.org.za\/\" target=\"_blank\" rel=\"noreferrer noopener\">Institute of Energy Professionals in Africa (IEPA)<\/a>, every <a rel=\"noreferrer noopener\" href=\"https:\/\/eenovators.com\/youth-in-energy-empowerment-program-yeep\/\" target=\"_blank\">YEEP<\/a> Cohort 1 team member had the chance to choose where they wanted to go for their internship. Having lived in Nairobi for a while, I yearned for something different. On May 3<sup>rd<\/sup> 2021, I officially started my internship at Ol-Njorowa (Mbegu Farm) in Naivasha. Ol-Njorowa is a flower farm in Naivasha that grows and exports over 13 varieties of roses. (Click <a rel=\"noreferrer noopener\" href=\"https:\/\/www.frescoflowers.nl\/en\/roses\/\" target=\"_blank\">here<\/a> to check them out). The first time I set foot on the company&#8217;s premises, I was awestruck. Not only are the lawns well-manicured, but also you get to see over a hundred Solar PV Modules on the roof of the largest building the moment you walk through the gate. Right there, I knew that my gamble had significantly paid off. I had always wanted to work in a facility that was very conscious about Energy Efficiency.<\/p>\n\n\n\n<p>(<em>My work station is within the aforementioned building. In the background, you can see the Solar Inverters that make it possible for the facility to use the energy from the sun in running their machinery<\/em>).<\/p>\n\n\n\n<p>It is customary for every intern at an organization to be assigned a supervisor. &nbsp;Well, I report to two supervisors – Mr. Anthony Macharia and Mr. Joseph Opindi. They both happen to be the only electricians at the facility. When you are new in an organization, you always wonder if your superiors will like and respect you. After the first two days at work, my supervisors and I had already established a healthy rapport. As a Mechanical Engineering graduate, my knowledge of electrical systems is quite limited. Mr. Macharia and Mr. Opinde took me under their wings. They slowly began to teach me about the electrical systems at the facility. It feels nice to relate some of the things I learned from the Energy Auditing Technician Course Manual to what is happening on the ground.<\/p>\n\n\n\n<p>For the past three weeks, my supervisors and I have developed a routine that works for us. Every morning, they have to report to the General Manager, Mr. David Mousley, to update him on what&#8217;s been happening on the farm. They also get to receive instructions on what ought to be done during the day. Ol-Njorowa comprises of two sections; the Top Farm and the Lower Farm. Within the 21 hectares of land, there are 26 greenhouses, 2 Fertigation Houses, 1 Pack House, among other facilities. Each of the farms is enclosed by an electric fence. After their daily meeting with the General Manager, I meet up with my supervisors to allocate work amongst ourselves. I get to tag along with any of them, depending on the day&#8217;s workload. There are days when we get to do cool technical stuff such as installing new power supply lines and repairing equipment that have broken down. On the slow days, we get to do other mundane activities such as patrolling the electric parameter fence to identify areas where short-circuits have occurred. At the end of every day, I have to jot down the day&#8217;s activities in a logbook.<\/p>\n\n\n\n<p>During the first few days at the farm, I was very eager to identify Energy Management Opportunities (EMOs). I diligently walked around the farm, taking notes on what I had seen. When I walked into the Pack House, where rose flowers are graded and packed, I found that the lights were still on at 11 am. I took note of this issue and sought to find out why this was happening from one of my supervisors. A few hours later, I found myself in one of the greenhouses. I struck a conversation with one of the ladies who was harvesting the flowers. She was warm and receptive. As she went about her work, she explained that a lot of work goes into planting and harvesting roses.<\/p>\n\n\n\n<p>Growing flowers is a labor-intensive activity. There’s a lot to be done in terms of planting, pruning, spraying, harvesting, storing, packing and grading. A handful of soil usually contains hundreds of bacteria and pests known as nematodes. The flowers have to be sprayed with a wide array of chemicals to control the pests. This is why it is important for everyone at the facility to wear the appropriate PPEs at all times. Failure to spray the flowers would result in enormous losses for the company because the have to adhere to rigorous quality control protocols before they are exported. Discoloration on the petals and leaves of the flower caused by pests such as mites and aphids or fungi such as powdery mildew would result in the rejection of that particular flower. Furthermore, if a flower were slightly bent, it wouldn&#8217;t make the cut for export. She went ahead and explained that everything has to be inspected by the women at the Pack House in charge of grading. Therefore, they need to work in a well-lit environment to identify the minute defects and pests hiding in the flowers. That explains why the Pack House had most of the lights on during the day. From my encounter with her, I learned a valuable lesson – <em>technical people<\/em> ar<em>e not<\/em><em> the only custodians of knowledge when it comes to Energy Management.<\/em> &nbsp;As an Energy Auditor, you need to appreciate that every person you meet has something new to teach you.<\/p>\n\n\n\n<p>Despite the well-organized nature of operations at Ol-Njorowa and the friendly attitude of the workforce, my experience thus far has not been devoid of any challenges. Most of them stem from technical issues that I am yet to grasp fully. Whenever I look at the data on the <a href=\"https:\/\/eenovators.com\/eagles-portal\/\" target=\"_blank\" rel=\"noreferrer noopener\">Eagles Platform<\/a>, sometimes I am unable to make sense of what is being recorded by the e-gauge meters. Therefore, I raised this issue with the Energy Engineers and my mentor, Eng. Jabes Manyala. Consequently, the technical team at<a href=\"http:\/\/eenovators.com\" target=\"_blank\" rel=\"noreferrer noopener\"> Eenovators Limited<\/a> created a WhatsApp Group where all the interns can ask questions on things they don&#8217;t understand. This platform has helped me tremendously because the Energy Engineers&#8217; tutorials have enabled me to bridge some of the knowledge gaps that I had. Another challenge lies in the lack of Energy Conservation awareness among the workforce at the farm. However, this is a challenge that I am confident that I can overcome within the next couple of months. I intend to leverage my cordial relationship with senior management to develop sound policies and training programs geared towards enforcing behavioral change.<\/p>\n\n\n\n<p>In conclusion, I can proudly say that I am &#8220;living my best life&#8221; at Ol-Njorowa. My daily interaction with the workers and staff at the farm has exposed me to different life experiences. I don&#8217;t miss the city at all! I can&#8217;t wait to continue growing personally and professionally for the next couple of months.<\/p>\n<div class=\"energ-after-content\" id=\"energ-2032867670\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Koech Irvine Kiplangat After sitting for the Energy Audit Technician exam administered by the Institute of Energy Professionals in Africa (IEPA), every YEEP Cohort 1 team member had the chance to choose where they wanted to go for their internship. Having lived in Nairobi for a while, I yearned for something different. On May [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3169,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"MY YEEP INTERNSHIP EXPERIENCE AT OL-NJOROWA (MBEGU FARM)","_seopress_titles_desc":"On May 3rd 2021, I officially started my internship at Ol-Njorowa (Mbegu Farm) in Naivasha. Ol-Njorowa is a flower farm in Naivasha that grows and exports over 13 varieties of roses","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[207],"tags":[],"class_list":["post-3167","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3167","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3167"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3167\/revisions"}],"predecessor-version":[{"id":3228,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3167\/revisions\/3228"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3169"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3167"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3167"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3167"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}