{"id":3171,"date":"2021-06-16T09:21:40","date_gmt":"2021-06-16T09:21:40","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3171"},"modified":"2021-06-18T06:51:46","modified_gmt":"2021-06-18T06:51:46","slug":"my-internship-experience-at-kenchic-mlolongo","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/youth-empowerment\/my-internship-experience-at-kenchic-mlolongo\/","title":{"rendered":"MY INTERNSHIP EXPERIENCE AT KENCHIC MLOLONGO"},"content":{"rendered":"\n<p>By Cherrily Shikweya<\/p>\n\n\n\n<p>Nothing prepares you for the experience that awaits you in anything you do for the first time or places you visit for the first time, and the associated excitement, anxiety, new people, new environment, and the new routine. It was no different when I got an internship opportunity at <a href=\"https:\/\/www.kenchic.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Kenchic <\/a>Mlolongo. Joining <a href=\"https:\/\/eenovators.com\/youth-in-energy-empowerment-program-yeep\/\" target=\"_blank\" rel=\"noreferrer noopener\">YEEP<\/a> for the first time had me excited to explore and learn more about energy and energy management. After the end of phase 1, I could not wait to hit the ground running and practice what I had learned in the classroom. My expectation of the internship program was to grow even further as an energy professional and as a person.<\/p>\n\n\n\n<p>I officially reported to <a href=\"https:\/\/www.kenchic.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Kenchic<\/a> Mlolongo on 3<sup>rd<\/sup> May 2021. I received a warm welcome. The staff and colleagues have been helpful and supportive. Every day has been a learning opportunity as my colleagues explain to me how the machines work and show a willingness to explain the operations in the company that I have no grasp of, wherever necessary. I have received guidance from the team at <a href=\"http:\/\/eenovators.com\" target=\"_blank\" rel=\"noreferrer noopener\">Eenovators<\/a> and my mentor making the process of settling in at <a href=\"https:\/\/www.kenchic.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Kenchic<\/a> smoother, and the audit experience easier. The team at <a href=\"https:\/\/www.kenchic.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Kenchic<\/a> has also been at the forefront at keeping me on toes with their frequent questions and follow-ups. They are interested in lowering their energy consumption and have made it clear that they will give me the much support I need. This is an encouragement even as I continue with the internship.<\/p>\n\n\n\n<p>I have learnt so much already for the short period I have been here. I have learnt about the incubation process, and the critical control points in the same. I am still in the process of learning the operation of incubation machines. I have had hands-on interaction with machines like chillers, HVACs, boilers, air compressors, fans, and pumps. I have witnessed the production and vaccination of day-old chicks, which to me is simply fascinating. Furthermore, I am learning about solar systems and sizing and have worked on a few theoretical scenarios. Over the period, I have also had the opportunity to review the company’s previous Energy Audit Report and learnt the detail that goes into preparing such a report, including analysis of power, water, and fuel and production data. From the report and discussions with colleagues, I have gained a wider perspective of the Energy Audit process, and generally energy management in the country.<\/p>\n\n\n\n<p>So far, a number of my expectations have been met. I have interacted with systems I had learned about during the class training and now looking into ways of conserving energy in their use here at <a href=\"https:\/\/www.kenchic.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Kenchic<\/a>. I am so grateful to be at this site for my internship, and I like that I get to be involved in their energy management projects. I trust that by the end of period of internship I will have identified measures that the company can adopt so as to conserve energy, and ultimately make savings.<\/p>\n\n\n\n<p>I must say, I am impressed by the fact that the staff here are already conscious of energy management and have a few measures here and there to minimize energy waste. In fact, at my arrival, they already had plans of implementing some energy saving projects, which I will be privileged to witness and contribute to while I am here. One more thing stands out for main this place, the commitment to ensuring quality chick production. As such, biosecurity is very important and is maintained to the letter. It is also my first time being at a company whose production is live, and seeing the attention that goes into the process still wows me a month later.<\/p>\n\n\n\n<p>I feel like I have grown in knowledge and skill, and that I am on the right path towards my career growth. While the classroom experience was so impactful, being at <a href=\"https:\/\/www.kenchic.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Kenchic<\/a> has been even more challenging and fun. I am equally challenged as a woman in engineering to contribute positively to the energy status of this company and consequently my country.  I am proud of myself for coming this far, and grateful to <a href=\"http:\/\/eenovators.com\" target=\"_blank\" rel=\"noreferrer noopener\">Eenovators Ltd<\/a>, Institute of Energy Professionals Africa, and <a href=\"https:\/\/www.kenchic.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Kenchic<\/a> for this opportunity of a lifetime. I can’t wait for the lessons that await as I proceed with the <a href=\"https:\/\/eenovators.com\/youth-in-energy-empowerment-program-yeep\/\" target=\"_blank\" rel=\"noreferrer noopener\">YEEP<\/a> program. To describe this experience in one word, I would definitely go for epic!<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Biography<\/h4>\n\n\n\n<p>Cherrily Shikweya is a trainee in the <a href=\"https:\/\/eenovators.com\/youth-in-energy-empowerment-program-yeep\/\" target=\"_blank\" rel=\"noreferrer noopener\">Youth in Energy Empowerment Program (YEEP)<\/a> with a background in Chemical and Process Engineering. She is passionate about renewable energy, Water and Energy resources management, and Social Impact. She currently trains as an Energy Audit Technician with the <a href=\"https:\/\/iepa.org.za\/\" target=\"_blank\" rel=\"noreferrer noopener\">Institute of Energy Professionals<\/a> and <a href=\"http:\/\/eenovators.com\" target=\"_blank\" rel=\"noreferrer noopener\">Eenovators Limited<\/a>.<\/p>\n\n\n\n<p>Cherrily enjoys reading news articles, travelling, and spending time with family and friends.<\/p>\n<div class=\"energ-after-content\" id=\"energ-1911377462\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Cherrily Shikweya Nothing prepares you for the experience that awaits you in anything you do for the first time or places you visit for the first time, and the associated excitement, anxiety, new people, new environment, and the new routine. It was no different when I got an internship opportunity at Kenchic Mlolongo. Joining [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3173,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"","_seopress_titles_desc":"The staff and colleagues have been helpful and supportive. Every day has been a learning opportunity as my colleagues explain to me how the machines work and show a willingness to explain the operations in the company that I have no grasp of, wherever necessary","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[207],"tags":[],"class_list":["post-3171","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3171","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3171"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3171\/revisions"}],"predecessor-version":[{"id":3226,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3171\/revisions\/3226"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3173"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3171"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3171"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3171"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}