{"id":3175,"date":"2021-06-16T09:28:27","date_gmt":"2021-06-16T09:28:27","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3175"},"modified":"2021-06-18T06:43:05","modified_gmt":"2021-06-18T06:43:05","slug":"the-beginning-of-my-career-life-at-kapa","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/youth-empowerment\/the-beginning-of-my-career-life-at-kapa\/","title":{"rendered":"THE BEGINNING OF MY CAREER LIFE AT KAPA"},"content":{"rendered":"\n<p>By Patrick Kanyuira<\/p>\n\n\n\n<p>It is always a dream come true for any student to finally join the working class, mainly with the zeal and aim to gain the mostly coveted thing-the practicability of your class work. I was too in such bandwagon not long ago. After the vigorous class training, now the mantle was greatly passed to us to go and implement. As I can recall the profound morning, very set to go and make use of skills gained though theoretical training, I walked to my attached institution; <a rel=\"noreferrer noopener\" href=\"https:\/\/www.kapa-oil.com\/\" target=\"_blank\">KAPA Oil Refinery<\/a> (glad to be given this maiden opportunity to join them) I was bit nervous about what was expected of me, but full of the desire to showcase how impactful my training had been.<\/p>\n\n\n\n<p>The first day majorly focused on getting to know the team in the organization. Having eight different plants, it was clear I had a task to get to know people. The plants are managed by the <a href=\"https:\/\/www.kapa-oil.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">KAPA<\/a> staff, who are the minority thus it was an easier task to get to know some of them the first day. The majority comprised of the contractual staff, who form the main backbone of the workmanship. To get to know all these staff would be an unattainable task, but I was determined to walk through the uphill to get colossal know of them.<\/p>\n\n\n\n<p>As it is put in African society, you are only a visitor on the first day and a member from there onwards. &nbsp;It was now officially time for the rubber to hit the road. Coming to the organization with the objectives of improving energy efficiency, first we had to understand energy sources and points of use. With guidance of our supervisor engineer Mwashigadi Phanuel, we began with the electrical energy. The institution is served with utility mains of 66\/11 KV from KPLC and solar energy with production capacity of around 1.3 MW both KPLC and solar were coupled and KPLC power acts as reference point for the solar. There are also generators which act as back up source.<\/p>\n\n\n\n<p>With understanding of the power sources in the organization, we now focused on different points of use. The first plant we went to was the detergent plant. It is here I got to understand the processes involved from the sulphonation to the packing process. This experience made me note that it was not only electrical energy consumption required, but also steam was greatly utilized. This made me widen the scope objectives I had expected. I had to retrofit my objectives so as to cover all the energy aspects at ago.<\/p>\n\n\n\n<p>Without forgetting, I now have a true picture of how one’s safety is the first concern. In my few days at the organization I have noted that no one is allowed to enter any plant without adhering to structured safety measures. Due to the effects of Covid 19, water washing points are always within one’s vicinity. Protection of oneself is not a discussion here, it is automatic. There are also posters all over the place to serve as reminders. Luckily for me this was not a struggle as already our tutors had made us aware during the training that safety is always first priority.<\/p>\n\n\n\n<p>To my favorite part – the food served in the canteen. First, one is allowed to carry their own food but strictly vegetarian meal, meat and meat products are not allowed. At the canteen, there is one meal I am not getting enough of, the non-meat pizza. This is the sweetest meal (I have no doubt) that one can get in the universe. Each morning I am motivated to get to work knowing no matter how bad the day may be; of which none has occurred as yet, I am going to have a taste of this great pizza.<\/p>\n\n\n\n<p>In conclusion, I can clearly state that I am enjoying this splendid experience at <a href=\"https:\/\/www.kapa-oil.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">KAPA<\/a>, learning a lot, putting to practice the training I received and I and looking forward to longer and better days here.<\/p>\n<div class=\"energ-after-content\" id=\"energ-371236705\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Patrick Kanyuira It is always a dream come true for any student to finally join the working class, mainly with the zeal and aim to gain the mostly coveted thing-the practicability of your class work. I was too in such bandwagon not long ago. After the vigorous class training, now the mantle was greatly [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3208,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"THE BEGINNING OF MY CAREER LIFE AT KAPA","_seopress_titles_desc":" As I can recall the profound morning, very set to go and make use of skills gained though theoretical training, I walked to my attached institution; KAPA Oil Refinery I was bit nervous about what was expected of me, but full of the desire to showcase how impactful my training had been","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[207],"tags":[],"class_list":["post-3175","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3175","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3175"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3175\/revisions"}],"predecessor-version":[{"id":3224,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3175\/revisions\/3224"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3208"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3175"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3175"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3175"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}