{"id":3183,"date":"2021-06-16T09:45:42","date_gmt":"2021-06-16T09:45:42","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3183"},"modified":"2021-06-18T06:30:45","modified_gmt":"2021-06-18T06:30:45","slug":"my-energyzed-yeep-internship-experience-at-kapa","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/youth-empowerment\/my-energyzed-yeep-internship-experience-at-kapa\/","title":{"rendered":"MY ENERGYZED YEEP INTERNSHIP EXPERIENCE AT KAPA"},"content":{"rendered":"\n<p>By Gloria Maruti<\/p>\n\n\n\n<p>It is said that a journey of a thousand miles begins with a single step. As a fresh graduate eager to venture into the working society, I was ready to take the first step in my career when an opportunity to join the <a rel=\"noreferrer noopener\" href=\"https:\/\/eenovators.com\/youth-in-energy-empowerment-program-yeep\/\" target=\"_blank\">Youth in Energy Empowerment Program(YEEP)<\/a> presented itself. It was like a dream come true. Why? The program offered exactly what I desired to pursue in my career; energy management and auditing. I would not only get to be in class to understand all matters energy but also get to practice it in industry through internship. Having a background in Chemical Engineering, I was fortunate to be placed in <a href=\"https:\/\/www.kapa-oil.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Kapa Oil Refineries<\/a>, which is a manufacturing company. This for me was assurance that I was on the right track.<\/p>\n\n\n\n<p>I am one person who loves order. It naturally follows that on the day before I reported to Kapa, I made sure that everything I would need for my first day was in place. I reported to<a href=\"https:\/\/www.kapa-oil.com\/\" target=\"_blank\" rel=\"noreferrer noopener\"> Kapa Oil Refineries<\/a> on 3<sup>rd<\/sup> May 2021 to a warm welcome. I was so excited with lots of expectations. Never before had I worked in a manufacturing company, let alone such a big one. I couldn’t wait to get started. The first step was of course getting to know how the company operates and the fastest way was taking a factory tour. There are eight plants in the company. I soon came to realize that the factory is so big and a single day’s tour wouldn’t be enough to appreciate how amazing the place is. &nbsp;So, my supervisor and I came up with an elaborate plan to help me get the most out of the every plant. The plan was to be placed for about three to four days in each plant to get an exhaustive overview of what happens in each department.<\/p>\n\n\n\n<p>The company has a very strict yet efficient safety policy. As such, before visiting any plant, I was introduced to the head of safety who gave a brief on all matters safety. There is something that she said that stuck with me. <em>“Safety is more of what you see than what you know<\/em>.” That taught me to be alert as I walked around the factory.<\/p>\n\n\n\n<p>The first department to visit was the detergent department. The head of department welcomed my fellow <a href=\"https:\/\/eenovators.com\/youth-in-energy-empowerment-program-yeep\/\" target=\"_blank\" rel=\"noreferrer noopener\">YEEP<\/a> cohortian and I and gave us the head operator to take us round the plant. I had read about fans in class and thought I knew enough about them, but once I saw the fans in detergent plant, I was so impressed; they were big and powerful. The process of detergent manufacture is pretty elaborate with lots of massive equipment. I got to understand the process from A-Z, and ask questions to which I got answers. At the end of my four days at the department, I got assessed by the head of department. Just when I thought I had learnt everything there is to know and asked enough questions, he asked me some questions that caught me off-guard. I liked that he did because it challenged me to learn to question the process from all angles and to do more research on the same. That has helped me keep an open eye as I visited the other departments.<\/p>\n\n\n\n<p>Most of the expectations I had at the beginning of the internship have been met. I have learnt so much during the short period I have been in the company and with the diversity that there is, I have so much more to learn. I have come to understand so much on steam generation and use, oil refining and processing, soap manufacture, baking and packaging. Every once in a while I enjoy a bowl of noodles but had no prior knowledge of how they were made until I got to <a href=\"https:\/\/www.kapa-oil.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Kapa<\/a>.<\/p>\n\n\n\n<p>One thing I like about the company is cooperation and team work among the employees. The departments I have visited so far are well organized and everyone takes the roles assigned to them very seriously and with one heart. It is so fulfilling to be taught about a process by people who have worked on the ground for years, as they teach you how to trouble shoot among other things that you may have missed during the theoretical part of learning, from their personal experience.<\/p>\n\n\n\n<p>I expected to take some time to adapt to the environment but I must say it has taken me quite a short time to do so. Anything that was I found a bit challenging to adapt to? That would be the strict vegetarian only diet that is part of company policy. That means any food partaken on company grounds should not have any meat in it. Any meat lover would find this challenging but on the plus side, I get to have a healthier lunch every day. Nonetheless, I am hopeful knowing I am in a place that will allow me to grow not only as an energy professional but as a chemical engineer. I plan to maximize on the time spent in the company to learn as much as I can and at the same time give of my already possessed skills to the company.<\/p>\n\n\n\n<p>&nbsp;My YEEP experience so far has been splendid and I am excited to see what else is in store.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>About the Author<\/strong><\/h2>\n\n\n\n<p>Gloria Maruti is an energy professional enrolled in the <a rel=\"noreferrer noopener\" href=\"https:\/\/eenovators.com\/youth-in-energy-empowerment-program-yeep\/\" target=\"_blank\">Youth in Energy Empowerment Programme<\/a> coordinated by <a href=\"http:\/\/eenovators.com\" target=\"_blank\" rel=\"noreferrer noopener\">Eenovators Ltd<\/a>. She is an energy enthusiast with a background in Chemical and Process Engineering. In her free time, Gloria enjoys travelling, watching documentaries and giving back to society.<\/p>\n<div class=\"energ-after-content\" id=\"energ-1055736604\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Gloria Maruti It is said that a journey of a thousand miles begins with a single step. As a fresh graduate eager to venture into the working society, I was ready to take the first step in my career when an opportunity to join the Youth in Energy Empowerment Program(YEEP) presented itself. It was [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3209,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"MY ENERGYZED YEEP INTERNSHIP EXPERIENCE AT KAPA","_seopress_titles_desc":"As a fresh graduate eager to venture into the working society, I was ready to take the first step in my career when an opportunity to join the Youth in Energy Empowerment As a fresh graduate eager to venture into the working society, I was ready to take the first step in my career when an opportunity to join the Youth in Energy Empowerment Program (YEEP) presented itself","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[207],"tags":[],"class_list":["post-3183","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3183","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3183"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3183\/revisions"}],"predecessor-version":[{"id":3220,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3183\/revisions\/3220"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3209"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3183"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3183"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3183"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}