{"id":3211,"date":"2021-06-16T12:17:33","date_gmt":"2021-06-16T12:17:33","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3211"},"modified":"2021-06-17T13:47:51","modified_gmt":"2021-06-17T13:47:51","slug":"my-yeep-internship-experience-at-eenovators-limited","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/youth-empowerment\/my-yeep-internship-experience-at-eenovators-limited\/","title":{"rendered":"MY YEEP INTERNSHIP EXPERIENCE AT EENOVATORS LIMITED"},"content":{"rendered":"\n<p>By Albert Kibiwott<\/p>\n\n\n\n<p>The <a href=\"https:\/\/eenovators.com\/youth-in-energy-empowerment-program-yeep\/\" target=\"_blank\" rel=\"noreferrer noopener\">YEEP Program<\/a> has been a great learning experience. As the first cohort of the program, we have been privileged to get an opportunity to acquire energy audit and energy management knowledge and experience that will enable us to further develop our careers and entrepreneurship skills in the energy space. Besides getting the technical training, there have been essential life skills training which come in handy in overcoming the challenges that the youth are facing in our day-to-day activities.<\/p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; At the start of the program, we were able to learn the basics of Energy Auditing. This was a fast-tracked kind of a course that gave me a closer look at how we can harness, manage and audit the various clean energy resources around. The tutors made this look simple. The exam season came and just like any other exam I was a little bit anxious about it. The exam was generally manageable and the best part is that we all aced it. The internship period then kickstarted at the beginning of May. During this phase, I have been able to put into practice the nitty-gritties of energy auditing and management. Working with the Tech Team at <a href=\"http:\/\/eenovators.com\" target=\"_blank\" rel=\"noreferrer noopener\">Eenovators Ltd<\/a>, I have been able to conduct an energy Audit at Galleria Mall and install and configure a couple of e-gauge energy meters. With the team I have been able to apply my acquired skills in identifying energy management opportunities and analyzing the historical and logging data to be able to advice on the best and viable energy management practices to the client.<\/p>\n\n\n\n<p>            I also took part in the recent “<em><strong><a href=\"https:\/\/www.youtube.com\/watch?v=Ga1yN95Xz_I&amp;t=5s\" target=\"_blank\" rel=\"noreferrer noopener\">Financing Sustainability Projects<\/a><\/strong>” <\/em> Energy Professionals Online RoundTable, talking about the inclusivity of the youth in the sustainable projects.  Below is the Q&amp;A conversation that I was privileged to be part of:<\/p>\n\n\n\n<p><strong>Q: Why should the youth be placed at the forefront of sustainability projects?<\/strong><\/p>\n\n\n\n<p><strong>A:<\/strong> Statistics from the African Development Bank and World Bank show that over 60% of the population in Sub-Saharan Africa are under the age of 25 and that the youth population is expected to rise to 830 million by 2050. This is an indication that the youth can be seen as current and future assets who need to be fully capitalized on through job creation and other economic opportunities.&nbsp;&nbsp; This cadre of young and energetic citizens should be financed as they can provide ways of addressing the interconnected elements of sustainable development: economic growth, social inclusion and environmental protection.<\/p>\n\n\n\n<p><strong>Q: What do you think are the barriers to youth participation in green agenda?<\/strong><\/p>\n\n\n\n<p><strong>A:<\/strong> Unemployment is a significant challenge. This can be attributed to the lack of quality education and the required professional skills among the youth. With the widening gap between education and the job market, many youths have been forced to work in the informal sector, which is not only unstable but also provides very low levels of income. Besides that, most of the youth are not aware of these sustainable projects and funds available. At a time when sub-Saharan Africa is going through significant changes in economic, social, technological and environmental frontiers, some youth across Africa are being left out.<\/p>\n\n\n\n<p><strong>Q: Any solutions to meaningful participation of the youth?<\/strong><\/p>\n\n\n\n<p><strong>A: <\/strong>Yes<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li><strong>Youth Innovation<\/strong><\/li><\/ul>\n\n\n\n<p>It is a high time that the youth innovate pathways to overcome the current challenges. Investing in the green energy sector, for example, is a good way of solving the issues of unemployment as the sector can generate a high number of direct employment opportunities through its value chain of sales, marketing, installation, and maintenance services. This itself could create millions of jobs among the youth in the region.<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li><strong>Collaboration and awareness<\/strong><\/li><\/ul>\n\n\n\n<p>Also, there is a dire need for an increased collaboration between the training institutions and the industry. Strategic partnerships, internships and youth programs should be encouraged across the region as they provide a great path for learning and gaining of professional skills to young people. We actually need to create more awareness of the opportunities and required skill sets to the youth so as to enable them know the possible avenues available for growth and investment.<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li><strong>Government role<\/strong><\/li><\/ul>\n\n\n\n<p>Although some countries in Africa have made some strides in investing in the youth, more grants and affordable loan finance mechanisms should be put in place as most of the projects and businesses require high starting capital, which many youths may not afford. The regional governments, therefore should chip in and assist these innovative minds by strengthening funding for youth programs, improving capacity building and generally expanding the technological know-how in the region.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img decoding=\"async\" data-src=\"https:\/\/energyzedworld.com\/wp-content\/uploads\/2021\/06\/al.jpg\" alt=\"\" class=\"wp-image-3213 lazyload\" width=\"414\" height=\"386\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 414px; --smush-placeholder-aspect-ratio: 414\/386;\" \/><figcaption><em>Photo: At Kenchic-Mlolongo installing e-gauge energy meters<\/em><\/figcaption><\/figure><\/div>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As we advance to the climax of this program, I am happy to have met my expectations of the program, and even beyond. I can only look forward to gaining more experience and interacting with many professionals in this field. Indeed, the YEEP program has been a big addition to my career development as an electrical and electronic engineer.<\/p>\n\n\n\n<p><strong>BIOGRAPHY<\/strong><\/p>\n\n\n\n<p>Albert Kibiwott is a trainee in the <a href=\"https:\/\/eenovators.com\/youth-in-energy-empowerment-program-yeep\/\" target=\"_blank\" rel=\"noreferrer noopener\">Youth in Energy Empowerment Program (YEEP)<\/a> with a background in Electrical and Electronic Engineering and a certificate in cobenefits in renewable energy. He has particular interests in renewable energy, entrepreneurship, and sustainable development. He currently trains as an Energy Audit Technician with the Institute of Energy Professionals Africa (IEPA) and Eenovators Limited. &nbsp;Kibiwott enjoys reading engineering journals and blogs and playing football and scrabble.<\/p>\n<div class=\"energ-after-content\" id=\"energ-2882599017\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Albert Kibiwott The YEEP Program has been a great learning experience. As the first cohort of the program, we have been privileged to get an opportunity to acquire energy audit and energy management knowledge and experience that will enable us to further develop our careers and entrepreneurship skills in the energy space. Besides getting [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3214,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"MY YEEP INTERNSHIP EXPERIENCE AT EENOVATORS LIMITED","_seopress_titles_desc":"Working with the Tech Team at Eenovators Ltd, I have been able to conduct an energy Audit at Galleria Mall and install and configure a couple of e-gauge energy meters","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[207],"tags":[],"class_list":["post-3211","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3211","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3211"}],"version-history":[{"count":4,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3211\/revisions"}],"predecessor-version":[{"id":3218,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3211\/revisions\/3218"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3214"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3211"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3211"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3211"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}