{"id":3234,"date":"2021-06-28T11:37:28","date_gmt":"2021-06-28T11:37:28","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3234"},"modified":"2021-06-28T12:46:34","modified_gmt":"2021-06-28T12:46:34","slug":"energy-inclusion-are-assistive-technologies-energy-efficient","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-financial-calculator\/energy-inclusion-are-assistive-technologies-energy-efficient\/","title":{"rendered":"ENERGY INCLUSION &#8211; ARE ASSISTIVE TECHNOLOGIES ENERGY EFFICIENT?"},"content":{"rendered":"\n<p>By Emily Gitonga<\/p>\n\n\n\n<p>Sustainable development goals highlight the need for the Inclusion of all vulnerable groups including persons with disabilities. Inclusion should involve all sectors of the economy to ensure that no one is left behind in the development agenda. Persons with disabilities (PWDs) have several needs and a solution to assist in these needs involves different approaches. Assistive technologies have played a major role in ensuring that PWDs can conduct their tasks efficiently and with independence. These technologies have as well played a major role in ensuring PWDs acquire education, health care and also work in different work environments either formal or informal. We need to go a step further in the energy sector to explore the energy efficient context of these technologies.<\/p>\n\n\n\n<p>&nbsp;In 2011 the World Health Organization (WHO) estimated that more than a billion people, or 15% of the world’s population, live with some form of disability, and anticipated that this number would rise in future years. The WHO approximates that of the 15% of the global population living with a disability, ‘there are more than 1000 million people who would benefit from one or more assistive products.’ The WHO also projects that this number ‘will rise above 2000 million by 2050’. However, the WHO asserts that only 10% of people requiring an assistive product have access to one<em>.<\/em> What can be done to ensure that the cost of production is lowered as a result of being energy efficient?<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Key Areas to Note:<\/strong><\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>It would be important to determine whether the assistive technologies space is energy efficient in operation<\/li><li>It would be of benefit to explore solutions and ways in which assistive technologies can be more energy-efficient or use clean energy in operation<\/li><li>It would be ideal to harmonize the efforts of the sectors involved in the production and assembly of assistive technologies to ensure an energy efficient mindset<\/li><li>It would be of significance to identify ways in which players in the energy efficiency and clean energy space can partner with this sector to blend efforts<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Assistive technologies<\/strong><\/h4>\n\n\n\n<p>Assistive Technologies (AT) is a broad concept, covering virtually anything that might be used to increase functional capabilities (Reed &amp; Bowser, 2005) ranging from low-tech devices like crutches or a special grip for a pen, to more advanced items like hearing aids and glasses, to high-tech devices such as braillers and computers with specialized software for helping dyslectics to read (WHO, 2009).<\/p>\n\n\n\n<p>The World Health organization survey suggests that disability is likely to prevail in low-income countries compared to high-income countries. The barriers to the effectiveness of assistive technologies in the low-income country are based on the policies in place, standards around the inclusion of disabled people in the education sector, healthcare, and employment. The low-income countries as well lack enough resources to ensure that these needs are looked into. Assistive technologies have increased demand due to different changes in the economy on information technology and the number of PWDs increasing.&nbsp; Assistive technologies often rely on energy and electricity access. In most developing countries the percentage of access to affordable and clean energy is still dragging behind.&nbsp; It is even more difficult for persons with disabilities due to their constrained need to be indoors due to mobility difficulties or based on the stigma in the society. The key question remains, what can be done to have a specific focus on this area and to bring down the energy costs as a means to bringing down the overall costs and ensuring greater access?<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Assistive technology Effectiveness<\/strong><\/h4>\n\n\n\n<p>In society today different perceptions and attitudes towards assistive technologies have been the key determinate of how these assistive technologies are effectively used to assist the PWDs to perform their tasks independently. Winfred M, 2012 states different researches that are have been put together on the attitudes and perceptions of the ATs being the major contributor to the adoption and effective use of assistive technologies. According to this research, these factors include; the cultural and societal stigma towards these devices creates a negative attitude towards adoption and the use of these technologies.<\/p>\n\n\n\n<p>The research also notes that persons that acquired disabilities congenitally are likely to adopt the devices compared to the acquired disabilities due to the attitude that these devices tend to remind them of the things they cannot do anymore. The devices are also expensive in acquisition, training, and rehabilitation and this becomes and hindrance in acquiring them. This research noted that many devices are abandoned after acquisition due to difficulties in maintenance. This begs the question as to if there are more efficient ways to bring down the costs and enhance operations and maintenance? Would a central maintenance and support center powered by an energy efficient source of power resolve the need?<\/p>\n\n\n\n<p>The caregivers of the PWDs also tend to contribute mostly to the non-effectiveness of these devices, due to their perception of the need to help these persons perform tasks instead of facilitating and training them how to effectively use these devices. The research encouraged the need to train and involve the PWDs in the design of these devices to encourage adoption and use. An article by Kilimanjaro blind trust indicated that it is one of the organizations that have a presence in 150 countries and mostly in the African countries, its purpose to serve the efficacy of the visually impaired and the aid assistive technology. &nbsp;It also looks into the affordability and the digital design that will improve efficiency in the performance. In an article, the organization wrote about the efficacy and the affordability of the deaf and the visually impaired assistive technology. The organization has focused on smart technologies. They also regularly review new and innovative technology in this digital age to evaluate its efficacy and affordability for those whom they serve. Kilimanjaro Blind Trust is currently in the process of evaluating ‘smart’ devices especially being developed for the blind\/visually impaired and which promise to provide a ‘quantum leap’ in such assistive devices for Africa.” Can these smart devices be produced in an energy efficient manner to enable the entry level for all who need them lowered?<\/p>\n\n\n\n<p>According to the research, the Braille technology is of high cost and thus not as affordable to developing countries as it is meant to. It denotes that Perkins Braille is heavy, noisy to use, easy to break down, and requires equally expensive and bulky Braille paper and textbooks, which has not helped learners who use the classic Braille in a classroom situation. KBTA for several years has been dedicated to identifying affordable technology for assistive devices in Africa. In 2018 KBTA launched the Orbit Reader 20 which was developed as an affordable electronic Braille device for use in Africa and other developing countries. &nbsp;The Orbit Reader has several main functions which include the following; a note-taker, Cheaper in price, and easy to use in both the classroom and the work environment,&nbsp;It eliminates the cost of producing Braille material on paper, the device is small, portable with the following features: Refreshable display of 20 Braille cells with pins that represent any six- or eight-dot Braille code, Reads the contents of files on an SD card for stand-alone operation, Connects to computers and portable devices via USB or Bluetooth for use with a screen reader, Braille input keys, Includes the simple note-taking capability, Rechargeable batteries (user replaceable). Could these devices in some way be powered by clean energy sources of the renewable kind whether designed into portable carry ons or places at strategic points? Africa has an abundance of renewable energy sources that may be harnessed in this way.<\/p>\n\n\n\n<p>Innovation ecosystem aimed at supporting 50 start-ups to develop new assistive technologies and services was launched in Kenya during the Global Development Innovation Hub in 2019. This accelerator program which is part of innovating now already has succeeded in the first cohort which gave the finalist a chance to benefit from learning-centered on a user, market, products, and business development and mentorship from experienced entrepreneurs, product developers, and disability experts.&nbsp; Innovate Now is a great program aimed at helping ventures develop assistive technologies that are not only groundbreaking but homemade hence customized with the local knowledge, thus lowering costs for persons with disabilities, most of whom are underprivileged. These efforts need to be complimented by inputs from energy engineers on how to make the innovations more sustainable.<\/p>\n\n\n\n<p>The solar ear is another good innovation that started in Botswana in 2002 now has its headquarters in Canada. The company manufactures environmentally friendly hearing aid devices with rechargeable batteries using solar energy which is more affordable compared to the other device in the market. Solar Ear employs and trains people who are deaf to manufacture the hearing aids and to lead the replication of the technology in other countries (Modesta <em>Solar Ear<\/em> (2019). The knowledge on the availability of devices is lacking especially in the rural areas of developing countries. The policies and tariffs in Kenya have been also great barriers to the importation of these devices rendering them expensive for the local suppliers and producers. What kind of advocacy would need to be put in place to ensure that the replication and proliferation of these kinds of interventions reaches the grassroots where the need I heaviest?<\/p>\n\n\n\n<p>Based on these different studies, various challenges have been noted as hindrances to both efficiency and having access to the needed ATs among PWDs.These challenges include electricity access to use the available devices and the level of poverty in the developing countries that poses a challenge to PWDs to acquire different technologies for education, healthcare, and employment. Policies that support the standards of ATs for the PWDs both manufacture and use, are not in place to support the initiative of affordable efficient and sustainable assistive technologies. There is a wide gap on the use of renewable, clean, and affordable energy in the arena of these devices. The economy must embrace the use of this kind of energy in the design and manufacturing of the devices to be used by to PWDs to ensure the affordability of these gadgets and also to enable a clean environment for every individual for sustainability..<\/p>\n\n\n\n<p>Eenovators Ltd that spearheads the World Energy Day celebrations is taking up the challenge to build capacity in the space of assistive technology awareness with a focus on the energy efficiency side. &nbsp;This calls for partnerships with organizations that champion the agenda of Ats. The opportunity to include PWDs to speak and address the issues in AT sector in the energy space during the webinars held in the run up to the main WED conference, to create awareness on the needs would be an opening to champion for change.<\/p>\n\n\n\n<p>Involvement in projects that assist in building of capacity in the area of ATs would play a critical role in the energy space as this linkage is currently absent. The call to action requires advocacy, research to contribute to the body of knowledge, public education and awareness creation, partner sensitization for the manufacturing of AT software and products, and networking opportunities for energy professionals and PWDs for inclusion in processes that will realize enablement of cleaner and more sustainable production to meet PWD market needs.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>References<\/strong><\/h4>\n\n\n\n<p>World Health Organization Global perspectives of Assistive technology<\/p>\n\n\n\n<p>&nbsp;Proceedings of the GReAT Consultation 2019<\/p>\n\n\n\n<p>Energy and economic growth applied for Research Programme, Energy and Disability. Ashira Perera <em>Oxford policy Management March 2019<\/em><\/p>\n\n\n\n<p>World’s First Innovation Ecosystem dedicated to Assistive Technology to be launched In Nairobi, Kenya by Innovate Now 2019<\/p>\n\n\n\n<p>Unlocking Literacy for life <em>Assistive technology 2<\/em>018 Kilimanjaro blind trust<\/p>\n\n\n\n<p>Adoption of computer-based assistive technology for persons with disabilities in Kenya (Mbugua Winfred Wairimu <em>University of Nairobi 2012)<\/em><\/p>\n\n\n\n<p>Innovative Practice 2019 on Independent Living and Political Participation Affordable Hearing Aids through Solar Technology Modesta Nyirenda Solar Ear<\/p>\n<div class=\"energ-after-content\" id=\"energ-3036407562\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Emily Gitonga Sustainable development goals highlight the need for the Inclusion of all vulnerable groups including persons with disabilities. Inclusion should involve all sectors of the economy to ensure that no one is left behind in the development agenda. Persons with disabilities (PWDs) have several needs and a solution to assist in these needs [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3236,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,197],"tags":[],"class_list":["post-3234","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-energy-financial-calculator"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3234","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3234"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3234\/revisions"}],"predecessor-version":[{"id":3239,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3234\/revisions\/3239"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3236"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3234"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3234"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3234"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}