{"id":3242,"date":"2021-07-07T12:37:16","date_gmt":"2021-07-07T12:37:16","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3242"},"modified":"2021-07-07T12:40:18","modified_gmt":"2021-07-07T12:40:18","slug":"tales-from-tamuwa","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/youth-empowerment\/tales-from-tamuwa\/","title":{"rendered":"TALES FROM TAMUWA"},"content":{"rendered":"\n<p>By Sephan Ogola<\/p>\n\n\n\n<p>Finally it came to our view, just across the railway line lay an ancient looking building with the words <a rel=\"noreferrer noopener\" href=\"https:\/\/www.tamuwa.com\/\" target=\"_blank\">Tamuwa<\/a> boldly painted across its wall by the black gate. Few kilometers behind it lay a breathtaking view of an imposing array of hills which I would later learn are called the Nandi hills; they give an impression of a high, protective wall for as far as the eyes can see and serve as an inter-county border in addition to their aesthetic and obvious role of offering habitation to various flora and fauna.<\/p>\n\n\n\n<p>On reaching the administration oﬃce, we were accorded a cordial welcome and shortly after taken on a brief tour around the plant where it dawned on me that the place needed radical attention, something about the prospects thrilled me and at the same time made me anxious. Later on, seeing as the state of affairs had piqued my interest, I naturally started asking questions: Why is this as is? Why isn’t that as supposed to be? Why can’t this be as such and such?…<\/p>\n\n\n\n<p>Before I delve deeper, it should be noted that the factory is located in a rather remote setting, and that upon my maiden visit I felt so apprehensive about the whole situation such that attempts to pull out were made, but in vain. You see, they say a way to man’s heart is through his stomach, while there I scoured the area for a decent eatery or something of the sort but all my bids were null and void, how was I to feel satisfied yet no hearty lunch was forthcoming? Moreover, having arrived on a rainy day, I’d gotten an experience of how torturous the journey to accessing the place can get. I panicked, in fact, had there have been room for taking to my heels I would have. Thanks to words of aﬃrmations, I resolved to stay, and indeed, where there’s a will there’s way.<\/p>\n\n\n\n<p>Fast forward to a week in, yours truly had gotten accustomed to riding on motorcycles as a means of transport; something I always dreaded before, snacks for light lunches were the order of the day, and above all, focus could now be put on the primary agenda for my deployment to Tamuwa. The factory uses bagasse (a by-product from squeezed sugarcane in the processing of sugar) whose moisture content needs to be no more than 12% and rice hulls at a ratio of 9:1 respectively, the bagasse is threshed using a crusher and then fed into a briquetting machine to be formed into high-density, cylindrical, brown to dark fuel of about 8cm in diameter. Contrary to my previous belief, no water is utilized in the production of these briquettes other than for cooling the machines i.e. the crushed bits are hammered together by a strong mechanical ram into a single mass which then breaks off into a heap of briquettes at the end of a guiding channel. Despite the numerous induction motors and switchboard panels, I realized that I was the only one there with a background in electrical, this meant that I’ve had to go over and beyond my prescribed responsibilities and juggle more on my plate. So besides tracking, documentation and analysis of energy utilization in an endeavor to enhance energy eﬃciency and conservation, I’m also hard at work in the maintenance sector especially with regards to electrical circuitry. Occasionally, I also get to weigh in on health and safety matters. Thankfully there is an amazing team some with experience spanning decades from whom I learn as much as they learn from me.<\/p>\n\n\n\n<p>There are challenges, just like there could be elsewhere, perhaps even more. But, isn’t the harder the struggle the more glorious the triumph?<\/p>\n<div class=\"energ-after-content\" id=\"energ-892219079\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Sephan Ogola Finally it came to our view, just across the railway line lay an ancient looking building with the words Tamuwa boldly painted across its wall by the black gate. Few kilometers behind it lay a breathtaking view of an imposing array of hills which I would later learn are called the Nandi [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3244,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"TALES FROM TAMUWA","_seopress_titles_desc":"So besides tracking, documentation and analysis of energy utilization in an endeavor to enhance energy eﬃciency and conservation, I’m also hard at work in the maintenance sector especially with regards to electrical circuitry","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[207],"tags":[],"class_list":["post-3242","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3242","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3242"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3242\/revisions"}],"predecessor-version":[{"id":3247,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3242\/revisions\/3247"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3244"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3242"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3242"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3242"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}