{"id":3248,"date":"2021-07-07T12:52:30","date_gmt":"2021-07-07T12:52:30","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3248"},"modified":"2021-07-07T13:29:43","modified_gmt":"2021-07-07T13:29:43","slug":"my-yeep-internship-experience-at-kenchic-thika","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/youth-empowerment\/my-yeep-internship-experience-at-kenchic-thika\/","title":{"rendered":"MY YEEP INTERNSHIP EXPERIENCE AT KENCHIC-THIKA"},"content":{"rendered":"\n<p>By Cindy Muriithi<\/p>\n\n\n\n<p>Favored and blessed to take part of <a href=\"https:\/\/eenovators.com\/youth-in-energy-empowerment-program-yeep\/\" target=\"_blank\" rel=\"noreferrer noopener\">Youth in Energy Empowerment Program<\/a> the experience so far is nothing short of awesome. I went back to the basics of thermal and electrical systems whose usage of electrical power is very high and are always in operation in most industries. The training sessions were informative as was the first-hand information from trainers who are on the ground. Compared to campus studies, it was quite different. After the training sessions in class, we are now in the internship phase.<\/p>\n\n\n\n<p>I am honored and privileged to be placed at <a href=\"https:\/\/www.kenchic.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Kenchic<\/a>&#8211; Thika for my internship. I have been informed that in <a href=\"https:\/\/www.kenchic.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Kenchic<\/a> it is a rare opportunity, so I am grateful for the partnership that was created for the <a href=\"https:\/\/eenovators.com\/youth-in-energy-empowerment-program-yeep\/\" target=\"_blank\" rel=\"noreferrer noopener\">Youth in Energy Empowerment Program<\/a> to be a success. The plant slaughters chicken and produces its by- products such as smokies, sausages, burgers and others. It is amazing how the whole process is done efficiently while at the same time retaining the quality of the product. The energy consumption is very high, lots of water at different conditions in different sections together with different machineries all done to ensure quality of the products is high. The care the birds are given before slaughter is just amazing; I can attest they do not suffer before they are slaughtered. ‘<strong><em>We are halal<\/em><\/strong>.’ I was first taken through all the sections from receiving of the birds to packaging. In my introduction to the plant, I went through induction where I got to understand the role of each section to achieve the industry’s overall objectives. Indeed, teamwork can never be overemphasized in any set up. The personnel in every section were very welcoming despite their busy schedules they created time to explain what they exactly do to achieve the plant’s objective.<\/p>\n\n\n\n<p>I work in a warm environment, hand in hand with the plant’s engineers and technicians in preventive and corrective maintenance activities while monitoring their energy consumption through their meter readings. When maintenance practices are not adhered to, then energy costs are high. The team is very cheerful, helpful, informative, creative and innovative to ensure that the machineries run smoothly and helpful and thanks to them am gaining a lot. Each day I learn something new on one machinery or the other especially when there is a breakdown. Different utilities are used in the machineries for them to operate.<\/p>\n\n\n\n<p>Being on the ground is quite different from reading in books how systems function. I am increasing my knowledge and understanding on the utilities present and their usage. The exposure to refrigeration systems and their operation is very awesome. I love networking. It is during lunch hours and tea breaks that I get to discuss social matters with colleagues. I am learning challenges that engineers face at work and how they can be handled, how they cope with work demands and their families and how they relate to each other. It is riveting how much one can learn from people who have years of experience in engineering field. Despite being in a new environment with new people and the expectations they have of me, I have been blessed with an awesome team from the Eenovators to guide and direct me when I am experienced with challenges which am unable to solve by myself.<\/p>\n\n\n\n<p>Change is inevitable, especially in this age and time. I am aiming that at the end of my internship program I will be able to engineer energy related changes for the betterment of the plant and the environment at large. I aim to be an asset to the plant by creating awareness of energy management and the effects of power consumption to climate change. I believe that at the end, I will be experienced both in energy management matters and energy conservation measures and finally be able to be a step forward in fulfilling my vision as a Christian engineer. As the days go by, I am increasing in knowledge and experience in the energy field, I love the start and am ecstatic on this journey all the way.<\/p>\n<div class=\"energ-after-content\" id=\"energ-1500478594\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Cindy Muriithi Favored and blessed to take part of Youth in Energy Empowerment Program the experience so far is nothing short of awesome. I went back to the basics of thermal and electrical systems whose usage of electrical power is very high and are always in operation in most industries. The training sessions were [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3251,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"MY YEEP INTERNSHIP EXPERIENCE AT KENCHIC-THIKA ","_seopress_titles_desc":"I work in a warm environment, hand in hand with the plant’s engineers and technicians in preventive and corrective maintenance activities while monitoring their energy consumption through their meter readings. When maintenance practices are not adhered to, then energy costs are high","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[207],"tags":[],"class_list":["post-3248","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3248","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3248"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3248\/revisions"}],"predecessor-version":[{"id":3252,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3248\/revisions\/3252"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3251"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3248"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3248"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3248"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}