{"id":3257,"date":"2021-09-20T12:57:09","date_gmt":"2021-09-20T12:57:09","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3257"},"modified":"2021-09-20T12:59:10","modified_gmt":"2021-09-20T12:59:10","slug":"the-inaugural-energy-professionals-awards-2021","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-industry-news\/the-inaugural-energy-professionals-awards-2021\/","title":{"rendered":"THE INAUGURAL ENERGY PROFESSIONALS AWARDS 2021"},"content":{"rendered":"\n<p>BY EMILY GITONGA<\/p>\n\n\n\n<p>For the longest time industries have been celebrated for making great impact in the energy industry, however specific individual recognition has not been embraced much. World Energy Day Foundation has taken the initiative to incorporate the recognition and celebration of energy professional’s every year among its yearlong activities ahead of the main celebration in October 22<sup>nd<\/sup>.<\/p>\n\n\n\n<p>Are you an Energy Professional or do you know an energy professional&nbsp;doing exemplary work in the energy industry? The Energy Professional Awards is here again in 2021.It is the platform where Energy enthusiasts creating impact in the agenda of energy sustainability through energy efficiency, renewable energy, professional moves and inclusion are awarded and celebrated. The nominations for different categories are <a href=\"https:\/\/www.worldenergyday.net\/energy-professional-awards-2021\/\" target=\"_blank\" rel=\"noreferrer noopener\">open<\/a>. Nominate! Nominate! Nominate! East Africa’s Energy Professional creating impact and one that you think deserves an award.<\/p>\n\n\n\n<p>Energy is a necessary topic in achieving the sustainability agenda not only in the country, but in the region and in the continent. Giving recognition to the professionals making great strides in the industry lean the region into achieving energy sustainability.<\/p>\n\n\n\n<p>Energy Professional Awards is among the many activities of the <a href=\"https:\/\/www.worldenergyday.net\/\" target=\"_blank\" rel=\"noreferrer noopener\">world energy day<\/a> Conference celebrations. In 2021, the Energy professional awards will be celebrated in a hybrid event physical and online .The event is set to take place for the very first time in Kampala Uganda.&nbsp;<\/p>\n\n\n\n<p>The energy professional awards is a fantastic opportunity for energy Enthusiasts to get recognition on the different achievements they have accomplished in the energy industry. World Energy Day Conference provides an opportunity to network with energy professionals in different fields across the world. You also get to listen in to great guests and speakers in the conference. Follow the link <a rel=\"noreferrer noopener\" href=\"https:\/\/www.worldenergyday.net\/energy-professional-awards-2021\/\" target=\"_blank\">here<\/a> and nominate for a chance to be awarded in the 2021 conference .This year we have 8 different award categories to recognize the outstanding success and contributions of Energy enthusiasts in the industry.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Energy Innovator of the Year<\/strong><\/h4>\n\n\n\n<p>The most outstanding innovator in the energy space is awarded in this category. The innovations submitted in this category should demonstrate novelty or a new concept etc. and should not a duplication of an existing project in different geography. The innovations should have an impact on energy efficiency, renewable energy or any related energy technologies.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Energy Auditor of the Year<\/strong><\/h4>\n\n\n\n<p>This award is presented to an individual for exceptional accomplishments in promoting the practices, principles, and procedures of energy auditing. The nominee’s energy auditing accomplishments need to have had a demonstrable impact in the industry. The recipient must be a registered energy auditor.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Energy Communicator\/Journalist of the Year<\/strong><\/h4>\n\n\n\n<p>This award is presented to an individual who has made outstanding strides in communicating energy news, articles or stories. The communication needs to have been consistent, covering energy topics that are designed to create energy awareness and advocacy and have had their work published for public consumption.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Energy Social Impact Award<\/strong><\/h4>\n\n\n\n<p>This award is awarded to an individual with a remarkable energy project that benefits the community or those in need. The project needs to demonstrate an intervention that makes a difference for the community or specific special needs group or institution and needs to have a community or target group ownership element for a sustainable outcome.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Young Energy Professional of the Year<\/strong><\/h4>\n\n\n\n<p>This award is presented to individuals aged 30 years and younger who have made exceptional accomplishments in energy. This could be the development of an innovative project, a socially impactful intervention, or an initiative that has a significant impact on the energy space.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Renewable Energy Professional of the Year<\/strong><\/h4>\n\n\n\n<p>This award is presented to individuals with outstanding projects in renewable energy including solar, wind, geothermal, hydroelectric, etc. The projects need to have demonstrated the creation of or uptake or use of renewable energy with specific results in the areas of deployment<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Professional Energy Woman of the Year&nbsp;<\/strong><\/h4>\n\n\n\n<p>This award recognizes the most outstanding woman in the energy industry based on their work promoting the practices, principles, and procedures of energy efficiency, renewable energy, clean energy initiatives, energy inclusion, energy funding, or any other outstanding work in the energy sector.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Energy Champion of the Year<\/strong><\/h4>\n\n\n\n<p>This category recognizes the individual that has had the most impact on the transformation of the energy industry in East Africa. The awardee for this category will need to be nominated and have won in one of the other seven categories above. The nominees need to have demonstrated an impact in a wide variety of energy areas and be the initiator, champion, and driving force behind the energy activities or projects.<\/p>\n\n\n\n<p>Nominations are now open and will remain so until&nbsp;<strong>28<\/strong><strong><sup>th<\/sup><\/strong><strong> October 2021.<\/strong>&nbsp;Candidates can nominate themselves or someone else &#8211; take a look at the nomination criteria and information that will need to be submitted for each category.<\/p>\n\n\n\n<p><strong>Nomination links<\/strong><\/p>\n\n\n\n<p>You can find all the nomination information through the links below:<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li>To access the information on how to nominate yourselves and someone else <a href=\"https:\/\/www.worldenergyday.net\/energy-professional-awards-2021\/\" target=\"_blank\" rel=\"noreferrer noopener\">Click Here<\/a><\/li><li>The information on what is required in each criteria is <a href=\"https:\/\/www.worldenergyday.net\/energy-professional-awards-2021\/\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a><\/li><\/ul>\n\n\n\n<p>Please do not hesitate to share information on our awards far and wide in your organizations and to anyone you think would like to nominate themselves or a colleague(s).<\/p>\n\n\n\n<p>Find out more about the nominations in 2020<a href=\"https:\/\/youtu.be\/T5f94kHvXDI\" target=\"_blank\" rel=\"noreferrer noopener\">, Click here<\/a><br><\/p>\n\n\n\n<p>Reference<\/p>\n\n\n\n<p>World energy Day website https:\/\/www.worldenergyday.net\/<\/p>\n<div class=\"energ-after-content\" id=\"energ-3418166016\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>BY EMILY GITONGA For the longest time industries have been celebrated for making great impact in the energy industry, however specific individual recognition has not been embraced much. World Energy Day Foundation has taken the initiative to incorporate the recognition and celebration of energy professional’s every year among its yearlong activities ahead of the main [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3259,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"THE INAUGURAL ENERGY PROFESSIONALS AWARDS 2021","_seopress_titles_desc":"Are you an Energy Professional or do you know an energy professional doing exemplary work in the energy industry? The Energy Professional Awards is here again in 2021.","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[201,24],"tags":[],"class_list":["post-3257","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-events","category-energy-industry-news"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3257","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3257"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3257\/revisions"}],"predecessor-version":[{"id":3261,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3257\/revisions\/3261"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3259"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3257"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3257"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3257"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}