{"id":3310,"date":"2022-03-08T12:37:30","date_gmt":"2022-03-08T12:37:30","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3310"},"modified":"2022-03-08T12:37:31","modified_gmt":"2022-03-08T12:37:31","slug":"the-new-face-of-waste-management","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/the-new-face-of-waste-management\/","title":{"rendered":"The New Face of Waste Management"},"content":{"rendered":"\n<p>By Linet Njeri<\/p>\n\n\n\n<p>I did a brief stint in the manufacturing sector as a brand manager. I was surprised one day to hear some banter between fellow brand managers on how pleased they were to see litter of their brand. For them, it was an indication that people were buying and using their brand as opposed to the competitors’. In fact, it was rumored that some competitors deliberately littered to show their dominance in the market. I won’t lie, I would secretly celebrate when I found packaging of my brand especially in some remote place I visited. It was a new brand and that was evidence of our market penetration.<\/p>\n\n\n\n<p>But let’s face it- the world today is choking in litter and the ecosystems of our oceans struggling to survive with the amount of plastic going into it. We must all wake up to the effects of our behavior. But who really is responsible for litter? Is it the manufacturer? Is it the user? Or the government? In my view, it is all of us.<\/p>\n\n\n\n<p>The government through the Ministry of Environment and Forestry in 2021 completed the development of the Extended Producer Responsibility Regulations 2021. According to NEMA (National Environment Management Authority), the purpose of these regulations is to provide a framework where the producer’s responsibility is extended to the post-consumer stage of the life-cycle of a product, which may include collection, sorting and treatment for recycling or recovery. Through this EPR, the government is aiming to stimulate the circular economy that ensures resource use efficiency, stimulates innovation and reduces the amount of waste that ends up in landfills and sometimes water bodies.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Who is the producer?<\/strong><\/h4>\n\n\n\n<p>According to the Extended Producer Responsibility Regulations 2021, a producer is defined as “an entity that introduces goods, products and packaging into the country using authorized means by manufacturing, importing, distributing, converting, selling or re-selling or otherwise brings” as per the Regulations. Some of the segments of industries that will be affected by these regulations include: Pharmaceutical companies, Nature-based industries such as leather, paper, textile and furniture; Electric and electronic equipment; Plastic Products; Industry and trade, Motor industry, and agriculture.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>How exactly will the regulations apply?<\/strong><\/h4>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" data-src=\"https:\/\/energyzedworld.com\/wp-content\/uploads\/2022\/03\/1-2-1024x599.png\" alt=\"\" class=\"wp-image-3313 lazyload\" width=\"574\" height=\"336\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 574px; --smush-placeholder-aspect-ratio: 574\/336;\" \/><\/figure>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" data-src=\"https:\/\/energyzedworld.com\/wp-content\/uploads\/2022\/03\/2-2-1024x592.png\" alt=\"\" class=\"wp-image-3314 lazyload\" width=\"573\" height=\"330\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 573px; --smush-placeholder-aspect-ratio: 573\/330;\" \/><\/figure>\n\n\n\n<p>The first diagram is a depiction of the current situation when it comes to waste emerging from consumer goods. The second diagram indicates how waste will be handled with the implementation of the regulations with collection, processing and recycling of waste added to the process. The regulations require producers to fulfil their obligations of waste management by setting up individual enterprise-based extended producer responsibility compliance scheme; or collectively through a pooled compliance scheme.<\/p>\n\n\n\n<p>The EPR compliance schemes will account for products and packaging in all phases of their life cycle to enhance environmental sustainability through ensuring environmentally friendly product designs, collection and recycling of waste, and promotion of a culture of environmental consciousness and responsibility by consumers. Within these schemes, there will be an entity known as the Producer Responsibility Organization (PRO), which refers to a membership organization set up to assume legal obligation for implementation of Extended Producer Responsibility on behalf of its members in a Collective compliance scheme.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" data-src=\"https:\/\/energyzedworld.com\/wp-content\/uploads\/2022\/03\/3-2-1024x610.png\" alt=\"\" class=\"wp-image-3315 lazyload\" width=\"568\" height=\"337\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 568px; --smush-placeholder-aspect-ratio: 568\/337;\" \/><\/figure>\n\n\n\n<p>The above diagram is a depiction of what a collective EPR scheme will look like. In this case, Processors will be the Producer Responsibility Organization. Producers within a collective compliance scheme shall pay membership fees to a registered and licensed producer responsibility organization to execute the obligations on behalf of its members.<\/p>\n\n\n\n<p>Last year, the Kenya Association of Manufacturers <a href=\"https:\/\/kam.co.ke\/kam-launches-business-plan-model-for-producer-responsibility-organization\/\" target=\"_blank\" rel=\"noreferrer noopener\">launched a business plan<\/a> for the establishment of a Plastic Producer Responsibility Organization (PRO) in Kenya. The launch of the Strategic Business Plan for a Plastic Producer Responsibility Organization (PRO) was in line with commitments made in the Kenya Plastic Action Plan as well as the Extended Producer Responsibility Regulations. These seeks to enable a circular economy for the environmentally sustainable use and recycling of plastics in Kenya. The Business Plan has been developed by KAM in partnership with Sustainable Inclusive Business under the KEPSA Foundation and the Embassy of the Kingdom of the Netherlands.<\/p>\n\n\n\n<p>The implementation of the Extended Producer Responsibility Regulations will ensure that producers play a huge part in the management of waste as well as education of the consumer about reusing and recycling of packaging. It will also spur innovation of biodegradable packaging as well as ensure environmentally friendly disposal at the end of the life of a product. This way, we will see better responsibility in the management of waste and in ensuring the coming to life of a circular economy. With the EPR Regulations, the manufacturer, government and user will have a role to play in waste management with the bigger burden falling on the manufacturer at the center of it all.<\/p>\n<div class=\"energ-after-content\" id=\"energ-3848997834\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Linet Njeri I did a brief stint in the manufacturing sector as a brand manager. I was surprised one day to hear some banter between fellow brand managers on how pleased they were to see litter of their brand. For them, it was an indication that people were buying and using their brand as [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3316,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"The New Face of Waste Management ","_seopress_titles_desc":"The implementation of the Extended Producer Responsibility Regulations will ensure that producers play a huge part in the management of waste as well as education of the consumer about reusing and recycling of packaging","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-3310","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3310","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3310"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3310\/revisions"}],"predecessor-version":[{"id":3317,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3310\/revisions\/3317"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3316"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3310"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3310"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3310"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}