{"id":3325,"date":"2022-04-07T11:34:08","date_gmt":"2022-04-07T11:34:08","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3325"},"modified":"2022-04-07T11:34:55","modified_gmt":"2022-04-07T11:34:55","slug":"the-world-energy-day-2022-theme-insights","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-industry-news\/the-world-energy-day-2022-theme-insights\/","title":{"rendered":"The World Energy Day 2022 Theme – Insights"},"content":{"rendered":"\n<p>By Carolyne Gathuru<\/p>\n\n\n\n<p>The World Energy Day 2022 theme around which the different WED activities are aligned is <em>“<\/em><strong><em>Empowering Energy independence in Africa: Enabling Rural &amp;Urban Renewable Energy Awareness, Access, and Affordability”<\/em><\/strong><\/p>\n\n\n\n<p>It is a subject matter whose time is due and around which discussions need to be held, to move the continent forward.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What however is Energy Independence?&nbsp;<\/strong><\/h3>\n\n\n\n<p>Globally, the internet toots this as &#8211; When a country is able to produce enough of its own fuel to meet its own demands, then it is referred to as being energy independent. Energy independence is something that large and energy-rich countries are attempting.<\/p>\n\n\n\n<p><strong>What does Energy Independence however mean<\/strong> in the context of the nation, the region, the continent? Does this global definition fit all? Is the bid for Energy independence about ceding off from the global energy race with regards to fuel sourcing or would it in the local context empowering households, facilities and institutions take charge of their energy supply and management?<\/p>\n\n\n\n<p>Currently the biggest conversation on the lips of citizens with regards to energy independence is twofold.<\/p>\n\n\n\n<p>The first is to figure out how to get off grid and to cede away from punitive costs of electricity. A quick look at the definition of the word off grid serves to express the needs of the populace.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image is-resized\"><img decoding=\"async\" data-src=\"https:\/\/lh3.googleusercontent.com\/F_-ABiJR1nj-kI1utw7e3Wnhjkl9_4zNrZz-D1AREIE6VS1-1LSdBsGrRvtHBU-xeN-m5QlgiSSoxzAcukUlmFE1yv1Hn569HDwwHhm3n2tv7_SQaxCFBPEu3StPjghncIoXSm_3\" alt=\"\" width=\"473\" height=\"350\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" class=\"lazyload\" style=\"--smush-placeholder-width: 473px; --smush-placeholder-aspect-ratio: 473\/350;\" \/><\/figure>\n\n\n\n<p>With a general monopoly from energy generating, transmitting and selling national organizations, Africans have a deep desire to run their own show and to have their energy use for lighting and powering electric gadgets, machinery and other items needing electricity to work at their fingertips. This makes a case for renewable energy solutions that can be wired and rewired for domestic and industrial use. The key questions that come to the fore with regards to Awareness, Affordability and Access of renewable energy solutions are:<\/p>\n\n\n\n<ol class=\"wp-block-list\"><li>Is the awareness penetration on renewable energy in terms of availability options, the mechanisms for purchase and installation and the use and monitoring in place with the right audiences to enable energy independent decision making?<\/li><li>If awareness is in place is the cost of purchase, fit out and installation of renewable energy solutions for domestic and industrial use affordable and within the reach of those that have made the decision to be energy independent?<\/li><li>If awareness and affordability are in place, is there access to the renewable energy solution at all levels of requirement, is this accessible in terms of vendor availability, geographical availability and route to last mile delivery?<\/li><\/ol>\n\n\n\n<p>The second most spoken about desire with regards to energy independence is the shift to clean cooking technologies that will free the cooking energy seekers from the burden of having this as an activity that is time and labour consuming.&nbsp;<\/p>\n\n\n\n<p>In Africa is is mainly the women and girl folk tasked with the responsibility of ensuring cooking fuel is available, owing to the fact that the entire cooking responsibility is in their domain. Having cooking fuel at hand to enable quick and easy operations is the energy independence target. Solutions to enable round the clock cooking fuel then releases time for more productive engagement in eking out a living and for the school going, more time to be engaged in gainful education both at school and at home. The physical burden of the weight of cooking fuel gathering, in the literal sense would provide the independence to enable productivity at what matters the most – quality living. In similar fashion the key questions that come to the fore with regards to Awareness, Affordability and Access of clean cooking technologies are:<\/p>\n\n\n\n<ol class=\"wp-block-list\"><li>Is there sufficient awareness on the continent and in the places it matters most, which at the moment are low income urban areas and peri and fully rural areas, on clean cooking technology and how it all works and that it is an option that can be explored beyond the traditional cooking methodologies that have transcended the years?<\/li><li>If awareness is in place, is the cost of the initial feasibility scoping, the infrastructure required for set up, the piping and fit out, monitoring and maintenance as well as production of the input materials to enable the clean cooking fuel readiness affordable for all that require this intervention to enable uptake at all levels?<\/li><li>If awareness and affordability are in place, is access to clean cooking technologies in the geographies where it is most needed, and across the economies where this would create energy independence transformation at the levels where it should be in terms of vendor reach and home to home, at the level it should be at?<\/li><\/ol>\n\n\n\n<p>These questions need to be deliberated upon and answered.&nbsp; And seeing to it that these are only 2 aspects of energy independence and the context in which it sits at the local and continental level, there is need for a wider focus.<\/p>\n\n\n\n<p>&nbsp;The WED celebrations including awareness creation talks online and in institutions, review of policy and legislation on energy, energy Youth Innovation Challenge, an Energy Professionals Award Ceremony will amplify the theme and have conversations in these realms cutting across ten SDG’s (1, 2, 3, 4, 5, 6, 7, 8, 10, 11, 13, and 15) in the Energy Independence and Renewal Energy uptake agenda.&nbsp; This is most definitely the time and space to be part of this discussion and to have this theme take center stage in transforming the Energy landscape in the region.<\/p>\n<div class=\"energ-after-content\" id=\"energ-1009259560\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Carolyne Gathuru The World Energy Day 2022 theme around which the different WED activities are aligned is “Empowering Energy independence in Africa: Enabling Rural &amp;Urban Renewable Energy Awareness, Access, and Affordability” It is a subject matter whose time is due and around which discussions need to be held, to move the continent forward. What [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2421,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"The World Energy Day 2022 Theme – Insights","_seopress_titles_desc":"The World Energy Day 2022 theme around which the different WED activities are aligned is “Empowering Energy independence in Africa: Enabling Rural &amp;Urban Renewable Energy Awareness, Access, and Affordability”","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,24],"tags":[],"class_list":["post-3325","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-energy-industry-news"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3325","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3325"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3325\/revisions"}],"predecessor-version":[{"id":3327,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3325\/revisions\/3327"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/2421"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3325"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3325"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3325"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}