{"id":3344,"date":"2022-06-02T05:59:56","date_gmt":"2022-06-02T05:59:56","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3344"},"modified":"2022-06-02T05:59:57","modified_gmt":"2022-06-02T05:59:57","slug":"convergence-of-energy-management-and-project-commissioning","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-financial-calculator\/convergence-of-energy-management-and-project-commissioning\/","title":{"rendered":"Convergence of Energy Management and Project Commissioning"},"content":{"rendered":"\n<p>By Chris Mbori<\/p>\n\n\n\n<p>For a very long time, I used to associate project commissioning to the “ribbon cutting” opening event ceremony that marks the official opening of a site. And as much as that could be part of the commissioning process, the term commissioning involves much more than that.<\/p>\n\n\n\n<p>Commissioning is defined as a quality focused process aimed to enhance the delivery of a project. It is a quality assurance and quality control approach that involves verifying and documenting that the facility’s systems and assemblies are meeting the Owner’s Project Requirements.<\/p>\n\n\n\n<p>It is said that the best built project, if not commissioned well, may become a nightmare to the owner and its operators. There is a lot that goes into proper commissioning than just ribbon cutting. Commissioning is more of a process than an event. The commissioning process for a new building or project will start from the pre-design stage, move to the design stage,&nbsp; involve the construction phase, then to the occupancy or operation phase of the project, and may continue in the life cycle of the project or building through on-going commissioning.<\/p>\n\n\n\n<p>It is when we start looking at commissioning of existing buildings (also called Retro-Commissioning) that we start to see a clear convergence between energy management and commissioning. Numerous case studies of existing building commissioning have shown energy savings of up to 30% specifically if the commission is focused on energy consuming mechanical, electrical systems and building management systems. In addition to the energy savings, other multiple benefits like improved Indoor air quality, improved space comfort, tenant satisfaction and fewer operational and maintenance calls are witnessed for the building or project.<\/p>\n\n\n\n<p>The part where energy management and Retro-Commissioning circles start to overlap is in the process of finding Energy Savings for a particular existing building or project. In energy management, that process of finding savings is typically called an energy audit. While an energy audit would generally come up with more CAPEX (Capital Expenditure) related retrofits or opportunities, a retro-commissioning process would generally identify low-cost operation and maintenance that should be implemented immediately to meet the current facility requirements.<\/p>\n\n\n\n<p>Commissioning is therefore a double-edged sword that will orchestrate a quality assurance and control benefit to the project, while at the same time offering energy management with a conservation theme. Additional energy savings can be achieved by adopting a Monitoring Based Commissioning (MBCx) approach. The monitoring role brings savings in 3 different ways listed below:<\/p>\n\n\n\n<ol class=\"wp-block-list\" type=\"1\"><li>Savings from early identification of deficiencies through monitoring<\/li><li>New measures are also identified through metering and trending of the initial commissioning<\/li><li>New measures are also identified during the lifecycle of the project.<\/li><\/ol>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" data-src=\"https:\/\/energyzedworld.com\/wp-content\/uploads\/2022\/06\/p4-1024x720.jpg\" alt=\"\" class=\"wp-image-3346 lazyload\" width=\"567\" height=\"398\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 567px; --smush-placeholder-aspect-ratio: 567\/398;\" \/><\/figure>\n\n\n\n<p>In Mid 2021, the Federal Energy Management Program (FEMP) published a report indicating the Monitoring based commissioning can be included as an energy conservation measure in energy performance contracts. This is simply to increase energy savings and the life cycle of a project or building. These increased savings would typically free up cash for other capital projects in the energy performance contracts.<\/p>\n\n\n\n<p>The convergence of energy management and project commissioning whether on start, mid-way or post completion commissioning, it is a wise to have an energy management approach embedded within.<\/p>\n\n\n\n<p>For more information about the report, <a href=\"https:\/\/www.energy.gov\/sites\/default\/files\/2021-07\/enhancing-performance-contracts-mbcx.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">click here<\/a>.<\/p>\n\n\n\n<p>If interested in becoming a Certified Building Commissioning Professional (CBCP) Check out <a href=\"https:\/\/www.aeecenter.org\/certified-building-commissioning-professional\/\" target=\"_blank\" rel=\"noreferrer noopener\">this link<\/a>.<\/p>\n<div class=\"energ-after-content\" id=\"energ-2892720093\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Chris Mbori For a very long time, I used to associate project commissioning to the “ribbon cutting” opening event ceremony that marks the official opening of a site. And as much as that could be part of the commissioning process, the term commissioning involves much more than that. Commissioning is defined as a quality [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2637,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"Convergence of Energy Management and Project Commissioning","_seopress_titles_desc":"Commissioning is defined as a quality focused process aimed to enhance the delivery of a project. It is a quality assurance and quality control approach ","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,197],"tags":[],"class_list":["post-3344","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-energy-financial-calculator"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3344","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3344"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3344\/revisions"}],"predecessor-version":[{"id":3347,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3344\/revisions\/3347"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/2637"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3344"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3344"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3344"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}