{"id":3349,"date":"2022-06-13T08:43:17","date_gmt":"2022-06-13T08:43:17","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3349"},"modified":"2022-06-13T08:43:17","modified_gmt":"2022-06-13T08:43:17","slug":"identifying-energy-savings-opportunities-in-compressed-air-systems","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-financial-calculator\/identifying-energy-savings-opportunities-in-compressed-air-systems\/","title":{"rendered":"Identifying Energy Savings Opportunities in Compressed Air Systems"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">Truth Be Told!<\/h2>\n\n\n\n<p>By Irvine Koech<\/p>\n\n\n\n<p>We don’t care much about things that are readily available, and often unseen. Despite its numerous applications, compressed air is one of those utilities that we don’t give much thought to. The air that goes into our car tires or packets of crisps is not stored in gigantic cylinders and replenished naturally. All the hard work of drawing air from the atmosphere and reducing its volume so that it fits into a storage cylinder is done by a motor-driven machine known as a compressor.<\/p>\n\n\n\n<p>It does not come as a surprise that most people do not bother to ascertain if their compressed air systems are running efficiently. Just because you still get some air out of the nozzle does not mean that your compressor is running as it should be. It is important to note that energy losses in compressed air systems occur from the supply side all the way to the demand side. When these energy losses go unchecked, the compressor is usually forced to work harder than it normally should. It is for this reason that your electricity costs will keep escalating.<\/p>\n\n\n\n<p>By the time a compressor finishes reducing the volume of atmospheric air and channeling it to the storage cylinder, energy losses would have already occurred within the system. 5% of the supplied energy is taken up by mechanical losses which occur as a result of the movement of pistons or vanes within the compressor’s cylinder. A lot of heat is generated when the volume of air is reduced within controlled conditions. For safety purposes, a compressor has to undergo some form of cooling as it operates, otherwise the heated air could cause fires if it comes into contact with lubricants or any other combustible materials. 80% of the supplied energy is lost in the process of reducing the volume of air and subsequently cooling it. Therefore, only 10-15% of the supplied energy ends up being used for meaningful work. No wonder compressors are said to have an efficiency of 10-15%.<\/p>\n\n\n\n<p>The overall efficiency of a compressor can still drop below the 15% mark as a result of losses that occur on the demand side. Air leakages found in threaded joints, hoses, couplings and fittings are some of the major challenges faced when dealing with compressed air systems. Other challenges include (but are not limited to) pressure loss due to improper sizing of the pipes, corrosion of pipes and metal rust caused by poor drying of compressed air. Some of these problems can be looked at as low hanging fruits when it comes to identifying energy saving opportunities because they can be fixed with minimal investment costs.<\/p>\n\n\n\n<p>Given the myriad of challenges that occur within compressed air systems, it is important to keep track of the performance of the system through monitoring. In today’s world, data drives decision making. If you are interested in determining the efficiency of the compressor, you will need to collect vital data such as the input power and the flow rate. With such information, it becomes easier to develop and track Key Performance Indicators (KPIs) for the compressed air system. For more information on the types of KPIs for industrial compressed air systems, please check out the <a href=\"https:\/\/www.csagroup.org\/store\/product\/C837-16\/\" target=\"_blank\" rel=\"noreferrer noopener\">CSA C837 Standard: Monitoring &amp; Energy Performance of Compressed Air Systems.<\/a><\/p>\n\n\n\n<p>In conclusion, it is evident that people stand to make significant reductions on their energy expenses by paying attention to how their compressed air system behaves. Some of the interventions do not require tremendous amounts of effort. Checking for air leakages and minimizing waste by using compressed air for the right purpose could result in lower energy consumption. Before you purchase or replace a compressor, it is important to engage the right professionals so that they can guide you on selecting the right compressor size for your needs. Experts will also leave you with important nuggets of wisdom that would enable you to get the most value out of your investment. For instance, most clients would want to settle on PVC piping for distributing compressed air within a facility since they are cheaper than steel or aluminum pipes. Given that such pipes degrade easily, they pose safety hazards when they become brittle and start oozing compressed air that is under enormous pressure.&nbsp;<\/p>\n<div class=\"energ-after-content\" id=\"energ-2026329292\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Truth Be Told! By Irvine Koech We don’t care much about things that are readily available, and often unseen. Despite its numerous applications, compressed air is one of those utilities that we don’t give much thought to. The air that goes into our car tires or packets of crisps is not stored in gigantic cylinders [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2887,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":" Identifying Energy Savings Opportunities in Compressed Air Systems ","_seopress_titles_desc":"Given the myriad of challenges that occur within compressed air systems, it is important to keep track of the performance of the system through monitoring. In today’s world, data drives decision making","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,197],"tags":[],"class_list":["post-3349","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-energy-financial-calculator"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3349","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3349"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3349\/revisions"}],"predecessor-version":[{"id":3351,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3349\/revisions\/3351"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/2887"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3349"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3349"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3349"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}