{"id":3377,"date":"2022-10-13T05:29:56","date_gmt":"2022-10-13T05:29:56","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3377"},"modified":"2022-10-13T09:25:53","modified_gmt":"2022-10-13T09:25:53","slug":"energy-saving-in-gypsum-decoration","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-financial-calculator\/energy-saving-in-gypsum-decoration\/","title":{"rendered":"ENERGY SAVING IN GYPSUM DECORATION"},"content":{"rendered":"\n<p>By Eleen Korir<\/p>\n\n\n\n<p>The decoration of gypsum has been a trend for the past few years. The most popular decoration are the chandelier, downlights and snake lights. Chandeliers and down lights are usually installed in hallways, living rooms, bedrooms and dining rooms. Snake lights are in most cases installed in the living\/dining rooms, but they can also be installed in the bedrooms. Lighting is a key factor in the decoration of a room using gypsum. It can set the mood and create the atmosphere for any event.<\/p>\n\n\n\n<p>The use of light in gypsum decoration is a subject that has been studied for centuries. In the Middle Ages, illumination was scarce and expensive; people only had candles or oil lamps for lighting their homes. Nowadays, we have many different types of lights available to us: from traditional chandeliers to modern down lighters &#8211; there are plenty of options that are more energy efficient than ever before!<\/p>\n\n\n\n<p>Lighting is not only a significant contributor to the overall energy use of a building, but it also affects our mood and productivity levels. It accounts for about 20% of the total electricity consumption in an average office building.The lighting should be designed in such a way that it can provide sufficient light and also be cost-effective. Lighing in gypsum decoration is one of the most energy-consuming sectors in the construction industry. The high energy use in Lighting in gypsum decoration is due to the use of down lighters and chandeliers which are not energy efficient.<\/p>\n\n\n\n<p>There are many ways to save energy when it comes to lighting in gypsum decorations. One way is by using down lighters which use less power than traditional light bulbs. Another way is by using chandeliers, which are decorative and provide ample light for any occasion.<\/p>\n\n\n\n<p>The demand for down lighters is on the rise because of their high efficiency and low maintenance. Down lighters can be installed on the ceiling or on walls, depending on the type of lighting desired. They are less likely to create glare or shine into eyes, making them a great option for gypsum decoration. They are also more cost-effective than chandeliers. Additionally, it is necessary to reduce the use of high-energy lamps and replace them with LED down lighters and chandeliers or using down lighters or chandeliers instead of up lighters or recessed lights.<\/p>\n\n\n\n<p>Down lighters are designed with a reflector that directs light downwards and outwards, which reduces the amount of light needed to illuminate an area. When doing your gypsum decoration, it is important to know the number of downlighters to use. This will ensure you have sufficient lighting in your house as well not put too many downlights that will consume more energy and make your room too bright. The number of downlighters is dependent on the size of the room. The number of down lighters per square foot is calculated by dividing the total wattage of your fixture by the area&#8217;s square footage.<\/p>\n\n\n\n<p>In the United States, the average home is responsible for about 10,000 kWh of electricity annually. This energy use can be attributed to not only lighting, but also cooling and heating during winter and summer respectively. In comparison, Kenya consumes an average of 5,000 kWh per year which is high compared to the population and size of population connected to the grid. This is a huge amount of electricity that could be saved if we just make some simple changes in the way we use light like choosing the LED down lighters, snake lights and chandeliers that are either LED or use Halogen bulbs as opposed to the traditional bulbs.<\/p>\n\n\n\n<p>In conclusion, while gypsum decoration is in great interior design, it is important to put into consideration the following:<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li>The wattage of the chandeliers and downlighters<\/li><li>The number of downlighters per square foot<\/li><li>Use of LED bulbs as opposed to traditional bulbs<\/li><li>The amount of light you require in each room<\/li><\/ul>\n\n\n\n<p><\/p>\n<div class=\"energ-after-content\" id=\"energ-2837395753\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Eleen Korir The decoration of gypsum has been a trend for the past few years. The most popular decoration are the chandelier, downlights and snake lights. Chandeliers and down lights are usually installed in hallways, living rooms, bedrooms and dining rooms. Snake lights are in most cases installed in the living\/dining rooms, but they [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3388,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"ENERGY SAVING ON LIGHTING IN GYPSUM DECORATION","_seopress_titles_desc":"There are many ways to save energy when it comes to lighting in gypsum decorations. One way is by using down lighters which use less power than traditional light bulbs. Another way is by using chandeliers, which are decorative and provide ample light for any occasion.","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,197,201],"tags":[],"class_list":["post-3377","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-energy-financial-calculator","category-events"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3377","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3377"}],"version-history":[{"count":8,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3377\/revisions"}],"predecessor-version":[{"id":3393,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3377\/revisions\/3393"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3388"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3377"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3377"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3377"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}