{"id":3427,"date":"2023-03-13T13:54:15","date_gmt":"2023-03-13T13:54:15","guid":{"rendered":"https:\/\/energyzedworld.com\/?p=3427"},"modified":"2023-03-24T05:24:06","modified_gmt":"2023-03-24T05:24:06","slug":"an-energized-youth-for-an-energyzed-world","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/an-energized-youth-for-an-energyzed-world\/","title":{"rendered":"<strong>An Energized Youth, for an Energyzed World<\/strong>"},"content":{"rendered":"\n<p>By Kelvin Musyoki<\/p>\n\n\n\n<p>My journey to the energy space might have started when I stumbled upon a proposed final year project on renewable energy. I was an undergraduate Mechanical Engineering student almost bolting out of campus with a desire to practice Mechanical Engineering. I was prepared to crown the 5 years of learning with a purely Mechanical Engineering project. How I managed to pick an energy project still puzzles me, but where that decision has led me is pure bliss! That project acted as a stepping stone to another phase of a fulfilling adventure in the energy space. Fast forward, after graduating, just like many graduates, I kept my hopes for a promising energy career up. The opportunity finally came when a friend shared a poster that invited young people to apply for training, a program named <a href=\"https:\/\/eenovators.com\/youth-in-energy-empowerment-program-yeep-2\/\" target=\"_blank\" rel=\"noreferrer noopener\">‘Youth in Energy Empowerment Program’ (YEEP)<\/a>. I applied, got selected, went through the program and finally got an internship in<a href=\"https:\/\/eenovators.com\/\" target=\"_blank\" rel=\"noreferrer noopener\"> Eenovators<\/a>, from where I sit, happily writing this blog!<\/p>\n\n\n\n<p>As an aspiring engineer, I eagerly looked forward to my first class as a first year student in university. As soon as we started studies, I was already looking forward to step out of class and practice what we called ‘real engineering’ in the field. Nothing excites an engineer like marrying theory to practice. The YEEP program provided a platform for that union. We received rigorous training on energy. Among the topics we went through were Essential skills, Energy Management, Measurement and Verification, Lighting and HVAC Systems. I also got to interact and learn a lot from other energy enthusiasts. It heightened my interest and passion for energy.<\/p>\n\n\n\n<p>“I would like you guys to start in the deep end”. That was one of the striking statements that I vividly recall hearing from Chris Mbori (CEO at Eenovators) during the first week of my internship. His promise surely came to pass. The other person who was going to accompany in this ‘deep end’ was Catherine Njeri, my colleague\/intern. We were thoroughly oriented by the Eenovators team then introduced to a project where we would help in writing implementation reports for a company with more than 30 sites! I learned a lot including historical data analysis, regression &amp; CUSUM analysis and tracking implementation of energy conservation measures. I have had opportunities to join other engineers in conducting walkthroughs during initial stages of energy audits, installation and retrieval of energy meters, collection and collation of data and identification of energy management opportunities. In addition, I have had an opportunity to attend a presentation of an energy audit report in a hospital. I recently got an opportunity to join a team at the outset of an energy audit. I hope to learn a lot and hone my skills from this and other audits. Last but not least, I have been well trained on operational safety because at the center of any successful site work is a safe working environment. Certainly, the YEEP program led me to a company that is at the forefront of championing an efficiently energized world and innovation in energy.<\/p>\n\n\n\n<p>The major challenge was the full throttle transition into energy engineering as a mechanical engineer. However, it has turned out to be advantageous since it has presented a learning platform in a field that has immense potential and is at the center of global attention.<\/p>\n\n\n\n<p>Undoubtedly, I started from the deep end and I will gladly continue as long I am growing in my profession and partnering to <em>energyze the world<\/em>. Thanks to YEEP and thanks to <a href=\"https:\/\/eenovators.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Eenovators.<\/a><\/p>\n<div class=\"energ-after-content\" id=\"energ-3828993208\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Kelvin Musyoki My journey to the energy space might have started when I stumbled upon a proposed final year project on renewable energy. I was an undergraduate Mechanical Engineering student almost bolting out of campus with a desire to practice Mechanical Engineering. I was prepared to crown the 5 years of learning with a [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3434,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"","_seopress_titles_desc":"My journey to the energy space might have started when I stumbled upon a proposed final year project on renewable energy. I was an undergraduate Mechanical Engineering student almost bolting out of campus with a desire to practice Mechanical Engineering. I was prepared to crown the 5 years of learning with a purely Mechanical Engineering project. How I managed to pick an energy project still puzzles me\r\n","_seopress_robots_index":"","_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,207],"tags":[],"class_list":["post-3427","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-youth-empowerment"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3427","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=3427"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3427\/revisions"}],"predecessor-version":[{"id":3439,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/3427\/revisions\/3439"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/3434"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=3427"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=3427"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=3427"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}