{"id":352,"date":"2019-05-16T13:05:01","date_gmt":"2019-05-16T13:05:01","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=352"},"modified":"2020-01-13T12:08:56","modified_gmt":"2020-01-13T12:08:56","slug":"can-water-use-also-be-more-efficient","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/can-water-use-also-be-more-efficient\/","title":{"rendered":"Can Water Use Also Be More Efficient?"},"content":{"rendered":"<p>By Ombajo  V Gedion<\/p>\n<p>Of all the resources that seem to have long been forgotten, water leads the pack. Rarely do we hear of its conservation or efficient use being championed. Throughout history, water has been inexpensive to a larger extent and has also been greatly perceived to be plenteous. These misconceptions have not been farfetched, yet therein lies the danger, the call for action, and behavior change that will make efficient water usage plentiful in all conservation policies and campaigns.<\/p>\n<p>None, or very few incentives, exist, if any, for water conservation. In fact, wastage of water doesn’t seem to ring a caution bell in the collective consciousness of humanity. In the current world, there has been massive population growth and fast economic enhancement on one side and aging water infrastructure and regional droughts on the other.  These have impacted negatively on the structures, systems and agencies that are tasked with water supply. Demand has risen to astronomical levels. Industries have increased just as much as households have. As a result, there has been seen rising water rates, insufficient supply, and restricted supply. What was once plentiful has almost evolved overnight into a luxury.<\/p>\n<p>In most cases, water utilities try to implement maximum water-use levels to manage supply yet this is still not commonplace. Facilities that consume water therefore must find ways to reduce water use without affecting their operations and output. The beauty with efficient use of water is that it cuts back on costs and sometimes maintenance costs also go down. In addition, facilities that are water conscious and implement a water saving plan, tend to get back their investments. Just like in energy efficiency programs, water efficient programs eventually pay back for themselves. An intentional water saving initiative that addresses all aspects of water use within a facility is thus not just a matter of necessity, but also of urgency. These aspects definitely include supply, usage and handling of waste water.<\/p>\n<p>One important tool that can help in saving water use is the <a href=\"https:\/\/www.swfwmd.state.fl.us\/conservation\/audits\/wateraudits\" target=\"_blank\" rel=\"noopener noreferrer\">water audit<\/a>. This is the most effective tool and the first essential step toward understanding a facility’s water use and the strategies that can be effected to reduce it. An audit will trace water use from its point of entry into the facility, its use and eventual discharge into the sewer. The audit will pinpoint each area of water use within and around the facility and approximate the quantity of water used at each of these points. Unaccountable water losses and possible leaks are identified and quantified. The audit then provides facility management with a road map of potential savings, as well as implementation costs.<\/p>\n<p>One other key aspect of a water audit is the focus on water quality.  Water audits deals with water quality just as much as it focuses on quantity. Huge potential savings lies in recycling and harvesting of rainwater. Alternative water sources can also be explored. A complete water audit will delve on all the major areas of water consumption in a facility including sanitation, maintenance, irrigation, and so on. In all these specific areas, the audit will give a breakdown of the how, when and where of water use. Audit your water use and save money and the environment.<\/p>\n<p>The Writer is an Energy Engineer at Eenovators Ltd.<\/p>\n<div class=\"energ-after-content\" id=\"energ-3764779398\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Ombajo  V Gedion Of all the resources that seem to have long been forgotten, water leads the pack. Rarely do we hear of its conservation or efficient use being championed. Throughout history, water has been inexpensive to a larger extent and has also been greatly perceived to be plenteous. These misconceptions have not been [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":628,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-352","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/352","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=352"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/352\/revisions"}],"predecessor-version":[{"id":1249,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/352\/revisions\/1249"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/628"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=352"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=352"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=352"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}