{"id":528,"date":"2018-04-19T02:59:50","date_gmt":"2018-04-19T02:59:50","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=15"},"modified":"2020-01-13T12:40:32","modified_gmt":"2020-01-13T12:40:32","slug":"revolution-of-wind-technology","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-industry-news\/revolution-of-wind-technology\/","title":{"rendered":"Wind Energy, The Next Big Thing"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">Revolution of Wind Technology<\/h2>\n\n\n\n<p>The last few years have seen a significant increase in the global number of installed wind turbines. Currently, wind energy is a key contributor to the national grid in many countries across the world. In 2010, wind was already contributing 2.5% of the total global electricity.<\/p>\n\n\n\n<p>To improve the quality and efficiency of wind turbines, new wind turbines have bigger blades coupled with other features which make electricity more cost-effective. The 2.5-120 turbine released by General Electric (GE) Company in January 2013 has algorithms and sensors that enable it to continue spinning without wind. There are several other improvements and innovations in wind energy technology.<\/p>\n\n\n\n<p>Apple Inc has an interesting idea of using heat energy instead of the conventional kinetic energy to generate wind energy. According to an application at the US Patent and Trademark Office dated June 2011, the company proposes the use of stored energy instead of kinetic energy to solve variability problems.<\/p>\n\n\n\n<p>In yet another amazing innovation, a group of Dutch researchers from the Delft Technical University plan to launch a bladeless wind turbine soon. The Electrostatic Wind Energy Convertor (EWICON) produces electricity more effectively. Contrary to the conventional turbines which use mechanical energy, the EWICON uses charged water droplets to create electrical energy.<\/p>\n\n\n\n<p>Researchers are also looking into ways of using train wind to generate electricity. This is a concept from Delhi University by a group of students who think the Metro Network could serve a number of small turbines. Upon implementation of the project, one turbine could generate 200 Watts per hour.<\/p>\n\n\n\n<p>There are many other wind technology innovations including solar-powered turbines, the Wind Explorer which is a wind powered car, and skyscrapers wind turbines. All the wind technology innovations aim to make wind energy harvesting more efficient while solving various problems.<\/p>\n\n\n\n<p>As a result of escalating oil prices, Kenya looks to exploit its huge wind energy potential. The National Wind Atlas is one of the government initiatives for enhancing investment in wind energy. Although the use of wind energy has not been significant in Kenya, the ongoing Lake Turkana Wind Power (LTWP) project, Marsabit’s 300MW project and 60MW plant in Kinangop show the Kenyan Government’s ambitions in wind energy.<\/p>\n\n\n\n<p>In addition, concerted efforts by researchers enhance the use of wind technology, especially in the rural areas of Kenya. For example, Dr. Sam Doby and his Access Kenya Limited (AKL) group have designed and distributed micro turbines in Nyanza, Western Kenya. These turbines help households with energy needs. Kenyans in tea producing areas are also benefiting from wind energy through Izzy Projects owned by the Dutch Pim De Ridder. This firm designs wind power projects for use in tea factories.<\/p>\n\n\n\n<p>Due to concerns about the environment and escalating oil prices, wind technology is developing very fast. With increased interest in wind energy both globally and locally, the prevailing energy problems could soon be forgotten.<\/p>\n<div class=\"energ-after-content\" id=\"energ-2089534241\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Revolution of Wind Technology The last few years have seen a significant increase in the global number of installed wind turbines. Currently, wind energy is a key contributor to the national grid in many countries across the world. In 2010, wind was already contributing 2.5% of the total global electricity. To improve the quality and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":746,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[24],"tags":[],"class_list":["post-528","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-energy-industry-news"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/528","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=528"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/528\/revisions"}],"predecessor-version":[{"id":1463,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/528\/revisions\/1463"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/746"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=528"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=528"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=528"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}