{"id":531,"date":"2017-05-26T11:44:08","date_gmt":"2017-05-26T11:44:08","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=70"},"modified":"2020-01-13T12:42:41","modified_gmt":"2020-01-13T12:42:41","slug":"hydro-power-harnessing-the-power-of-water","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/hydro-power-harnessing-the-power-of-water\/","title":{"rendered":"HYDRO POWER: HARNESSING THE POWER OF WATER"},"content":{"rendered":"\n<p>It is the rainy season and much of the country is receiving a lot of rain. Even though the rains have been accompanied by increased level of destruction to infrastructure, widespread flooding and lose of life in some cases, on the positive side, we are already starting to experience its positive impacts.<\/p>\n\n\n\n<p>Overall inflation is going down since there is more supply of agricultural goods in the market and KPLC has hinted on the possibility of it lowering the electricity price per kilowatt-hour unit since more of the power it is buying in bulk for onward distribution to the customers is being generated using hydro and not the expensive thermal power systems. Just the other day the <a href=\"http:\/\/en.wikipedia.org\/wiki\/William_Ruto\">Deputy President<\/a> hinted at a further reduction of the grid connection fee to about 15,000 in the next two years.<\/p>\n\n\n\n<p>With a lot of water flowing in many rivers and streams it is possible to harness the energy in the water to generate power for domestic use using micro hydropower systems. These systems usually generate up to 100 kilowatts (kW) of electricity. A micro hydro power system can supply homeowners and small business owners such as farmers and ranchers with enough electrical power. For example a 10-kilowatt micro hydropower system can provide enough power for a large home, a small resort business or a farm.<\/p>\n\n\n\n<p>But how does one generate power from water? Generally hydropower systems use the energy in flowing water to produce electricity or and mechanical energy. Even though one can dam the river so as to harness the moving water to produce energy, for micro hydropower systems, run-of-the-river systems which does not require large storage reservoirs is often used.<\/p>\n\n\n\n<p>A run off river micro hydropower consists of a water conveyance, a water Turbine, a pump or waterwheel, an alternator or generator, regulators and wiring. For run-of-the-river micro hydropower system, a portion of a river&#8217;s water is diverted to a <a href=\"http:\/\/www.energysavers.gov\/your_home\/electricity\/index.cfm\/mytopic=11110\">water conveyance<\/a> system that is usually a channel, a pipeline, or pressurized pipeline (penstock) that delivers it to a <a href=\"http:\/\/www.energysavers.gov\/your_home\/electricity\/index.cfm\/mytopic=11120\">turbine (for electricity generation) or waterwheel<\/a> (for mechanical power). The moving water rotates the wheel or turbine, which spins a shaft. The motion of the shaft can be used for mechanical processes, such as pumping water, or it can be used to power an alternator or generator to generate electricity. The micro hydropower system can be <a href=\"http:\/\/www.energysavers.gov\/your_home\/electricity\/index.cfm\/mytopic=10520\">connected to an electric distribution system (grid-connected)<\/a>, or it can <a href=\"http:\/\/www.energysavers.gov\/your_home\/electricity\/index.cfm\/mytopic=10610\">stand alone (off-grid)<\/a>.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Evaluating a Potential Micro hydropower Site<\/h4>\n\n\n\n<p>To build a micro hydropower system, you need access to flowing water on your property. A sufficient quantity of falling water must be available throughout or for the better part of the year. The best sites are but not always, hilly or mountainous. Other important considerations for a potential micro hydropower site include the site power output, its economics, relevant permits required, and water rights to abide to.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignright\"><a href=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2013\/08\/hydro.jpg\"><img decoding=\"async\" data-src=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2013\/08\/hydro-300x183.jpg\" alt=\"hydro power\" class=\"wp-image-73 lazyload\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 300px; --smush-placeholder-aspect-ratio: 300\/183;\" \/><\/a><\/figure><\/div>\n\n\n\n<p>For the site power output one need to determine the head (the vertical distance the water falls) and the flow (the quantity of water falling in liters or meters cube).<\/p>\n\n\n\n<p>Commercially available turbines and generators are usually sold as a package. Do-it-yourself systems require careful matching of a generator with the turbine horsepower and speed. Many systems also use an <a href=\"http:\/\/www.energysavers.gov\/your_home\/electricity\/index.cfm\/mytopic=10650\">inverter<\/a> to convert the low-voltage direct current (DC) electricity produced by the system into 120 or 240 volts of alternating current (AC) electricity.<\/p>\n\n\n\n<p>Whether a micro hydropower system will be <a href=\"http:\/\/www.energysavers.gov\/your_home\/electricity\/index.cfm\/mytopic=10520\">grid-connected<\/a> or <a href=\"http:\/\/www.energysavers.gov\/your_home\/electricity\/index.cfm\/mytopic=10610\">stand-alone<\/a> will determine many of its balance of system components. For example, some stand-alone systems use <a href=\"http:\/\/www.energysavers.gov\/your_home\/electricity\/index.cfm\/mytopic=10630\">batteries<\/a> to store the electricity generated by the system. However, because hydropower resources tend to be more seasonal in nature than wind and solar, batteries may not always be practical for micro hydropower systems. If batteries are used to store power, they should be located as close to the turbine as possible since it is difficult to transmit low-voltage power over long distances.<\/p>\n\n\n\n<p>Whatever the upfront costs of the micro hydropower system, a typical hydroelectric system last for long meaning payback period is shorter. Currently there are systems that were installed in the country in 1920’s that are still working perfectly. As long as there is water, the system will continue producing electricity with occasional maintenance being replacement of bearings and other moving parts of the turbines. Maintenance is generally not expensive.<\/p>\n<div class=\"energ-after-content\" id=\"energ-756548313\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>It is the rainy season and much of the country is receiving a lot of rain. Even though the rains have been accompanied by increased level of destruction to infrastructure, widespread flooding and lose of life in some cases, on the positive side, we are already starting to experience its positive impacts. Overall inflation is [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":732,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[26,27,28,40],"class_list":["post-531","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","tag-alternative-energy","tag-certified-energy-manager","tag-energy","tag-licenced-energy-auditors"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/531","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=531"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/531\/revisions"}],"predecessor-version":[{"id":1468,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/531\/revisions\/1468"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/732"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=531"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=531"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=531"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}