{"id":532,"date":"2019-05-16T14:08:10","date_gmt":"2019-05-16T14:08:10","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=94"},"modified":"2020-01-13T12:08:31","modified_gmt":"2020-01-13T12:08:31","slug":"how-to-use-biogas-to-power-your-vehicle","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/how-to-use-biogas-to-power-your-vehicle\/","title":{"rendered":"How to use Biogas to power your Vehicle"},"content":{"rendered":"<p>Biogas is an established, renewable, clean and particulate-free source of energy that is an alternative to many fuels and especially biomass based fuels such as firewood and charcoal. At household level, the gas is predominantly used to provide clean fuel for cooking and lighting. The gas can also be used to replace fossil fuels such as petrol, diesel, and natural gas as some of the fuels used to power motor vehicles and to run plant machinery.<\/p>\n<p>To achieve this, the raw gas from the <a href=\"http:\/\/www.amazon.com\/gp\/product\/B003BVJCEA?ie=UTF8&amp;camp=1789&amp;creativeASIN=B003BVJCEA&amp;linkCode=xm2&amp;tag=kenyaan-20\" target=\"_blank\" rel=\"noopener noreferrer\">digester<\/a> has to be enriched first through purification, compression and bottling of the gas depending on its final application. In Europe especially Germany, Sweden, Switzerland, Italy and Denmark, use of biogas and natural gas in both public and private transport sectors is a fast growing phenomenon. Germany has 622 biogas\/natural gas refueling stations while Italy has 521 stations. There are available passenger cars, buses and trucks that run on enriched biogas\/natural gas from such manufacturers like Volvo, Mercedes, FIAT, MAN and Ford among many others.<\/p>\n<p>Compared to natural gas that has between 75-98 % methane with small percentages of ethane, butane and propane, the composition of raw biogas from a digester has approximately 60% methane and 40% carbon dioxide. It also contains trace elements of hydrogen sulfide and moisture. This composition makes the quality of the gas not good enough to be used as fuel for to power machinery. But there is available and proven technology that can improve the methane content of biogas. It is currently possible to improve the quality of biogas by enriching its methane content to a level where it matches that of natural gas. With methane enrichment and compression of the gas, it can be used as fuel to power motor vehicle that runs on compressed natural gas (CNG). Biogas lower emission levels compared to those of natural gas and diesel makes it more desirable and climate friendly.<\/p>\n<p>But how is the biogas enriched? There are many ways in which the gas can be enriched but the most common, low cost and fairly simple in application is water scrubbing. In this method, the raw biogas is injected from the bottom of a packed scrubber with pressurized water being injected from above. Since carbon dioxide is soluble in water under different temperatures and pressures, ideally a water scrubber dissolves between 95-98% of the carbon dioxide contained in the biogas. Thus, the initial 40 % carbon dioxide present in raw biogas is reduced to about 2 % by volume in enriched biogas. To increase the solubility of carbon dioxide in water, raw biogas is also compressed up to about 1.0 MPa pressure.<\/p>\n<p>Since enriched biogas can be used to power motor vehicles and machinery. It is important to package the gas in bottles or provide refueling infrastructure so that it’s handling and distribution is easy. To bottle the enriched gas, it has to be compressed first before being filled in high pressure steel cylinders (available in the market for CNG storage). For example, to make enriched and compressed biogas (CBG) suitable for automobile application, the enriched biogas is compressed to about 20.0 MPa after moisture removal and filled in special high pressure steel cylinders. To be used for motor transport, biogas has to be enriched to at least 95% methane and then it can be used in vehicles originally modified to run on natural gas.<\/p>\n<p>A study done in India on a 3 cylinder 4 stroke 800 cc vehicle, showed it’s possible for a motor vehicle to run on biogas. The car in question had an average fuel consumption of about 9km\/kg biogas and covered 60 km on approximately 1 hour. In Britain, the Volvo S80 Bi-Fuel has a five cylinder; 2.4-litre bi-fuel engine powered by biogas or compressed natural gas (CNG) with petrol acting as a back-up. The car engine uses two separate fuel systems, and automatically switches to the back-up petrol system should the primary biogas\/CNG supply run out. A tank of biogas or CNG gives a range of 250-300 km (Nyeri-Nairobi round trip) and the reserve petrol tank provides an additional range of about 350 km.<\/p>\n<p>For biogas to become a viable fuel to power motor vehicles and machinery, Kenya will need to invest in a national network of compressed biogas (CBG) and liquefied biogas (LBG) refueling stations akin to petrol\/diesel distributers we currently have. But unlike our ‘normal’ refueling stations, biogas refueling stations will require a different set of fueling considerations. Special insulated storage tanks will be required to store the fuel on site and fueling on fast fill basis will still take slightly longer than normal liquid fuel vehicles.<\/p>\n<div class=\"energ-after-content\" id=\"energ-2914003216\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Biogas is an established, renewable, clean and particulate-free source of energy that is an alternative to many fuels and especially biomass based fuels such as firewood and charcoal. At household level, the gas is predominantly used to provide clean fuel for cooking and lighting. The gas can also be used to replace fossil fuels such [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":726,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,204],"tags":[26,53,54,55,42],"class_list":["post-532","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-how-to","tag-alternative-energy","tag-biogas","tag-biogas-car","tag-enriching-biogas","tag-green-energy"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/532","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=532"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/532\/revisions"}],"predecessor-version":[{"id":1246,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/532\/revisions\/1246"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/726"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=532"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=532"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=532"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}