{"id":533,"date":"2019-05-14T14:02:21","date_gmt":"2019-05-14T14:02:21","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=98"},"modified":"2020-01-13T12:11:03","modified_gmt":"2020-01-13T12:11:03","slug":"intelligent-energy-management-for-homes","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/intelligent-energy-management-for-homes\/","title":{"rendered":"Intelligent Energy Management for homes"},"content":{"rendered":"\n<p>Energy as we know it is the ability to work and is available in many different forms. It is an influential and most discussed topic of our times since it affects our daily activities.<\/p>\n\n\n\n<p>Electricity is one of the many energy forms and since its discovery more than 130 years ago; it has influenced the course of technological development in many areas that make our lives easier, more enriching and fulfilling.<\/p>\n\n\n\n<p>Due to electricity, we are able to keep our food fresh for extended period. And via live television transmission we are able to keep abreast with what is happening half way round the world.<\/p>\n\n\n\n<p>But in our daily consumption of this important energy form, we leave in our wake a lot of energy wastage. Which impacts negatively on the economy and our pockets.<\/p>\n\n\n\n<p>Utility companies such as KenGen are forced to generate more power so as to meet the shortfall caused by the wastage. Many are the times we have all the lighting points in the house on in the middle of a bright sunny day or the iron box on when we are done with ironing.<\/p>\n\n\n\n<p>In some cases we have oversized household appliances such as refrigerators that are anything but efficient in their running costs. Refrigerators and freezers consume about a sixth of all electricity in a typical home. These two appliances use more electricity than any other single household appliance at home.<\/p>\n\n\n\n<p>Fortunately, refrigerators have gotten much more efficient in their energy use over the past 20 years. Today&#8217;s refrigerators use 60% less electricity on average than 20-year-old models. Engineers are working on improving the efficiency even further so as to bring down the running costs. Maintaining an old inefficient refrigerator at home may cost you as much as Ksh 20,000 a year in electricity bills alone. Above what an efficient modern refrigerator would cost.<\/p>\n\n\n\n<p>Simple habits like switching off lights when not needed or that television set when we are not viewing it.  Our major problem as far as energy use is concerned is that we don’t look beyond the catchy price tag on that appliance.<\/p>\n\n\n\n<p>We forget that every appliance has two price tags. One tag is the purchase price on the equipment when you purchase it from the outlet.  Another more critical price is the operating cost paid out month after month in the form of electricity bills.<\/p>\n\n\n\n<p>We usually don’t look at the power consumption rating of the appliance we are buying. What most people don’t consider is that, 20 years down the line, the refrigerator or the television they purchased will still be working but they may find that they are spending much more money operating the appliance than they did buying it in the first place!<\/p>\n\n\n\n<p>But energy saving besides being influenced by decisions we make when purchasing electrical appliances, has gone high tech through “smart metering” and intelligent energy management systems at home. Smart meters are intelligent devices that are used to measure electricity consumption.<\/p>\n\n\n\n<p>In order to save energy, consumers need to be able to obtain up-to-date information at any time about the energy consumption of their appliances.  They should also be able to control them even when away from home.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Smart meters<\/h4>\n\n\n\n<p>Smart meters make it possible for home owner to keep track (read) and control power consumption even remotely. The system can be controlled via personal computer or mobile phone. The household owner simply enters his\/her preferences for different appliances and equipment such as lighting fixtures, cookers, refrigerators, microwaves, laundry machines and setting a limit on their maximum energy consumption.<\/p>\n\n\n\n<p>The software uses this information. It assesses when and which devices in the household are to be switched on and off and at what time. The smart meter runs on the back of an intelligent energy management system that can also central lock all the household doors and windows.<\/p>\n\n\n\n<p>Our current flat rate household power consumption pricing does not encourage smart metering. Although the fact that power is expensive, is a good enough incentive to save on energy.<\/p>\n\n\n\n<p>Use of smart metering and intelligent energy management systems are rapidly making inroads in Kenya. Already some aspects of the two are in application in manufacturing, hospitality, and housing facilities across the country.<\/p>\n<div class=\"energ-after-content\" id=\"energ-2927859268\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Energy as we know it is the ability to work and is available in many different forms. It is an influential and most discussed topic of our times since it affects our daily activities. Electricity is one of the many energy forms and since its discovery more than 130 years ago; it has influenced the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":724,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[56,57,58,59,60],"class_list":["post-533","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","tag-certified-energy-managers-in-kenya","tag-energy-auditors-in-kenya","tag-energy-management","tag-energy-management-in-kenya","tag-energy-monitoring-in-kenya"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/533","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=533"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/533\/revisions"}],"predecessor-version":[{"id":1518,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/533\/revisions\/1518"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/724"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=533"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=533"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=533"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}