{"id":536,"date":"2019-05-11T04:37:53","date_gmt":"2019-05-11T04:37:53","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=209"},"modified":"2020-01-13T12:12:48","modified_gmt":"2020-01-13T12:12:48","slug":"understanding-bioenergy-potential","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/understanding-bioenergy-potential\/","title":{"rendered":"UNDERSTANDING BIOENERGY POTENTIAL"},"content":{"rendered":"\n<p><strong><em>By Albert Odiyo<\/em><\/strong><\/p>\n\n\n<p>If you spent majority of your formative stages of life at the rural village like me then you must appreciate the value of bioenergy in meeting daily energy demands there like I do.<\/p>\n<p>This was, and still remains to a large extent, the primary source of fuel for domestic heating. When evening hours approached, I could see my sisters preparing to fetch firewood, as it is popularly known, from the nearby bushes. This would serve as fuel for the preparation of the evening meal and even the morning breakfast the following day.<\/p>\n<p>In the present day society, bioenergy has evolved and serves as a very important renewable energy source in Africa and around the world.  A recent study reviewing bioenergy  potential forecast reveals a  bandwidth of contribution to global primary energy from approximately 0-200 EJ in the timeframe of 2020-2030(UKERC 2011), while the latest assessment indicates 105-150 EJ by 2030(IRENA,2014).<\/p>\n\n\n<h4 class=\"wp-block-heading\"> <strong><em>Forms of bioenergy<\/em><\/strong> <\/h4>\n\n\n\n<p>Although technology has evolved around the conversion of biomass in to heat, certain fundamental factor still remains. &nbsp;For example, the development of this traditional fuel still follows the basic principles such as high conversion efficiency, competitiveness and sustainability.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2015\/06\/Biomass-from-Julifora.png\"><img decoding=\"async\" data-src=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2015\/06\/Biomass-from-Julifora-300x247.png\" alt=\"Biomass from Julifora\" class=\"wp-image-210 lazyload\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 300px; --smush-placeholder-aspect-ratio: 300\/247;\" \/><\/a><\/figure>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong>Biomass from Prosopis Juliflora tree<\/strong> <\/h4>\n\n\n\n<p>There are two forms of bioenergy in use today: traditional and modern. Traditional use of biomass includes fuelwood, animal waste and charcoal. Modern biomass technologies include liquid biofuel produced from straw and wood, industrial cogeneration and biorefineries, biogas produced from anaerobic digestion of residues, pellet heating systems and other technologies.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong><em>Bioenergy potential and use<\/em><\/strong> <\/h4>\n\n\n\n<p>Bioenergy, just like other renewable energy sources, plays an essential role in improving access to modern energy services, mitigating economic risk by ensuring energy security by contributing to reducing the risk of climate change by lowering emissions. <\/p>\n\n\n\n<p>The world used approximately 51 Exajoules (EJ) of primary biomass in 2012, including 105 billion litres (2.5 EJ) of liquid biofuels (TFEC 2010). This equals 10% of global primary energy supply (IRENA 2014).However; it is projected that under current policies, bioenergy use will grow to 79 EJ by 2030, and biofuels to 287 billion litres. For the world to reach its international objective, the use of bioenergy needs to rise to 108 EJ in 2030, including biofuels growth to 650 billion litres. <\/p>\n\n\n\n<p>All forms of renewable energy combined accounted for 9% of global energy consumption in 2010. This means that three quarters of the world current renewable energy use comes from bioenergy.<\/p>\n\n\n\n<p>Bioenergy is widely believed to have the largest employment potential of any Renewable Energy Technology, as it is considerably more labor intensive than the other technologies. <\/p>\n\n\n\n<p>Cultivation and harvesting biomass feedstock requires large numbers of people, whereas processing the feedstock into fuels generates considerably fewer jobs. (Urbanchuk, 2012) estimates that the bioenergy industry employed some 1.4 million people directly and indirectly in 2010.<\/p>\n\n\n\n<p>More so than for other Renewable Energy Technologies, bioenergy employment reflects widely diverging skill and pay levels. This is because agricultural operations play a large role in the sector, and much of this employment is generally low skilled and also fluctuates seasonally.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong><em>Bioenergy Vis a Vis other RET<\/em><\/strong> <\/h4>\n\n\n\n<p>Biomass differs from other types of renewable energy in several ways. It needs a large amount of feedstock, which requires land and water. It is essential to grow biomass in a sustainable way which does not clash with other needs, such as food. Bioenergy is also the only source of renewable carbon which can serve as feed-stock for plastics and other synthetic organic materials and it can be stored with limited effort and low cost.<\/p>\n\n\n\n<p>It is estimated that the average price of primary biomass will be USD 8.3 per gigajoule (GJ), less than half of today’s crude oil price but three times current coal prices. Today’s biomass markets are fragmented, and prices range from near zero or even negative for post-consumer waste, to more than USD 20 per GJ for pellets for residential use.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong><em>Energy content of Biomass Materials<\/em><\/strong> <\/h4>\n\n\n\n<p>The heat energy available in combustion, equivalent in practice to the enthalpy or the net energy density, ranges from about 8 MJ\/kg (un-dried ‘green’ wood) and 15 MJ\/kg (dry wood), to about 40 MJ\/kg (fats and oils) and 56 MJ\/kg (methane).<\/p>\n\n\n\n<p>Biomass is, however, mostly carbohydrate material with a heat of combustion of about 20 MJ\/kg. Biomass yield is approximately 10 t \/ ha \/ year which is equivalent to approximately 5 kW\/ha.&nbsp; Solar energy to biomass energy conversion efficiency is about 0.5%.<\/p>\n\n\n\n<p>When used for cooking most of the biomass energy is wasted, as open fires are very inefficient with only ~5% of the available heat being used.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong><em>Carbon Neutrality<\/em><\/strong> <\/h4>\n\n\n\n<p>The attraction of biomass as a source of energy is that it is carbon-neutral, as the amount of carbon dioxide released in its combustion has been previously removed from the atmosphere when carbon dioxide was converted by photosynthesis into making the plant material. We therefore have a sustainable source with zero net production of carbon dioxide, provided we renew the biomass consumed.<\/p>\n\n\n\n<p>It is important to take cognizant of the fact that overreliance on biomass fuel has some consequences. One of the effects of this is deforestation that significantly changes rainfall patterns leading to climate change. Secondly, there is the problem of soil erosion which is primarily caused by deforestation. <\/p>\n\n\n\n<p>The issue of food crops being replaced by fuel crops is another concern. Therefore care must be taken to strike a balance between meeting todays energy demand vis a vis caring for the environment and safeguarding food security.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong><em>Conclusion<\/em><\/strong> <\/h4>\n\n\n\n<p> Finally, it is important to take cognizant of the fact that overreliance on biomass fuel has some consequences. One of the effects of this is deforestation that significantly changes rainfall patterns leading to climate change. Secondly, there is the problem of soil erosion which is primarily caused by deforestation. <\/p>\n\n\n\n<p>Finally, the issue of food crops being replaced by fuel crops is another concern. Therefore care must be taken to strike a balance between meeting todays energy demand vis a vis caring for the environment and safeguarding food security. <\/p>\n<div class=\"energ-after-content\" id=\"energ-227019171\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Albert Odiyo If you spent majority of your formative stages of life at the rural village like me then you must appreciate the value of bioenergy in meeting daily energy demands there like I do. This was, and still remains to a large extent, the primary source of fuel for domestic heating. When evening [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":670,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-536","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/536","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=536"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/536\/revisions"}],"predecessor-version":[{"id":1304,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/536\/revisions\/1304"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/670"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=536"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=536"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=536"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}