{"id":537,"date":"2019-05-20T09:33:28","date_gmt":"2019-05-20T09:33:28","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=220"},"modified":"2020-01-13T12:06:43","modified_gmt":"2020-01-13T12:06:43","slug":"solar-energy-and-homes","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/solar-energy-and-homes\/","title":{"rendered":"SOLAR ENERGY AND HOMES"},"content":{"rendered":"\n<p>By Ombajo G Vincent<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><a href=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2015\/08\/solar-two.jpg\"><img decoding=\"async\" data-src=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2015\/08\/solar-two.jpg\" alt=\"solar two\" class=\"wp-image-221 lazyload\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" \/><\/a><\/figure><\/div>\n\n\n\n<p>Energy consciousness, environmental sustainability, green energy…these seem to be the emerging buzzwords of the 21st century. Energy, its sources and usage are defining the ways of life and how businesses operate in more potent extents that have never even been imaginable before. <\/p>\n\n\n\n<p>Most importantly, the most amazing beauty about the energy world, especially with regards to green energy, is that it’s a free world where no one can be left behind, choice or necessity notwithstanding. Everyone can participate in sustaining our energy resources and consumption in every small ways. Nothing beats a revolution that can be built right from the environment of our homes.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><em><strong>Home Solar Energy Systems<\/strong><\/em><\/h4>\n\n\n\n<p><br>Home solar energy systems are the easiest and surest ways through which all of us can leave a positive score in the expansion of the green energy realm. And this brings us home to talk about powering, not just of our houses, but also of our lives. <\/p>\n\n\n\n<p>Ultimately, when we think solar…we think education for our children, improved family lives in terms of reduction of costs, and the happiness of bringing the sun closer home from the sky through lights. We think sustainability. It’s like extending sunshine into the dark of the night and truly taking dominion of the sun as a natural resource.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Affordability<\/strong><\/h4>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignleft\"><a href=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2015\/08\/solar-three.jpg\"><img decoding=\"async\" data-src=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2015\/08\/solar-three.jpg\" alt=\"solar three\" class=\"wp-image-224 lazyload\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" \/><\/a><\/figure><\/div>\n\n\n\n<p><br>Solar energy is basically harnessing sunlight through the use of solar panels or modules and converting it to electricity to light and to power our homes. It is also used in solar thermal and water heating systems for homes. <\/p>\n\n\n\n<p>Over the years, the use of solar energy in our homes has not only grown, but also it has sustained its own growth. One of the most attractive things regarding solar power is its incredible affordability. <\/p>\n\n\n\n<p>In fact, solar panels are among the world’s top products that have seen tremendous reduction in prices. This has seen prices drop by up to 80% in just under a decade. Installation of home solar systems brings to homes, families and even communities, significant benefits that cannot be gainsaid. So why shouldn’t homes take to the usage of solar energy as soon as yesterday? What are these benefits enjoyed by few but missed by many, unknowingly?<\/p>\n\n\n\n<p>This has seen prices drop by up to 80% in just under a decade. Installation of home solar systems brings to homes, families and even communities, significant benefits that cannot be gainsaid. So why shouldn’t homes take to the usage of solar energy as soon as yesterday? What are these benefits enjoyed by few but missed by many, unknowingly?<\/p>\n\n\n\n<p><br>Solar energy is basically harnessing sunlight through the use of solar panels or modules and converting it to electricity to light and to power our homes. It is also used in solar thermal and water heating systems for homes. Over the years, the use of solar energy in our homes has not only grown, but also it has sustained its own growth. <\/p>\n\n\n\n<p>One of the most attractive things regarding solar power is its incredible affordability. In fact, solar panels are among the world’s top products that have seen tremendous reduction in prices. This has seen prices drop by up to 80% in just under a decade. <\/p>\n\n\n\n<p>Installation of home solar systems brings to homes, families and even communities, significant benefits that cannot be gainsaid. So why shouldn’t homes take to the usage of solar energy as soon as yesterday? What are these benefits enjoyed by few but missed by many, unknowingly?<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Simple Solar PV connection<\/strong><\/h4>\n\n\n\n<p>There are several home based uses of solar energy. In a home setting, one would need a solar panel, a charge controller, an inverter and a battery. This is a typical solar photo-voltaic (PV) connection. The panel will capture the sun’s rays and convert it to electricity. <\/p>\n\n\n\n<p>This electricity, which is normally in the form of DC signal, will be directed to a charge controller then to a battery. The charge controller helps regulate the electricity from the solar panels from overcharging the batteries. These batteries are used to store power for usage at night when there is no sunlight. <\/p>\n\n\n\n<p>From the battery, the electricity passes through an inverter then into the appliances like radios, TV’s in the home, light bulbs, mobile chargers etc. The inverter is used to convert the initial DC (direct current) signal to AC (alternating current) signal for use because most appliances are designed to only take in AC signals.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignright\"><a href=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2015\/08\/solar-five.jpg\"><img decoding=\"async\" data-src=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2015\/08\/solar-five.jpg\" alt=\"solar five\" class=\"wp-image-223 lazyload\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" \/><\/a><\/figure><\/div>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Environmental Conservation<\/strong><\/h4>\n\n\n\n<p>Going green is just as fascinating a concept as it sounds. Adoption of solar energy in our homes not only lets us be green in our energy usage, but it also just breathes life into other essential aspects of our lives. Conserving the environment is a goal for most folks and solar energy is just the simplest tactic at realizing this goal. <\/p>\n\n\n\n<p>When families embrace solar, they contribute to the reduction of green house gases and minimize their carbon footprint. Who doesn’t want to be part of such A noble initiative? And therefore, homes become the first avenue of reducing greenhouse emissions. Imagine every home being the basic driver of this priceless intention. <\/p>\n\n\n\n<p>If every home does just that, aren’t we then taking care of this earth that we have borrowed from our children and children’s children. When you install solar, you sort of try to give your bit back to nature and look after the planet. And it is wonderful for our children to be aware of this as well.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Understanding Greenhouse Effect and Carbon Footprint<\/strong><\/h4>\n\n\n\n<p>Let’s shine light on the elements of greenhouse gases and carbon footprint. The earth we live in already has enough natural green house gases in the form of water vapor, carbon dioxide and methane. <\/p>\n\n\n\n<p>The earth produces a lot of heat that needs to escape into the space through the atmosphere so that we can have habitable comfort. But when we burn a lot of fossil fuels like oil and coal, we produce a lot of carbon dioxide that increases the amount of greenhouse gases. <\/p>\n\n\n\n<p>This in turn prevents the heat from the earth from escaping thus making the earth warmer than it should be…global warming. It leads to greenhouse effect and it basically works the way normal greenhouses function to keep farms warm.<\/p>\n\n\n\n<p>Carbon footprint is the total amount of greenhouse gases unleashed directly in support of human activities like lighting, cooking etc. When we use solar energy, we produce less greenhouse gases because we burn less fossil fuels and thus reducing our greenhouse gas emission intensities. <\/p>\n\n\n\n<p>So how exactly does grid electricity from utilities contribute to greenhouse effect? A lot of fossil fuel is used in electricity generation including the diesel that runs the generators in power plants. No wonder in the electricity bills, fuel is charged and is paid for heavily by clients or users.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Reduction of Electricity Bills or Costs<\/strong><\/h4>\n\n\n\n<p>Bills, costs and money…these words aren’t friendly at all. But what if we had a way of just making these terms friendly? Honestly, using solar energy to light and power our homes becomes the answer. Families and homes that use solar energy have a significant reduction of their bills. <\/p>\n\n\n\n<p>Solar saves energy costs for homes or rather the sun just becomes a savior of our finances. So using solar doesn’t just light our world, it lights other essential spheres of our functions…cash savings. When children are taught the reason behind going solar, and the reason given is to save costs, then that’s a lifetime money sense lesson for them. <\/p>\n\n\n\n<p>Using solar just has a way of making people self-reliant and initiative-driven. And who knows, it could just be the sustainable spark families need to explore the savings culture in their other obligations.<br><\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Aesthetics<\/strong><\/h4>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignleft\"><a href=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2015\/08\/solar-homes.jpg\"><img decoding=\"async\" data-src=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2015\/08\/solar-homes.jpg\" alt=\"solar homes\" class=\"wp-image-222 lazyload\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" \/><\/a><\/figure><\/div>\n\n\n\n<p>Now there is no doubt that the solar panels are just breath taking, beautiful and elegant in appearance. <\/p>\n\n\n\n<p>Aesthetics are essential in life. If it beautifies the look of homes and houses, it certainly decorates our inner souls. It brightens our world. They are easy to maintain, even children can clean them. <\/p>\n\n\n\n<p>Therefore, it is an important step to go solar because the benefits are convincingly superior even in terms of improving the essence of our lives. This is one of the most appealing investments people should consider in this century. And so many people have. Have you?<\/p>\n<div class=\"energ-after-content\" id=\"energ-4056157504\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Ombajo G Vincent Energy consciousness, environmental sustainability, green energy…these seem to be the emerging buzzwords of the 21st century. Energy, its sources and usage are defining the ways of life and how businesses operate in more potent extents that have never even been imaginable before. Most importantly, the most amazing beauty about the energy [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":663,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[73,74],"class_list":["post-537","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","tag-greenhouse-emissions","tag-solar-energy"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/537","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=537"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/537\/revisions"}],"predecessor-version":[{"id":1515,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/537\/revisions\/1515"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/663"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=537"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=537"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=537"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}