{"id":540,"date":"2019-04-07T12:59:59","date_gmt":"2019-04-07T12:59:59","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=337"},"modified":"2020-01-13T12:22:41","modified_gmt":"2020-01-13T12:22:41","slug":"how-to-get-the-best-out-of-energy-audits","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/how-to-get-the-best-out-of-energy-audits\/","title":{"rendered":"How to get the best out of energy audits"},"content":{"rendered":"\n<p>By Ombajo Vincent Gedion. <\/p>\n\n\n\n<p>For quite some time now, high energy consumers have been doing energy audits through licensed energy auditors. A considerable amount of money is spent on this important exercise by these energy consumers. But do these energy consumers get to achieve the key aims for conducting these audits? <\/p>\n\n\n\n<p>Let’s see, first, what is an energy audit? It is a survey, an assessment and analysis of energy flows and use in a system or process to reduce the amount of energy input into the system or process without negatively affecting the output. This is the simple definition of an energy audit and I will break it down further into the<strong> ‘what’<\/strong> and ‘<strong>why’<\/strong> of an <a href=\"http:\/\/http:\/\/www.teriin.org\/IEE\">energy audit<\/a>. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong>What<\/strong>?<\/h4>\n\n\n\n<p>This is the survey, the assessment and the analysis part of the audit where the auditor plays a leading role. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Why?<\/h4>\n\n\n\n<p>To reduce the amount of energy input into the system or process’. This is the objective of the audit. The facility owner plays a leading role here with the guidance of the auditor. Now this is where I want to dwell on, on how best to realize this objective. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Just to shed more light, let’s examine the details that an energy audit seeks to determine; <\/h4>\n\n\n\n<ul class=\"wp-block-list\"><li>Where and how energy is being lost.<a href=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2016\/04\/auditt2.jpg\"><\/a><\/li><li>Those systems\/equipment or machines that are operating inefficiently.<\/li><li>The types of cost-effective measures that can be put in place to make the facility more energy efficient.<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\">So how best do you get the value out of energy audit? <\/h4>\n\n\n\n<p>To answer this, it is worth noting that the result of an energy audit process is a technical report that has details on how energy is being used and lost. But the most essential part of this report are the recommendations done by the energy auditor. The recommendations are normally detailed <a href=\"http:\/\/http:\/\/www.teriin.org\/IEE\">energy saving<\/a> or conservation measures complete with financial analysis that can be implemented by a facility. <\/p>\n\n\n\n<p>So to get to the question of how best to benefit from, it’s a one word answer. IMPLEMENT. In order to answer the WHY question of an energy audit, facilities must implement the recommended measures. Take note, there is NO other way of getting optimal value from an audit other than IMPLEMENTATION of the saving measures. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\">What happens when you implement? <\/h4>\n\n\n\n<ol class=\"wp-block-list\"><li>Once you know where and how energy is lost in your facility, you will take action and seal that loophole. If you have unnecessarily high voltages, optimize the voltages. If there are neutral currents, eliminate them. This is implementation.<\/li><li>If there are inefficient equipment, replace them with high efficiency ones. For example, in the case of inefficient motors, put in place <a href=\"http:\/\/http:\/\/electrical-engineering-portal.com\/why-do-we-need-variable-speed-drives-vsd\">high efficiency motors<\/a>, VSD\/VFD controlled. In lighting, replace all the inefficient incandescent lamps and fluorescent tubes with <a href=\"http:\/\/http:\/\/www.retrofitandrelampwithleds.com\/\">LED’s lighting<\/a>. This, again, is implementation.<\/li><li>If there is need to invest in clean energy like solar PV, Solar thermal, and Biogas just to mention a few, then do the sizing and install these renewable energy systems. This is also implementation.<\/li><\/ol>\n\n\n\n<p>Most of these measures are usually cost effective, and with effective planning, the implementation process should start immediately after the audit. Nobody would want to continue losing energy and pay more when there is hard evidence that they can save more energy and pay less without investing much. For implementation measures that would need substantial investments, the recommendations are financially quantified and can attract external financing from banks. <\/p>\n\n\n\n<p>Therefore, in order to reduce energy consumption in a facility, it is important to implement the recommended energy saving measures. When the top management appreciates the essence of energy efficiency, then implementation is even made much easier. It is only with a visionary management that the goals of energy efficiency and going green can be realized. Now let implementation take center stage after energy audits are complete in order to harvest energy savings. <\/p>\n\n\n\n<p>The loans can then be repaid from the savings realized. In short, there is absolutely nothing that stops a company\/consumer from implementing energy saving measures, however costly, other than the company will to do so and the value they peg on energy consciousness. <\/p>\n<div class=\"energ-after-content\" id=\"energ-4111228774\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>By Ombajo Vincent Gedion. For quite some time now, high energy consumers have been doing energy audits through licensed energy auditors. A considerable amount of money is spent on this important exercise by these energy consumers. But do these energy consumers get to achieve the key aims for conducting these audits? Let’s see, first, what [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":635,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-540","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/540","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=540"}],"version-history":[{"count":4,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/540\/revisions"}],"predecessor-version":[{"id":1348,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/540\/revisions\/1348"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/635"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=540"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=540"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=540"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}