{"id":77,"date":"2018-05-26T11:34:00","date_gmt":"2018-05-26T11:34:00","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=77"},"modified":"2020-01-13T12:38:43","modified_gmt":"2020-01-13T12:38:43","slug":"going-green-in-kenya-electricity-from-sunlight","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-industry-news\/going-green-in-kenya-electricity-from-sunlight\/","title":{"rendered":"THIS IS HOW KENYA IS GOING GREEN"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">ELECTRICITY FROM SUNLIGHT<\/h2>\n\n\n\n<p><a href=\"http:\/\/en.wikipedia.org\/wiki\/Kenya\">Kenya<\/a> is classified as an energy poor country with the majority of the population spending a substantial amount of their household income on energy. With 46% of the population being classified as poor (living on less than US$ 2 per day), a majority of households especially in rural areas struggle to meet their energy expenses. <\/p>\n\n\n\n<p>Less than 25% of Kenya’s population has access to modern energy forms. The population’s access to grid electricity is 15% and only 4% of rural population has access. Due to low penetration of modern energy forms, a majority of households (68%) depends on traditional biomass for heating and cooking with kerosene and candles providing lighting.<\/p>\n\n\n\n<p>But Kenya is endowed with a natural resource that can meet the entire country power demand. With its geographic coordinates <a href=\"http:\/\/toolserver.org\/~geohack\/geohack.php?pagename=Geography_of_Kenya&amp;params=1_00_N_38_00_E_type:country\">1°00′N 38°00′E<\/a>, Kenya strides the equator. The country enjoys all year round sunshine with annual mean irradiation being between 4.4 and 6.3 kWh\/m². Riding on the back of low grid power access and high electricity costs, a thriving solar PV industry is transforming the lives of many Kenyans a module at a time.<\/p>\n\n\n\n<p>Solar electricity systems, also known as solar photovoltaic (PV), capture the sun&#8217;s energy using photovoltaic cells. These cells don&#8217;t need direct sunlight to work &#8211; they can still generate some amount of electricity on a cloudy day. The cells convert the sunlight into electricity, which can be used to run household appliances and lighting.<\/p>\n\n\n\n<p>PV cells are&nbsp;made from layers of semi-conducting material, usually silicon. When light shines on the cell it creates an electric field across the layers. The stronger the sunshine, the more electricity is produced.&nbsp; Groups of cells are mounted together in panels or modules that can be mounted on your roof.<\/p>\n\n\n\n<p>The power of a PV cell is measured in kilowatts peak (kWp). That&#8217;s the rate at which it generates energy at peak performance in full direct sunlight during the summer. PV cells come in a variety of shapes and sizes. Most PV systems are made up of panels that fit on top of an existing roof, but you can also fit solar tiles.<\/p>\n\n\n\n<p>Many of the PV modules being installed are mainly used to provide lighting, cell phones charging, refrigeration and entertainment. Today there are more than 200,000 PV modules installed in Kenya and about 30,000 PV modules being installed annually. A survey carried out in 2005 established that the annual market for PV modules was 500 kilowatt peak (kWp) and this was projected to grow at 15% annually.<\/p>\n\n\n\n<p>A government program that commenced same year to provide electricity to 3 000 schools and hospitals in remote areas increased tremendously the annual demand for the modules. This growth is attracting international companies to set up shop to manufacture PV panels in the Kenya. One such company is <a href=\"http:\/\/www.ubbink.co.ke\/\" target=\"_blank\" rel=\"noreferrer noopener\">Ubbink East Africa Ltd<\/a> that has set up a 30,000 PV panel manufacturing plant to cater for Kenyan and East African market.<\/p>\n\n\n\n<p>Even though for more than two decades of the industry growth the government didn’t offer much active support, its zero rating of duty payable on imported PV modules encouraged private entrepreneurs and other non state actors to step in and drive the growth. <\/p>\n\n\n\n<p>Today Kenya is considered as one of the best examples of where solar energy technology has taken off in sub-Saharan Africa. In the past 5 years, the government through its various agencies has come up with industry friendly policies that are meant to secure the gains achieved so far and also upscale the adoption of the technology by a wider section of the population.<\/p>\n<div class=\"energ-after-content\" id=\"energ-2115825734\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>ELECTRICITY FROM SUNLIGHT Kenya is classified as an energy poor country with the majority of the population spending a substantial amount of their household income on energy. With 46% of the population being classified as poor (living on less than US$ 2 per day), a majority of households especially in rural areas struggle to meet [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":730,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[24],"tags":[26,42,43,44],"class_list":["post-77","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-energy-industry-news","tag-alternative-energy","tag-green-energy","tag-green-in-kenya","tag-kenya-solar-energy"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/77","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=77"}],"version-history":[{"count":4,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/77\/revisions"}],"predecessor-version":[{"id":1456,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/77\/revisions\/1456"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/730"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=77"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=77"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=77"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}