{"id":772,"date":"2017-05-14T03:40:15","date_gmt":"2017-05-14T03:40:15","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=772"},"modified":"2020-01-13T12:44:49","modified_gmt":"2020-01-13T12:44:49","slug":"word-energy-day-student-challenge-winner","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/tools\/word-energy-day-student-challenge-winner\/","title":{"rendered":"Solar Cells &#038; Ceramic Materials"},"content":{"rendered":"\n<h4 class=\"wp-block-heading\">A Form of Sustainable Solution to the Prevailing Energy Needs?<\/h4>\n\n\n<p><em>After a highly spirited World Energy Day student competition, spearheaded by Eenovators Limited, a clear winner emerged from the participating lot. The judges liked the ingenious creativity of the concept submitted by <strong>Melvis Wachira<\/strong>, a student at Dedan Kimathi University of Technology. Read about her experience of taking part and winning the competition below:<\/em><\/p>\n<p>Participating in the World Energy Day Student Competition was an exhilarating experience where I was given exposure and a chance to air out my revolutionary if not innovative idea that I hope will provide an answer to the current energy needs.<\/p>\n<p>It goes without saying that issues like sustainability of energy, green impact and the overall economic constraints have proved to be a stumbling block as far as development of green energy in Africa is concerned.<\/p>\n<p>This gave me a great opportunity to engage with other likeminded young and ambitious innovators brainstorming probable solutions to the prevailing energy needs.<\/p>\n<p>Of solar cells and ceramic materials? One may ask- can the two form a sustainable solution to the prevailing energy needs? This was at the heart of my research, which was aimed at increasing the efficiency of solar cells.<\/p>\n<p>Through the conversion of larger amounts of sunlight as compared to the silicon convertors used in the existing solar panel designs. The harvested energy could be of use in data centers, homes and small scale farming applications. Thus, I found that this research is not only relevant but also feasible in the provision of energy solutions for Africa.<\/p>\n<p>The success of this project is not a personal accolade but a landmark initiative which should be embraced by the Kenyan youth to challenge their minds towards thoughts of creating innovative ideas for solving existing energy problems. If such a strategy is embraced, achieving the Kenya’s Vision 2030 will not be a matter of small talk but rather a dream en route to validity!<\/p>\n<p>I am humbled by this rare opportunity to participate in World Energy Day KE competition; and would also like to pass my most sincere gratitude to Eenovators Limited for engaging the youth in engineering in such productive works.<\/p>\n<p>It is a challenge for both students and players in the industrial sector to organize such opportunities for the enhancement of technology and engineering in the country. Not forgetting the award of an internship at Eenovators and a voucher for a getaway to Pinklakeman’s Eco lodge, Elementaita which I am super excited about.<\/p>\n<p><em>Eenovators would like to congratulate Melvis Wachira on a well deserved award and welcome her to our team. Eenovators aims to continue inspiring young people to innovate in the energy engineering sphere in a bid to create solutions for the world.<\/em><\/p><div class=\"energ-after-content\" id=\"energ-4264760876\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>A Form of Sustainable Solution to the Prevailing Energy Needs? After a highly spirited World Energy Day student competition, spearheaded by Eenovators Limited, a clear winner emerged from the participating lot. The judges liked the ingenious creativity of the concept submitted by Melvis Wachira, a student at Dedan Kimathi University of Technology. Read about her [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":844,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202,199],"tags":[],"class_list":["post-772","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","category-tools"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/772","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=772"}],"version-history":[{"count":5,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/772\/revisions"}],"predecessor-version":[{"id":1300,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/772\/revisions\/1300"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/844"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=772"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=772"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=772"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}