{"id":778,"date":"2019-01-04T06:29:43","date_gmt":"2019-01-04T06:29:43","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=778"},"modified":"2020-01-13T12:37:34","modified_gmt":"2020-01-13T12:37:34","slug":"tips-on-saving-and-conserving-energy-in-shopping-centers","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/tips-on-saving-and-conserving-energy-in-shopping-centers\/","title":{"rendered":"Saving and Conserving Energy in Shopping Centers"},"content":{"rendered":"\n<figure class=\"wp-block-image\"><img decoding=\"async\" width=\"239\" height=\"211\" data-src=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2017\/01\/energy-saving.png\" alt=\"\" class=\"wp-image-780 lazyload\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 239px; --smush-placeholder-aspect-ratio: 239\/211;\" \/><\/figure>\n\n\n\n<h4 class=\"wp-block-heading\"> <strong>Introduction<\/strong> <\/h4>\n\n\n\n<p>Shopping centers use energy in varied forms, depending on the types of services and goods offered by each outlet operating at the shopping facility. Energy use therefore forms an integral part of operational costs of running business in shopping centers. <\/p>\n\n\n\n<p>Significant efforts should be directed at reducing or eliminating the avoidable energy losses. Shopping malls and centers have different activities and outlets, like medical clinics, supermarkets, hotels, swimming pools, offices, hair salons and retail stores. <\/p>\n\n\n\n<p>Given the uniqueness of individual operations taking place in the centers, energy saving and conservation measures adopted in each situation tend to slightly differ. This article shares some of the tips can be adopted by facilities in shopping malls to save and conserve energy.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Computing Electrical Energy Usage<\/strong><\/h4>\n\n\n\n<p>The total electrical energy consumed is a product of power drawn from the utility supplier and the time the power was put to use. For example, if a water heater of 2.5 kilowatt is used for 15 cumulative hours in a month, then the total units of energy used will be:<\/p>\n\n\n\n<p>2.5 kilowatts × 15 hours = 37.5 kilowatt hours<\/p>\n\n\n\n<p>These units, in addition to other charges, depending on your tariff, determine the amount of money paid to the utility at the end of the month.<\/p>\n\n\n\n<p>This computation shows that there are two ways of reducing energy consumption; reduction in the power drawn by the appliance and reduction of the time of use. Regardless of the appliance being used, it is evidence that conservation and efficiency measures should focus on reducing the amount of power drawn from the grid or the time that the appliance is put to use.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Lighting<\/strong><\/h4>\n\n\n\n<p>Lighting in upcoming shopping centers can be designed to save energy. In case of an existing shopping center, modifications\/retrofitting can be carried out. The following are some of the back of the hand ways of reducing energy consumption in lighting:<\/p>\n\n\n\n<p>i.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;In case a building is using double capped fluorescent tubes, they should be replaced with LED tubes that produce the same light. An LED tube of 18 watts can produce light of lumens similar to that produced by a 36 watt fluorescent tube. The price of LED has dropped significantly and the payback for this investment can be around 13 months.<\/p>\n\n\n\n<p>ii.&nbsp;&nbsp;&nbsp;&nbsp;De-lamping can also be considered in cases where an area is over-lit. In some cases, rooms are lit beyond the recommended luminance levels. In this situation, it is better to get services of a professional to measure the luminance levels and compare with the recommended levels<a href=\"http:\/\/file\/\/\/C:\/Users\/fenwicks.musonye\/Documents\/Tips%20on%20Saving%20and%20Conserving%20Energy%20in%20Shopping%20Centers.docx#_ftn1\" target=\"_blank\" rel=\"noreferrer noopener\">[1]<\/a>. Removal of unnecessary lighting points will reduce the energy consumed on lighting.<\/p>\n\n\n\n<p>iii.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;During daytime, where possible, it is prudent to switch off lights and use the natural light from the sun. This can be enforced through culture creation among the occupants. Curtains should be pulled and let sunlight be used in the office during daytime.<\/p>\n\n\n\n<p>iv.&nbsp;&nbsp;&nbsp;&nbsp;Isolation of switch points is a good intervention to save energy. In offices that occupy large areas, it is vital to keep only occupied areas lit. In case only one switch is used, all the lights in the office will be on, yet only one side of the office will be occupied. Lights in different zones of the office should have different switching points. This ensures that unoccupied areas remain switched off.<\/p>\n\n\n\n<p>v.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Use of motion sensors in areas like clock rooms helps ensure that lights are off whenever a person leaves the area.<\/p>\n\n\n\n<p>vi.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Solar PV system can be used for lighting provisions. This is especially useful in security lighting and electric fencing. As well, parking roofing can be constructed using solar panels. A feasibility study should be carried out before solar PV system project is initiated.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Heating Applications<\/strong><\/h4>\n\n\n\n<p>In a shopping center, heating can be used to generate hot water for washing, bathing, to cook, to heat space etc. Selection of the heating appliance and the source of heat is instrumental in energy efficiency and conservation. Ovens, furnaces, frying machines, boilers, steam generators, iron, cookers, toasters, microwaves, electric kettles and room heaters are some of the appliances used for heating in various facilities in shopping centers. Some of the energy consumption reduction measures include:<\/p>\n\n\n\n<p>i.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Electric boiler should be replaced with solar water heating collector system. It is possible to use solar thermal energy to raise water levels to 80 degrees Celsius and maintain the temperature, in a well insulated tank, for more than 15 hours. If well implemented, such a replacement can save more than half the bills used to pay for electricity used to heat water in a boiler<\/p>\n\n\n\n<p>ii.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Microwaves should not be kept in idle mode. They consume about 10 % of the rated power. When not in use, they should be switched off<a href=\"http:\/\/file\/\/\/C:\/Users\/fenwicks.musonye\/Documents\/Tips%20on%20Saving%20and%20Conserving%20Energy%20in%20Shopping%20Centers.docx#_ftn2\" target=\"_blank\" rel=\"noreferrer noopener\">[2]<\/a>.<\/p>\n\n\n\n<p>iii.&nbsp;&nbsp;&nbsp;Ovens should be switched off when not in use. It is a common practice for some hotel staff to switch on the oven immediately they start working in the morning. It should only be switched on when its use in needed. An oven with many compartments should have switches on each compartment. This ensures that only the compartment being used for heating is switched on.<\/p>\n\n\n\n<p>iv.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Where necessary, consideration should be given to replacing electric appliances like oven with gas ovens. Use of LPG is cheaper than use of electric heating elements<\/p>\n\n\n\n<p>v.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Thermostats on heating elements should be in working conditions to ensure that power is switched off whenever set temperatures have been attained<\/p>\n\n\n\n<p>vi.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A shopping center can engage services of a consultant to assess if a heat pump can be used to heat water, in lieu of electric boilers, and reduce electricity bills<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Ventilation and Air Conditioning Systems&nbsp;&nbsp;&nbsp;<\/strong><\/h4>\n\n\n\n<p>Air conditioning involves cooling, heating, ingress and egress of air from a controlled space<a href=\"http:\/\/file\/\/\/C:\/Users\/fenwicks.musonye\/Documents\/Tips%20on%20Saving%20and%20Conserving%20Energy%20in%20Shopping%20Centers.docx#_ftn3\" target=\"_blank\" rel=\"noreferrer noopener\">[3]<\/a>. Electric fans, heaters, pumps and compressors are the major energy consuming equipment in these systems. Shopping centers can save a significant amount of energy if the ventilation and air conditioning systems are used efficiently. The following measures can be taken to conserve energy and use it efficiently:<\/p>\n\n\n\n<p>i.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Rooms that are air conditioned, for instance supermarkets, retail stores and cold stores, should have air curtains at their entrances. If an air conditioned room has no air curtain, heat flows from the outside into the cooled room, negating the work of the compressor. Air curtains will make short the time taken by the compressor to cool the room to the desired level (Recall we said we can either reduce time or power in order to alter the energy consumed).<\/p>\n\n\n\n<p>ii.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Cold stores and refrigerators should have controllers that stop the compressor once the desired temperature has been achieved. This reduces the kilowatt hours used per day.<\/p>\n\n\n\n<p>iii.&nbsp;&nbsp;&nbsp;&nbsp;In case a shop has many cold rooms or fridges, it is important that they be fully occupied. Partial use of the cooling spaces leads to economic disadvantages. In such a case, then the goods should be consolidated and kept in few cold stores, leaving the rest shut off. The products in the cold store should be evenly distributed to enable even air distribution.<\/p>\n\n\n\n<p>iv.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Knowledge of the temperature required for cooling is important. This ensures that temperature is not set far below the required level, which keeps the compressor working unnecessarily for long (Again, note that long working hours leads to more kilowatt hours).&nbsp;For example, if a cooler is storing meat products, it is important for the operator to know the recommended temperature. If the recommended temperature is 4 degrees Celsius, it will be uneconomical to keep the cooler at 2 degrees Celsius. It is common to find that most operators do not really know the recommended temperature for storing products.<\/p>\n\n\n\n<p>v.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Domestic fridges that have an internal fan in the evaporator are inefficient. They should be avoided!<\/p>\n\n\n\n<p>vi.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;If lighting system in the fridge uses the double capped fluorescent tubes, they should be changed to LEDs. These tubes may consume more than 30 % of the rated power of the fridge.<\/p>\n\n\n\n<p>vii.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Compressors should be placed near the cold rooms. Long distances between the compressor and the cold room lead to refrigerant pressure losses through the delivery pipes, affecting the output.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Water Pumping<\/strong><\/h4>\n\n\n\n<p>Water usage contributes to energy consumption in facilities. Even though water might be thought to be cheaply obtained, many people do not factor in the energy used to pump the same into overhead tanks. Energy can be saved in water pumping system in the following ways:<\/p>\n\n\n\n<p>i.&nbsp;&nbsp;&nbsp;To avoid water losses, it is advisable to use taps with infrared sensors. This way, incidences of taps left running will not arise.<\/p>\n\n\n\n<p>ii.&nbsp;&nbsp;&nbsp;&nbsp;Proper sizing of pumps should be considered when designing the pumping system. Here, it is essential to employ services of an expert. It is inefficient to use overly sized pump to pump water into the storage tanks.<\/p>\n\n\n\n<p>iii.&nbsp;&nbsp;&nbsp;&nbsp;Where a facility has high KVA demand charges, it would be prudent to pump water at night, when other loads have been switched off. This will reduce the demand charges on the electricity bill<\/p>\n\n\n\n<p>iv.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Fix leakages along the pipes and tighten the couplings in the pump<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Keeping of Records and Behavioral Interventions<\/strong><\/h4>\n\n\n\n<p>Energy consumption records should be kept and trended over weeks, months and years. This gives the management a feel of results of energy efficiency initiatives put in place. It is however worth noting that energy consumption trends have to be rationalized with production output. The ratio between the energy consumed and the production (be it occupancy, number of customers served, number of goods produced etc) is called energy intensity and it helps in monitoring of energy efficiency performance.<\/p>\n\n\n\n<p>As well, behavioral change should be emphasized upon. This should be done through staff sensitization, appointment of energy champions and energy management team and formulation of energy management policies. Employees and occupants should be reminded of the importance of conserving water, switching off lights when not in use, and switching off appliances like TV, radio and microwave after using them.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Notes<\/strong><\/h4>\n\n\n\n<p><a href=\"http:\/\/file\/\/\/C:\/Users\/fenwicks.musonye\/Documents\/Tips%20on%20Saving%20and%20Conserving%20Energy%20in%20Shopping%20Centers.docx#_ftnref1\" target=\"_blank\" rel=\"noreferrer noopener\">[1]<\/a> Guidelines on required luminance levels in different applications can be found at <a href=\"http:\/\/pilux-danpex.gr\/downloads\/Required_Light_LevelsEN.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">http:\/\/pilux-danpex.gr\/downloads\/Required_Light_LevelsEN.pdf<\/a>. A lux meter can be used to measure the lux levels. Some smart phones have applications that can measure lux levels in buildings.<\/p>\n\n\n\n<p><a href=\"http:\/\/file\/\/\/C:\/Users\/fenwicks.musonye\/Documents\/Tips%20on%20Saving%20and%20Conserving%20Energy%20in%20Shopping%20Centers.docx#_ftnref2\" target=\"_blank\" rel=\"noreferrer noopener\">[2]<\/a> This also applies to appliances like television sets, printers, surge protectors, DVD Players and computers. Idle mode contributes to phantom loads.<\/p>\n\n\n\n<p><a href=\"http:\/\/file\/\/\/C:\/Users\/fenwicks.musonye\/Documents\/Tips%20on%20Saving%20and%20Conserving%20Energy%20in%20Shopping%20Centers.docx#_ftnref3\" target=\"_blank\" rel=\"noreferrer noopener\">[3]<\/a> Detailed information about working of HVAC systems can be accessed via <a href=\"http:\/\/www.uky.edu\/bae\/sites\/www.uky.edu.bae\/files\/Chapter%207%20Heating%20Ventilation%20Air%20Conditioning.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">https:\/\/www.uky.edu\/bae\/sites\/www.uky.edu.bae\/files\/Chapter%207%20Heating%20Ventilation%20Air%20Conditioning.pdf<\/a><\/p>\n\n\n\n<pre class=\"wp-block-preformatted\">Fenwicks Musonye\nAssistant Officer, Energy Efficiency &amp; Conservation.<\/pre>\n<div class=\"energ-after-content\" id=\"energ-3012639387\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Introduction Shopping centers use energy in varied forms, depending on the types of services and goods offered by each outlet operating at the shopping facility. Energy use therefore forms an integral part of operational costs of running business in shopping centers.  Significant efforts should be directed at reducing or eliminating the avoidable energy losses. Shopping [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":832,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-778","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/778","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=778"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/778\/revisions"}],"predecessor-version":[{"id":1448,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/778\/revisions\/1448"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/832"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=778"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=778"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=778"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}