{"id":805,"date":"2019-01-12T05:44:36","date_gmt":"2019-01-12T05:44:36","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=805"},"modified":"2020-01-13T12:36:35","modified_gmt":"2020-01-13T12:36:35","slug":"led-making-the-light-choice","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/led-making-the-light-choice\/","title":{"rendered":"What I Wish People Knew About LED&#8217;s"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">LED: Making the Light Choice<\/h2>\n\n\n\n<p>The choice of the appropriate light bulb to use may seem like a foregone conclusion. The more traditional approach involves the selection of the bulb with the highest wattage for use. This is due to the assumption that more wattage equates to better lighting. <\/p>\n\n\n\n<p>However tremendous opportunity exists for both residential and commercial users to make cost savings without compromising on the quality of light delivered. <\/p>\n\n\n\n<p>The Association of Energy Engineers estimates that savings as high as 30 percent can be made just by changing the type of light bulb used.<\/p>\n\n\n\n<p>There are different types of light bulbs based on their mode of operation and on the specific application. This somewhat reflects man’s evolutionary journey in producing artificial light.  <\/p>\n\n\n\n<p>The incandescent lamp invented by Thomas Edison in the 1800s represents the most used light bulb in the world. These have high energy consumption and produce heat hence increasing the cooling load. <\/p>\n\n\n\n<p>Other lamp categories include low pressure discharge and high pressure discharge lamps. An example of the low pressure discharge type is the compact fluorescent bulbs which are energy efficient producing the same light output as the incandescent but at a lower wattage. The drawback of this type is that they generally take time to light up fully and are not dimmable.<\/p>\n\n\n\n<p>Various factors may present the need to change the type of light bulb used. The performance of the bulb in producing the required light is paramount. Thus, in selecting the right bulb ensure that it performs to the appropriate level. <\/p>\n\n\n\n<p>Wattage implies the amount of electric power the light bulb consumes and not the quality of light the bulb produces. A better measure for quality is the brightness expressed in lumens. Other factors include energy-saving characteristics and cost.<\/p>\n\n\n\n<p>An LED bulb emits light through flow of electrons from the negatively charged layer to a positively charged one in its semiconductor structure.  The major drawback that has prevented the wide application of the LED bulb in both commercial and residential use has been due to its brightness.<\/p>\n\n\n\n<p>This fundamental flaw in its functionality occurs due to trapping of emitted light in the structure of the LED. However, recent advancements in research and development of this technology has resulted in LEDs that produce the same amount of brightness at much lower wattage compared to other types of bulbs. <\/p>\n\n\n\n<p>Lower wattage implies lower energy consumption hence reduction in the costs. In addition, due to their innovative engineering design (<a href=\"http:\/\/www.fuseled.com\/category-s\/118.htm\">http:\/\/www.fuseled.com\/category-s\/118.htm<\/a>) , LED bulbs last longer before a replacement is required. This is particularly important in an industrial setting where management aims to optimize productivity by reducing lead time and improving the working environment.<\/p>\n\n\n\n<p>From the comparative analysis done, it is evident that LED bulbs are the right choice for your lighting solution of reducing energy consumption while at the same time maintaining functionality. This can be done either through retrofitting the existing lighting fixtures with LED bulbs or the use of the bulbs in your initial design.<\/p>\n\n\n\n<p>Led the way and make the light choice!!<\/p>\n\n\n\n<p>By: Jeff Mbugua<\/p>\n<div class=\"energ-after-content\" id=\"energ-1222071676\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>LED: Making the Light Choice The choice of the appropriate light bulb to use may seem like a foregone conclusion. The more traditional approach involves the selection of the bulb with the highest wattage for use. This is due to the assumption that more wattage equates to better lighting. However tremendous opportunity exists for both [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":828,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-805","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/805","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=805"}],"version-history":[{"count":2,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/805\/revisions"}],"predecessor-version":[{"id":1442,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/805\/revisions\/1442"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/828"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=805"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=805"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=805"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}