{"id":81,"date":"2018-09-04T08:35:45","date_gmt":"2018-09-04T08:35:45","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=81"},"modified":"2020-01-13T12:37:40","modified_gmt":"2020-01-13T12:37:40","slug":"is-your-tv-set-green","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/is-your-tv-set-green\/","title":{"rendered":"Is your TV set Green?"},"content":{"rendered":"\n<p>As a home appliance, the television set is an important equipment that entertains, inform and also educate us. Quantum leap in television technology over the past 80 years has meant that consumers are spoilt for choice of TV set to acquire with the only dictate being one’s taste and pocket. <\/p>\n\n\n\n<p>Cheap imports from China and other Asian countries has enabled many Kenyan households to own colour TV sets which a few years back was considered a luxury. It is estimated that Kenya has 4 million television sets with the number increasing daily.<\/p>\n\n\n\n<p>But as we enjoy the good services of that TV set in the living room many of us don’t check on the power rating of that TV set and its contribution to global warming and climate change as a direct result of its power consumption?<\/p>\n\n\n\n<p>Television sets are a significant contributor to greenhouse gas emissions from Kenyan households due to their high power consumption. The increase in power consumption is driven by adoption of larger <a rel=\"noreferrer noopener\" href=\"http:\/\/www.amazon.com\/gp\/product\/B0078LSTWU?ie=UTF8&amp;camp=1789&amp;creativeASIN=B0078LSTWU&amp;linkCode=xm2&amp;tag=kenyaan-20\" target=\"_blank\">Plasma and LCD screens<\/a>. With rising incomes levels, more Kenyan households are able to afford bigger TV sets ranging from 42 inch and above that consume more power than the smaller 14 and 21 inch TV sets that we were accustomed too.<\/p>\n\n\n\n<p>Even though there is no major study that has been carried out in Kenya on green house gasses emissions from televisions, a recent study in Australia revealed that televisions are a significant contributor to greenhouse gas emissions from Australian households. Recommendations from the study called for mandatory energy reporting on power consumption of televisions in the households with suggestions that poorer performing televisions in the market be phased out from the market.<\/p>\n\n\n\n<p>The increase in power consumption of televisions in our households is driven by many factors. These include the rapid adoption of <a href=\"http:\/\/www.amazon.com\/gp\/product\/B00BCGRX9M?ie=UTF8&amp;camp=1789&amp;creativeASIN=B00BCGRX9M&amp;linkCode=xm2&amp;tag=kenyaan-20\">LCD <\/a>(liquid crystal display) and <a href=\"http:\/\/www.comparison.com.au\/digital_televisions?panel_type=Plasma\">plasma<\/a> screen technology that have virtually displaced the cathode ray tube (CRT) screen types. <\/p>\n\n\n\n<p>Wide spread use of remote controls has meant that many television sets are left on ‘stand by&#8217; mode. But a number of manufacturers notably <a rel=\"noreferrer noopener\" href=\"http:\/\/www.amazon.com\/gp\/product\/B00BCGRX9M?ie=UTF8&amp;camp=1789&amp;creativeASIN=B00BCGRX9M&amp;linkCode=xm2&amp;tag=kenyaan-20\" target=\"_blank\">Samsung<\/a> and <a href=\"http:\/\/www.comparison.com.au\/digital_televisions?manufacturer=Sony\">Sony<\/a> have made great strides over the last couple of years with both reducing the ‘stand by’ power consumption of their television sets to 1 watt or less down from 10-20 watts and above 20 years ago.<\/p>\n\n\n\n<p>Big, flat-screen HDTVs use more power than you might imagine. What buyers of television sets need to know is that for any particular TV set there is a large variation between high and low energy use units. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\">The energy used is determined by three factors: <\/h4>\n\n\n\n<p>Screen size; technology type, such as plasma or LCD; and picture brightness, which nearly always depends on user-selected picture settings. For example 32 inch LCD TV consume half the power of a 52 inch. <\/p>\n\n\n\n<p>In terms of technology, Plasma TVs use more power than LCD TVs. On average, Plasma TVs consume two to three times more power to produce an image of similar brightness as LCD. The problem with plasma TV is that each pixel is a discrete light source such that when the TV resolution increases, for example from 720p to 1080p, the power consumption increases correspondently.<\/p>\n\n\n\n<p>Many newer LCD-based TVs use LED backlights. LEDs are more efficient and can also use various dimming technologies that turn down either the entire backlight or independent sections. LED-backlit LCDs are the most efficient type of flat-panel TV available today. <\/p>\n\n\n\n<p>It&#8217;s worth noting that plasma TV has <a href=\"http:\/\/www.cnet.com\/lcd-tvs-plasma-tvs\/\">many picture quality advantages over LCD TVs<\/a>, so people who really prize video quality may be willing to sacrifice some efficiency to get those advantages. On the other hand, today&#8217;s high-quality LCDs can balance extreme efficiency with great picture quality. As with all technologies, improvements in HDTV performance are being made with every generation of products with power consumption continuing to fall with newer models that hit the stores.<\/p>\n\n\n\n<p>In terms of cost comparison, for a household that pays the average retail cost for electricity and watch TV for about 6 hours per day, the cost to watch a 50-inch 1080p plasma TV is about Ksh 5,000 per year. A similar sized LCD TV cost about Ksh 2,500 per year for the same light output.<\/p>\n\n\n\n<p>Ultimately, it’s worth noting that smaller TVs use less energy and cost less to run per year.<\/p>\n<div class=\"energ-after-content\" id=\"energ-2674469663\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>As a home appliance, the television set is an important equipment that entertains, inform and also educate us. Quantum leap in television technology over the past 80 years has meant that consumers are spoilt for choice of TV set to acquire with the only dictate being one’s taste and pocket. Cheap imports from China and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":668,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[45,46,47],"class_list":["post-81","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory","tag-energy-efficiency","tag-energy-saving-tv","tag-new-efficient-tv"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/81","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=81"}],"version-history":[{"count":5,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/81\/revisions"}],"predecessor-version":[{"id":1452,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/81\/revisions\/1452"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/668"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=81"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=81"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=81"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}