{"id":89,"date":"2019-05-09T14:23:32","date_gmt":"2019-05-09T14:23:32","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=89"},"modified":"2020-01-13T12:13:09","modified_gmt":"2020-01-13T12:13:09","slug":"kenyas-nuclear-ambition-understanding-the-nuclear-energy","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/energy-industry-news\/kenyas-nuclear-ambition-understanding-the-nuclear-energy\/","title":{"rendered":"Kenya&#8217;s Nuclear Ambition"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">Understanding the nuclear energy<\/h2>\n\n\n<p>In 2011, the <a href=\"http:\/\/www.energy.go.ke\/\" target=\"_blank\" rel=\"noopener noreferrer\">ministry of energy<\/a> (MoE) announced plans for Kenya getting working nuclear power plant(s) within the next 15 years to provide power to actualize the country vision of being a middle level economy by year 2030.<\/p>\n<p>Since the announcement was made and a working commission led by Hon. <a href=\"http:\/\/www.nuclear.co.ke\/index.php\/media-centre\/procurement\/itemlist\/tag\/Ochilo%20Ayacko\" target=\"_blank\" rel=\"noopener noreferrer\">Ochillo Ayacko<\/a> established to coordinate the process, a raging debate has been ignited pitting those for and against the idea.<\/p>\n<p>For those supporting the idea, their argument is that the country needs a secured and cheaper energy supply source to meet the expected increase in power demand as the economy expands rapidly.<\/p>\n<p>They also argue that, though comparatively expensive to set up and take long (12-15 years) to deliver its power to the consumers, the cost of nuclear generated power per kilowatt-hour is much less and stable as compared to other energy forms.<\/p>\n<p>Those opposed to Kenya’s nuclear ambitions such as <a href=\"http:\/\/www.unep.org\/about\/executivedirector\/\" target=\"_blank\" rel=\"noopener noreferrer\">Achim Steiner of UNEP<\/a>, have their misgivings on the cost, safety and security of nuclear technology. They do argue that putting up a nuclear power plant is an extremely expensive affair compared to other power generation technologies such as geothermal, wind and hydropower.<\/p>\n<p>For a country struggling to meet the most basic of its infrastructure needs, going nuclear is a manifestation of misplaced priorities.<\/p>\n<p>On the security front, those voicing concerns are worried about the country’s capacity to secure the proposed nuclear power plant(s) from such security threats like terrorists attack.<\/p>\n<p>On safety, there is concern that in the event of a calamity either natural or manmade, the extent of the resultant devastation will be greater than what Ukraine suffered from the Chernobyl nuclear disaster or Japan suffered from Fukushima Daiichi power plant whose reactors were crippled after the plant was flooded with sea water following a massive tsunami.<\/p>\n<p>There is also the issue of decommissioning costs of the plant(s) once they serve their economic lifetime. But in the midst of all this debate, what is nuclear energy and what are the facts about Kenya’s nuclear project?<\/p>\n<p><a href=\"http:\/\/www.amazon.com\/gp\/product\/0199759464?ie=UTF8&amp;camp=1789&amp;creativeASIN=0199759464&amp;linkCode=xm2&amp;tag=kenyaan-20\" target=\"_blank\" rel=\"noopener noreferrer\">Nuclear energy<\/a> originates from the splitting of uranium atoms in a process called fission. Once mined, the uranium ore is sent to a processing plant to be concentrated into enriched fuel (i.e., uranium oxide pellets).<\/p>\n<p>The enriched fuel is then transported to a nuclear power plant. In nuclear power plant’s reactor, the neutrons from uranium atoms collide with each other, releasing heat and neutrons in a chain reaction. This heat is used to generate steam, which powers a turbine to generate electricity.<\/p>\n<p>Every 18 to 24 months, nuclear power plants must shut down to remove and replace the &#8220;spent&#8221; uranium fuel rods. The spent fuel rods usually would have released most of its energy as a result of fission process therefore becoming radioactive waste.<\/p>\n<p>Currently, spent fuel rods are stored at the nuclear power plants at which they are generated.  The storage is done either in steel-lined, concrete vaults filled with water or in above-ground steel or steel-reinforced concrete containers with steel inner canisters.<\/p>\n<p>Enrichment of uranium ore into fuel and the operation of nuclear power plants generate low-level radioactive wastes. These wastes are usually shipped to specially designed and licensed disposal sites or for reprocessing.<\/p>\n<p>According to Nuclear Electricity Development Project (NEDP) Commission, the country can generate between 1000 MW and 4000 MW of nuclear power at a cost of Ksh 360 billion and Ksh 1.4 trillion.<\/p>\n<p>The approach is to have 4 <a href=\"http:\/\/www.amazon.com\/gp\/product\/0307385876?ie=UTF8&amp;camp=1789&amp;creativeASIN=0307385876&amp;linkCode=xm2&amp;tag=kenyaan-20\" target=\"_blank\" rel=\"noopener noreferrer\">nuclear power plants<\/a> of a 1000 MW units each. Since nuclear power plants consume huge amounts of water, potential sites for the power plants will be at the Coast, Lake Victoria or inland rivers such as Tana.<\/p>\n<p>Ultimately the site selected will significantly be affected by costs, public acceptance and safety considerations. The country nuclear program has three phases.<\/p>\n<p>Phase one will be a pre-feasibility study where the assessors will put in place the scientific criteria of identifying the site where the nuclear plant(s) will be located.<\/p>\n<p>Phase two will involve preparatory work to invite bids for the development of a nuclear power plant while phase three will be implementation phase that will result in the construction of the first nuclear power plant in Kenya.<\/p><div class=\"energ-after-content\" id=\"energ-2152797844\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Understanding the nuclear energy In 2011, the ministry of energy (MoE) announced plans for Kenya getting working nuclear power plant(s) within the next 15 years to provide power to actualize the country vision of being a middle level economy by year 2030. Since the announcement was made and a working commission led by Hon. Ochillo [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":728,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[24],"tags":[26,48,49,50,51,52],"class_list":["post-89","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-energy-industry-news","tag-alternative-energy","tag-energy-generation-in-kenya","tag-energy-opportunities-in-kenya","tag-ministry-of-energy-kenya","tag-nuclear-energy","tag-nuclear-energy-in-kenya"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/89","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=89"}],"version-history":[{"count":4,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/89\/revisions"}],"predecessor-version":[{"id":1310,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/89\/revisions\/1310"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/728"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=89"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=89"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=89"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}