{"id":930,"date":"2019-04-20T08:30:43","date_gmt":"2019-04-20T08:30:43","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=930"},"modified":"2020-01-13T12:20:55","modified_gmt":"2020-01-13T12:20:55","slug":"lights-and-leadership-lighting-up-tomorrows-leaders","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/lights-and-leadership-lighting-up-tomorrows-leaders\/","title":{"rendered":"The Ultimate Revelation Of Lights And Leadership"},"content":{"rendered":"\n<h3 class=\"wp-block-heading\">Lighting up Tomorrow’s Leaders<\/h3>\n\n\n<p>There has been a significant drive in the past five years to ensure electricity is available in all the public primary schools in the country, with the target number published by the Rural Electrification Authority (REA) as 22,000. This ambitious project has at its heart the need to have a digitized curriculum for children in that will require electricity for success.<\/p>\n<p>Whereas this is a noble venture and indeed powering up schools can only bring success, education towards a wholesome and holistic child with a strong foundation to become tomorrow’s leader is not only found in the classroom.<\/p>\n<p>Powering up schools without powering up homes in tandem may be an exercise in chasing tails, for it is not in school &#8211; where during school hours there is full daylight &#8211; that the powering up mission is as critical, but at home where in darkness children’s access to the rest of the world is cut off.<\/p>\n<p>The playing field that has supposedly been levelled out by provision of access to free primary education that forms the very baseline for future leadership, is indeed not level.<\/p>\n<p>Children in urban and peri-urban areas go home after school to well-lit households and continue with their lives under the power of light, whereas their counterparts in many rural areas, proceed home to struggle under the shadows of nightingale lamps and kerosene lanterns.<\/p>\n<p>The divide is very wide between a child struggling with homework in poor lighting and child proceeding to do theirs in the full glare of an electrified home.  Irrespective of the source of electricity, a well lit home work wonders for child development.<\/p>\n<p>The urban poor &#8211; that are often categorized in the same band as the rural sector when development goals are discussed &#8211; in this case are significantly advantaged for electrical connections exist in the urban slums. Whether these are legal or illegal connections remains a subject of the government’s constant bid to investigate and cease; what matters in this comparison is that lighting is not a challenge for the slum child.<\/p>\n<p>Energypedia – the consolidated online platform for collaborative knowledge exchange on renewable energy and energy efficiency topics in developing countries, indicates that households in Kenya use the following sources for lighting: electricity &#8211; about 15% of the national populace; electricity as the source of lighting in urban areas &#8211; 42%; kerosene lamps as the main source of lighting 55%; and kerosene for lighting in rural households &#8211; 87%. With these skewed figures in favour of the urban child, how then is the rural child expected to compete for opportunities?<\/p>\n<p>The national examination system that is used to grade and sift all children, and that has a very heavy focus on academia versus other competencies, does not take into account the energy availability in different geographies. All these children irrespective of their access to lighting for studies, will sit for the same exam and fight for spaces in institutions of secondary learning alike.<\/p>\n<p>Child psychologists world over extol the benefits of early reading and indicate that children who read at home enjoy a substantial advantage over children who don’t. Reading at home requires the presence of adequate lighting – the two are inseparable.<\/p>\n<p>The importance of reading to a child cannot be further underscored for reading: leads to the development of intellectual empathy in children; allows them to travel across the world and experience different cultures, geographies, technologies and adventures from the comfort of their homes; and expands their horizons allowing them to aspire and dream huge audacious dreams, through the associations they make from reading.<\/p>\n<p>How disadvantaged therefore is the child in a rural home without electricity, whether from the grid or from renewable sources, to allow them the pleasure of reading far more than the confined school syllabus available at school? Successful global leadership is linked to reading.<\/p>\n<p>Leaders are readers and readers are leaders irrespective of if they are reading fiction or factual information from books or from the internet. Access to reading needs adequate lighting and adequate lighting needs a good source of energy. As the great Principal of Friendship Technology Academy so rightly indicates &#8211; “Placing books in the hands of children to develop an interest in reading is critical. Placing targeted, high-interest books with STEAM (science, technology, engineering, the arts and mathematics) focus in the hands of children is brilliant” Energy in homes can deliver brilliance in children.<\/p>\n<p>That electricity is critical to the foundation of rooting out historical imbalances in this nation is not in debate. Lighting up every corner of the country is critical and should be high up in the nation’s agenda. Causes and projects to provide rural lighting should be seen in a bigger light than the current thrust to create comfort in homes.<\/p>\n<p>Lighting is a basic need towards providing sustainable education for our children and lighting is critical in our bid to raise the next generation. This continent is looking for great leaders to create transformation and to lead the world in making a difference for humanity.  A great start to this journey of a new world order begins by lighting up every single home.<\/p>\n<p><strong><span style=\"color: #ff0000;\">Lights and Leadership &#8211; shall every country take up this stand and rise to Light up Tomorrows Leaders?<\/span><\/strong><\/p>\n<p> <\/p>\n<p> <\/p>\n<p>Carolyne Gathuru<\/p>\n<p>Strategy and Branding &#8211; Eenovators Limited<\/p>\n<p> <\/p><div class=\"energ-after-content\" id=\"energ-861103698\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Lighting up Tomorrow’s Leaders There has been a significant drive in the past five years to ensure electricity is available in all the public primary schools in the country, with the target number published by the Rural Electrification Authority (REA) as 22,000. This ambitious project has at its heart the need to have a digitized [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":931,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-930","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/930","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=930"}],"version-history":[{"count":3,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/930\/revisions"}],"predecessor-version":[{"id":1339,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/930\/revisions\/1339"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/931"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=930"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=930"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=930"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}