{"id":949,"date":"2017-05-18T05:35:02","date_gmt":"2017-05-18T05:35:02","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=949"},"modified":"2020-01-13T12:44:00","modified_gmt":"2020-01-13T12:44:00","slug":"the-energy-measurement-and-verification-conversation","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/the-energy-measurement-and-verification-conversation\/","title":{"rendered":"THE ENERGY MEASUREMENT AND VERIFICATION CONVERSATION"},"content":{"rendered":"<p>The Energy Measurement and Verification Conversation<\/p>\n<p><strong><img decoding=\"async\" class=\"wp-image-950 aligncenter lazyload\" data-src=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2017\/05\/MV.jpg\" alt=\"\" width=\"829\" height=\"298\" data-srcset=\"https:\/\/energyzedworld.com\/wp-content\/uploads\/2017\/05\/MV.jpg 834w, https:\/\/energyzedworld.com\/wp-content\/uploads\/2017\/05\/MV-300x108.jpg 300w, https:\/\/energyzedworld.com\/wp-content\/uploads\/2017\/05\/MV-768x276.jpg 768w\" data-sizes=\"(max-width: 829px) 100vw, 829px\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 829px; --smush-placeholder-aspect-ratio: 829\/298;\" \/><\/strong><\/p>\n<p><a href=\"https:\/\/www.kam.co.ke\/kams-holds-13th-energy-management-awards\/\">The Energy Management Awards 2017<\/a> that saw a number of organizations recognized for their outstanding energy savings and cost reductions through improved utilization of energy , have also raised a concern about the need for measurement and verification. One of the parameters that the judges of the Energy Management Awards look out for is the ability to show that savings have been achieved through the measures any organization eligible for the awards has taken. The <a href=\"http:\/\/www.erc.go.ke\/index.php?option=com_content&amp;view=article&amp;id=88&amp;Itemid=486\">Energy Regulatory Commission<\/a> (ERC) requires organizations after conducting an energy audit to implement the energy conservation measures recommended by the energy auditors.<\/p>\n<p>Many organizations have gone ahead to implement the measures recommended but they fail to measure the impact of these interventions. For instance, after an audit, one of the energy conservation measures recommended by the energy auditor could be changing of the light bulbs from fluorescent to LED. The organization will raise the funds to implement this project, purchase and install the recommended LED lights. However, they will fail to measure how much energy was saved as a result of implementing this lighting project.<\/p>\n<p>Most organizations are not even aware of the need to measure and verify their energy projects. In their pursuit to comply with the energy regulations requiring entities with the energy use of more than 15,000kWh of energy per month or 180,000kWh annually to conduct audits, as well as the requirement to implement the projects recommended in the ECMs, they fail to see the impact on their savings and the benefits accrue from measurement and verification. Some organizations are not even aware that they need to submit an implementation report to ERC, one year after an energy audit has been conducted.<\/p>\n<p>It is therefore imperative to highlight the benefits of measurement and verification. Some of these benefits of measurement and verification include:<\/p>\n<ol>\n<li><strong>Helps organizations to evaluate the cost savings accruing from the energy conservation measures implemented<\/strong>. One common saying by Peter Drucker is that ‘What gets measured gets done’. It is common to hear of vague results in terms of cost reduction and savings they have gained as a result of implementing an energy project. Measurement and verification allows an organization to have concrete results of the projects implemented.<\/li>\n<li><strong>Gaining management support for energy management projects.<\/strong> The management is always looking for ways to reduce costs and maximize on profits. As a result, they will very likely support projects that show the cost savings being made. Measurement and verification allows the energy manager to provide proof of the savings made as a result of implementation of energy projects undertaken. Similarly, they are able to show the payback period in real terms and to show whether it is on course as was calculated before implementation of the project.<\/li>\n<li><strong>Allows organizations to access funding for more energy efficiency programs.<\/strong>There are funding organizations are looking to fund energy managements and renewable energy projects through grants, loans and equity. Such financiers are always looking to support projects that can be measured and verified. In a bid to show their donors that they are making an impact through their funding, it is imperative for funding bodies to have the organization funded show the facts and figures of the savings made.<\/li>\n<li><strong>Gives organizations opportunities for recognition for energy awards.<\/strong> The recent Energy Management Awards and the upcoming <a href=\"http:\/\/www.energycongress.com\/about\">World Energy Engineering Congress Awards<\/a> are opportunities for organizations to be recognized for the measures they are taking to conserve energy. The judges in these awards are always looking for proof of energy savings. Unless they are measured, it would be difficult for an organization to show just cause for the savings made.<\/li>\n<\/ol>\n<p>Without a doubt, measurement and verification is an important component of energy management projects. One of the greatest and simplest ways to measure and verify cost savings is by using real time energy monitoring. By monitoring energy real time, you are able to discover changes in energy usage resulting from implementation of energy projects. This collated data will give you an edge when it comes to seeking for funding and recognition for your organization. Eenovators has a great real time monitoring program called the <a href=\"http:\/\/eenovators.com\/index.php\/eeboard\/\">Eagles Program<\/a>. Talk to us about launching this program in your organization on <a href=\"mailto:info@eenovators.com\"><strong>info@eenovators.com<\/strong><\/a>.<\/p>\n<p>Linet Njeri<\/p>\n<p>Strategy and Branding, Eenovators Limited<\/p>\n<div class=\"energ-after-content\" id=\"energ-3503425186\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>The Energy Measurement and Verification Conversation The Energy Management Awards 2017 that saw a number of organizations recognized for their outstanding energy savings and cost reductions through improved utilization of energy , have also raised a concern about the need for measurement and verification. One of the parameters that the judges of the Energy Management [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":950,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-949","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/949","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=949"}],"version-history":[{"count":1,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/949\/revisions"}],"predecessor-version":[{"id":951,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/949\/revisions\/951"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/950"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=949"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=949"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=949"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}