{"id":956,"date":"2019-05-15T06:28:25","date_gmt":"2019-05-15T06:28:25","guid":{"rendered":"http:\/\/energyzedworld.com\/?p=956"},"modified":"2020-01-14T11:51:51","modified_gmt":"2020-01-14T11:51:51","slug":"simple-factors-affecting-solar-performance-worth-knowing","status":"publish","type":"post","link":"https:\/\/energyzedworld.com\/advisory\/simple-factors-affecting-solar-performance-worth-knowing\/","title":{"rendered":"Simple Factors Affecting Solar Performance worth Knowing"},"content":{"rendered":"\n<figure class=\"wp-block-image\"><img decoding=\"async\" width=\"2020\" height=\"1526\" data-src=\"http:\/\/energyzedworld.com\/wp-content\/uploads\/2017\/06\/solar.jpg\" alt=\"\" class=\"wp-image-1000 lazyload\" data-srcset=\"https:\/\/energyzedworld.com\/wp-content\/uploads\/2017\/06\/solar.jpg 2020w, https:\/\/energyzedworld.com\/wp-content\/uploads\/2017\/06\/solar-300x227.jpg 300w, https:\/\/energyzedworld.com\/wp-content\/uploads\/2017\/06\/solar-768x580.jpg 768w, https:\/\/energyzedworld.com\/wp-content\/uploads\/2017\/06\/solar-1024x774.jpg 1024w\" data-sizes=\"(max-width: 2020px) 100vw, 2020px\" src=\"data:image\/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\" style=\"--smush-placeholder-width: 2020px; --smush-placeholder-aspect-ratio: 2020\/1526;\" \/><\/figure>\n\n\n\n<p><strong>Simple Factors Affecting Solar Performance worth Knowing<\/strong> <\/p>\n\n\n<p>Over the past five years, solar energy use has grown in East Africa and especially Kenya. Boosted by a government regulation on solar energy and high cost of power, many Kenyans and commercial entities have taken solar energy use into much consideration.<\/p>\n<p>Several examples abound, from homes to schools, hotels to farms, factories to malls. The key benefit always being the energy savings that come with solar installations.<\/p>\n<p>Reduction in utility bills and going green drive the solar market and the savings are real. When installed in a commercial facility, Solar energy replaces much of the electricity supply from the grid.<\/p>\n<p>However, worth noting are the external factors that can influence the energy production capacity of the solar installations.  Some of these factors can be controlled, while some can’t.<\/p>\n<p>It is important to be aware of these factors;This is a very key factor and it’s not a common word to be uttered by many. You will never hear a friend telling you,” The irradiance out here today is high.” It is just not a normal talk for us.<\/p>\n<p>Irradiance is basically a measure of the amount of sunlight a particular area\/surface receives. Simply put, the higher the irradiance on a solar panel, the more the solar energy produced by that panel.<\/p>\n<p>And herein lies the catch, the world is designed in such a way that this irradiance varies from place to place and time to time. The fact is that irradiance varies throughout the day.<\/p>\n<p>The sun’s angle and position, moving clouds, bad weather, and air pollution all affect irradiance levels. Nonetheless, from year to year, the total amount of energy received from the sun remains relatively the same.<\/p>\n<p>In fact, in a particular year, irradiance causes a variation of between 5-10% of the suns energy captured by the solar cells. So in designing solar systems, irradiance data, mostly from weather databases are used.<\/p>\n\n\n<h4 class=\"wp-block-heading\">1. Irradiance<\/h4>\n\n\n\n<p> This is a very key factor and it’s not a common word to be uttered by many. You will never hear a friend telling you,” The irradiance out here today is high.” It is just not a normal talk for us. Irradiance is basically a measure of the amount of sunlight a particular area\/surface receives. <\/p>\n\n\n\n<p>Simply put, the higher the irradiance on a solar panel, the more the solar energy produced by that panel. And herein lies the catch, the world is designed in such a way that this irradiance varies from place to place and time to time. <\/p>\n\n\n\n<p>The fact is that irradiance varies throughout the day. The sun’s angle and position, moving clouds, bad weather, and air pollution all affect irradiance levels. Nonetheless, from year to year, the total amount of energy received from the sun remains relatively the same.<\/p>\n\n\n\n<p>In fact, in a particular year, irradiance causes a variation of between 5-10% of the suns energy captured by the solar cells. So in designing solar systems, irradiance data, mostly from weather databases are used. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\">2. Shading<\/h4>\n\n\n\n<p>An absolute no-brainer. Solar energy is energy from the sun’s light. It thus follows that if solar panels are shaded, less electricity is produced. We all know shading – that moment when you need the sun to hit your body and a tree or a building is blocking you. <\/p>\n\n\n\n<p>Solar panels also need direct sunlight that bad to produce much electricity. Of consideration, however, is that shading is not constant throughout the year, it varies seasonally. <\/p>\n\n\n\n<p>A tree or a building that produces a shade at noon in March will not be the one that gives a shade to the same panels in September. The reason is, the sun has positional angles which change all through the year. <\/p>\n\n\n\n<p>Meaning, trees, buildings and other barriers potentially become shading issues in different times of the year. Proper design can minimise all this. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\">3. Soiling<\/h4>\n\n\n\n<p>Quite straight forward. Dirty solar panels produce less power. Soiling here simply refers to dirt, dust, tree leaves, and any form of debris that settles on the surface of the panels. <\/p>\n\n\n\n<p>When the debris settle on the surface of panels, they block the sunlight from reaching the solar cells hence impeding the solar system desired performance. Clean the system to get the best results.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">4. Temperature<\/h4>\n\n\n\n<p>Of all the factors, this is the most interesting, and it’s because it’s not a no brainer as you may have thought. The warmer the solar cells get, the less the amount of electricity they produce. <\/p>\n\n\n\n<p>You see, all of us might have had of conversations like this, “Man, this area is so hot, solar can do so well here.” Or, “This weather is too cold down here, I pity those who are using solar now.” Well, it turns out, the reverse is true. For the few who know the science behind electricity, it’s a game of electrons in motion. <\/p>\n\n\n\n<p>The hotter the solar cell material is, the more resistance there is and the slower the electrons can move through it. Logically, electricity production reduces as not as many electrons can get through the circuitry in the same amount of time as before. <\/p>\n\n\n\n<p>And this is where the question of quality best lies. The quality of the solar panels to be precise. High quality panels can maintain optimum performance even at high temperatures.<\/p>\n\n\n\n<p>Hopefully, these factors have been an eye opener in this age of solar revolution. But, remember always, that the quality of panels and the system design is everything in solar energy production.<\/p>\n<div class=\"energ-after-content\" id=\"energ-3472412470\"><script async src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js?client=ca-pub-4467099352079704\" crossorigin=\"anonymous\"><\/script><ins class=\"adsbygoogle\" style=\"display:inline-block;width:728px;height:90px;\" \ndata-ad-client=\"ca-pub-4467099352079704\" \ndata-ad-slot=\"8891238828\"><\/ins> \n<script> \n(adsbygoogle = window.adsbygoogle || []).push({}); \n<\/script>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Simple Factors Affecting Solar Performance worth Knowing Over the past five years, solar energy use has grown in East Africa and especially Kenya. Boosted by a government regulation on solar energy and high cost of power, many Kenyans and commercial entities have taken solar energy use into much consideration. Several examples abound, from homes to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1000,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[202],"tags":[],"class_list":["post-956","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advisory"],"_links":{"self":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/956","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/comments?post=956"}],"version-history":[{"count":8,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/956\/revisions"}],"predecessor-version":[{"id":1296,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/posts\/956\/revisions\/1296"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media\/1000"}],"wp:attachment":[{"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/media?parent=956"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/categories?post=956"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/energyzedworld.com\/wp-json\/wp\/v2\/tags?post=956"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}